Locale_Text = {}

Locale_Text[11] = "吞星者重型后勤舰"
Locale_Text[12] = "莫尔迪基安大君舰队专用后勤舰的...改良版，其最大的改动是增加了舰内的厕所数量！这很重要！需要：D级权限高级挖煤工科技"
Locale_Text[21] = "方舟工程舰"
Locale_Text[22] = "阿因特斯舰队的通用工程舰，除了采集资源还可以承担轻量级维修任务。"
Locale_Text[31] = "大君的挖煤船"
Locale_Text[32] = "莫尔迪基安大君舰队专用工程舰的...改良版，跟大君舰队的型号似乎也没有什么不同。"
Locale_Text[41] = "飞镖战斗机"
Locale_Text[42] = "零号舰队为低烈度空战而设计的通用型战斗机"
Locale_Text[51] = "飞镖战斗机轰炸型"
Locale_Text[52] = "零号舰队为低烈度空战而设计的通用型轰炸机"

Locale_Text[80] = "资源模块"
Locale_Text[81] = "每5秒合成10RU的资源,需要：E级权限"

Locale_Text[61] = "破刃舰载机空战型零式"
Locale_Text[62] = "阿因特斯舰队破刃型舰载机...与大君破刃相比基本上除了骨架其他什么东西都不同。需要：E级权限精锐舰载机科技"
Locale_Text[71] = "破刃舰载机轰炸型零式"
Locale_Text[72] = "阿因特斯舰队破刃型舰载机轰炸型...与大君破刃相比基本上除了骨架其他什么东西都不同。需要：E级权限精锐舰载机科技"
Locale_Text[85] = "萨摩耶级重型突击舰"
Locale_Text[86] = "菲雅利帝国重型突击舰萨摩耶...见人不怕，放狗咬他！需要：E级权限重型突击舰科技"
Locale_Text[91] = "雷鸣级护卫轨道炮"
Locale_Text[92] = "改装自菲雅利帝国的雷鸣级护卫舰，其最大的改动是终于实现了无人驾驶...可以换战损了！需要：E级权限护卫型轨道炮科技"
Locale_Text[101] = "圣盾级驱逐舰"
Locale_Text[102] = "菲雅利帝国圣盾级驱逐舰量产型号。需要：E级权限通用驱逐舰科技"
Locale_Text[111] = "星尘驱逐舰防空型"
Locale_Text[112] = "菲雅利帝国星尘驱逐舰量产型号。需要：E级权限通用驱逐舰科技"
Locale_Text[115] = "尸鬼级"
Locale_Text[116] = "莫尔迪基安大君舰队派遣的挖煤护卫编队。需要：E级权限支援护卫舰科技"
Locale_Text[117] = "业火级"
Locale_Text[118] = "莫尔迪基安大君舰队派遣的挖煤护卫编队。需要：E级权限支援护卫舰科技"

Locale_Text[121] = "超空间模块"
Locale_Text[122] = "可以让本舰级周围舰船进行超空间跳跃的模块。"
Locale_Text[131] = "探测器模块"
Locale_Text[132] = "可以扩大探测范围的探测器模块"

Locale_Text[141] = "资源模块"
Locale_Text[142] = "每个资源模块每5秒基础产出10RU 需要：E级权限"

Locale_Text[151] = "精锐级炮艇生产许可"
Locale_Text[152] = "阿因特斯舰队综合外域技术设计而成的超重型炮艇单位。经过升级可以拥有变形为重炮模式的掠袭形态。需要：C级权限精锐级炮艇科技"
Locale_Text[161] = "星尘驱逐舰守护型"
Locale_Text[162] = "阿因特斯舰队守护型星尘驱逐舰，通常作为旗舰单位的最外围协防舰船伴随出战。需要：E级权限小型护航舰队科技"
Locale_Text[171] = "圣盾级驱逐舰G型"
Locale_Text[172] = "圣盾驱逐舰的幽灵舰队的魔改型号，其装甲和武器核心技术与女皇6天罚型一脉相承。需要：D级权限精锐驱逐舰科技"
Locale_Text[181] = "大君的高级挖煤工"
Locale_Text[182] = "莫尔迪基安大君舰队专用后勤舰的...改良版，其最大的改动是增加了舰内的厕所数量！这很重要！需要：D级权限高级挖煤工科技"
Locale_Text[191] = "巴伦安特级轨道炮"
Locale_Text[192] = "根据命运级伴随武器改造而来的巴伦安特级轨道炮，使用了人工智能替换梵玛控制模块。需要：D级权限巡洋级轨道炮科技"

Locale_Text[201] = "闪光之刃级战列巡洋舰"
Locale_Text[202] = "莫尔迪基安大君舰队专用闪烁之刃级战列巡洋舰的...改良版,据称是用来打碎资源小星星用的。需要：C级权限大型煤矿粉碎船科技"
Locale_Text[211] = "裂痕A型战列舰"
Locale_Text[212] = "菲雅利帝国舰队裂痕A型战列舰，专为舰队大规模装备设计。时代经典，战力可靠。需要：C级权限基石战列舰科技"
Locale_Text[221] = "裂痕C型战列舰"
Locale_Text[222] = "菲雅利帝国舰队裂痕C型战列舰，专为反旗舰设计。时代经典，战力可靠。需要：C级权限基石战列舰科技"
Locale_Text[231] = "裂痕扫荡者"
Locale_Text[232] = "菲雅利帝国舰队裂痕扫荡者级战列舰。时代经典，战力可靠。需要：C级权限基石战列舰科技"
Locale_Text[241] = "裂痕2C型"
Locale_Text[242] = "裂痕2型战列舰蚁巢舰队精英魔改型，使用蚁壳素改进了装甲、加强了武装并增加了三倍速推进器。需要：C级权限高级战列舰支科技"
Locale_Text[251] = "裂痕2D型绝空型"
Locale_Text[252] = "裂痕2型战列舰阿因特斯防空特化型，通常作为旗舰单位的内圈防御舰船伴随出战。需要：C级权限高级战列舰支科技"


Locale_Text[261] = "三叉戟超级无人机"
Locale_Text[262] = "零号舰队与帝国联合开发的三叉戟超级无人机，使用蚁壳素强化了装甲以及人工梵玛作为驾驶AI。需要：C级权限超级无人机科技"

Locale_Text[271] = "十四公主"
Locale_Text[272] = "菲雅利帝国暗夜女神级的阿因特斯舰队改进型。一般在大规模编队中作为补充反超旗火力而额外增编。需要：B级权限巨型护航舰队科技"
Locale_Text[281] = "光辉女神级无畏舰"
Locale_Text[282] = "菲雅利帝国光辉女神级无畏舰。目前是零号舰队的标准无畏编制舰船。需要：B级权限强化无畏舰科技"
Locale_Text[291] = "虚空级精英型无畏舰"
Locale_Text[292] = "蚁巢舰队超魔改虚空级无畏舰。使用了最新研发的超级反旗舰电磁炮和传统的蚁壳素改进装甲。需要：B级权限强化无畏舰科技"
Locale_Text[301] = "玛丽·德莱西娅"
Locale_Text[302] = "精锐型装甲航母携帝国舰载机编队，太太赛高！需要：C级权限第二母舰科技"
Locale_Text[311] = "克雷雅·达尔克"
Locale_Text[312] = "胜利和无敌的象征！所向披靡的帝国骑士“圣裁”克雷雅.达尔克参见！需要：A级权限女皇三型科技"
Locale_Text[321] = "莎拉·达尔克"
Locale_Text[322] = "勇气和誓约的见证！绝代风华的帝国舰队指挥官莎拉.达尔克参见！（来找跑路的老公的...需要：A级权限女皇三型科技"
Locale_Text[331] = "阿洛切特工程母舰"
Locale_Text[332] = "莫尔迪基安大君舰队专用工程母舰的...改良版，在这里就是来监工的！需要：B级权限高级煤矿监工科技"
Locale_Text[341] = "格力普斯卫星炮"
Locale_Text[342] = "幽灵舰队格力普斯卫星炮的专用炮口。会接收通过超空间传来的能量进行战术炮击。需要：B级权限格力普斯轨道炮科技"



Locale_Text[351] = "幻象"
Locale_Text[352] = "阿因特斯结合帝国与解析自外域的黑科技，为了发挥梵玛和骑士的战力专门设计的决战型单兵单位。"
Locale_Text[361] = "第六代女皇级战争方舟A型"
Locale_Text[362] = "重炮型女皇6能够提供超级可靠的火力支持。需要：A级权限堡垒级战舰科技"
Locale_Text[371] = "第六代女皇级战争方舟B型"
Locale_Text[372] = "光束型女皇6适合狙杀敌人的一切超旗。需要：A级权限堡垒级战舰科技"
Locale_Text[381] = "第六代女皇级战争方舟C型"
Locale_Text[382] = "阵列型女皇6适合与其他旗舰级火力一起组成超级火力网。需要：A级权限堡垒级战舰科技"
Locale_Text[391] = "圣域"
Locale_Text[392] = "蚁巢舰队以永恒2为基础的魔改型。附带圣裁和三叉戟舰载机进行作战。需要：A级权限女武神降临科技"
Locale_Text[401] = "彼岸级超级航母"
Locale_Text[402] = "朝圣者圣艾恩旅团彼岸级超级航母与舰载机编队。需要：A级权限旅团考察科技"
Locale_Text[411] = "第六代女皇级战争方舟天罚型"
Locale_Text[412] = "幽灵舰队以第六代女皇为基础的魔改型，运用了大量的实验性武器和防护系统。附带光晕舰载机进行作战。需要：A级权限幽灵行动科技"
Locale_Text[421] = "亚隆戴特"
Locale_Text[422] = "阿因特斯舰队旗舰命运级亚隆戴特号。需要：S级权限改变命运之剑科技"


Locale_Text[431] = "收割者级重型巡洋舰"
Locale_Text[432] = "菲雅利帝国舰队收割者级重型巡洋舰，作为帝国前线代表性单位活跃于战场。需要：D级权限基石巡洋舰科技"


Locale_Text[441] = "巴伦安特级轨道炮"
Locale_Text[442] = "根据命运级伴随武器改造而来的巴伦安特级轨道炮，使用了人工智能替换梵玛控制模块。需要：D级权限巡洋级轨道炮科技"

Locale_Text[451] = "三叉戟超级无人轰炸机"
Locale_Text[452] = "加装了远程突袭和大当量轰炸火力的三叉戟超级轰炸平台。需要：C级权限超级无人机科技"


Locale_Text[461] = "巡回者战列巡洋舰"
Locale_Text[462] = "菲雅利帝国舰队精锐巡回者战列巡洋舰，作为帝国前线中坚活跃于战场。需要：C级权限基石级战列巡洋舰科技"


Locale_Text[471] = "裂痕2E型重骑兵型"
Locale_Text[472] = "裂痕2型幽灵重骑兵型，特殊化改造推进器和武器系统让它可以冲锋并在近距离歼灭敌人。需要：B级权限高级战列舰科技"

Locale_Text[481] = "裂痕2F莫尔迪基安大君型"
Locale_Text[482] = "裂痕2型莫尔迪基安大君定制强化型，其为大君第二舰队战场中流砥柱之一。需要：B级权限高级战列舰科技"

Locale_Text[491] = "裂痕2G型旅团辅助航母"
Locale_Text[492] = "裂痕2型朝圣者圣艾恩旅团改造的辅助航母，作为彼岸编队的延伸而进入战场。需要：B级权限高级战列舰科技"

Locale_Text[501] = "裁决"
Locale_Text[502] = "配属于零号舰队的帝国骑士们的座驾。需要：B级权限超级舰载机科技"

Locale_Text[511] = "裂痕121级战列舰"
Locale_Text[512] = "蚁巢舰队裂痕121级战列舰。由裂痕2拼接两条裂痕1构成的试做型战场壁垒。需要：B级权限加强型战列舰科技"

Locale_Text[521] = "裂痕2GFG无畏战斗航母"
Locale_Text[522] = "莫尔迪基安超魔改航空战列舰。由大君型裂痕2拼接2条G型号裂痕2航母而组成。需要：B级权限加强型战列舰科技"

Locale_Text[531] = "旧日支配者"
Locale_Text[532] = "莫尔迪基安大君派驻于第二舰队辅助阿萝拉的Kingsglaive骑士（过来一起挖矿的）。需要：A级权限决战级舰载机科技"

Locale_Text[541] = "莫尔迪基安大君"
Locale_Text[542] = "完全整备的真.莫尔迪基安大君级战舰 大君开着他的大宝贝被老婆叫来挖矿了！需要：S级权限君临计划科技"

Locale_Text[543] = "阿瓦隆"
Locale_Text[544] = "仲裁庭本部所在地阿瓦隆。本舰协同四骑士接受指挥官调遣。需要：S级权限歌姬与骑士们科技"

Locale_Text[545] = "誓约胜利之剑"
Locale_Text[546] = "仲裁庭破法之剑。本舰受仲裁庭阿萝拉委托协助指挥官作战。需要：S级权限仲裁调停者科技"

Locale_Text[547] = "尤利西斯"
Locale_Text[548] = "蚁巢舰队刀锋女王坐舰。由埃赫洛斯嘉德分享了审判日的部分技术并由妖精重工建造。需要：S级权限刀锋女王利刃科技"

Locale_Text[551] = "破刃舰载机整备机库"
Locale_Text[552] = "可以自动召唤破刃舰载机。需要：D级权限+精锐舰载机科技"
Locale_Text[561] = "破刃轰炸机整备机库"
Locale_Text[562] = "可以自动召唤破刃轰炸机。需要：D级权限+精锐舰载机科技"
Locale_Text[571] = "三叉戟超级无人机整备机库"
Locale_Text[572] = "可以自动召唤三叉戟超级无人机。需要：B级权限+超级无人机科技"
Locale_Text[581] = "三叉戟超级轰炸机整备机库"
Locale_Text[582] = "可以自动召唤三叉戟超级轰炸机。需要：B级权限+超级无人机科技"


Locale_Text[591] = "1号ATTIS武器阵列"
Locale_Text[601] = "2号ATTIS武器阵列"
Locale_Text[602] = "建造8门ATTIS通用武器系统来进行制空和反舰防御。需要：母舰二级战斗科技"

Locale_Text[611] = "1号电磁轨道炮武器阵列"
Locale_Text[621] = "2号电磁轨道炮武器阵列"
Locale_Text[622] = "建造4门1000毫米电磁轨道炮来进行反旗舰攻击。需要：母舰三级战斗科技"


Locale_Text[651] = "解放者"
Locale_Text[652] = "阿因特斯综合外域技术设计而成的超重型炮艇单位，拥有变形为重炮模式的掠袭形态。"

Locale_Text[654] = "探索者"
Locale_Text[655] = "这是一只萌萌哒OB，别打，怕疼，会爆。"

Locale_Text[660] = "幻象IV游侠"        --162
Locale_Text[664] = "可装备不同武装的阿因特斯决战型单兵单位；4号破城炮兵装专用于强击大型目标。需要：A级权限决战级舰载机科技"
Locale_Text[670] = "幻象V啸月"        --163
Locale_Text[674] = "可装备不同武装的阿因特斯决战型单兵单位；5号散剑兵装专用于高机动压制战斗。需要：A级权限决战级舰载机科技"


Locale_Text[680] = "休伯利安"        --164
Locale_Text[685] = "失落之战舰。经过大量时间和投入修复以后，作为蚁巢舰队新旗舰使用。需要：S级权限失落战舰科技"



Locale_Text[920] = "破刃之剑"
Locale_Text[921] = "一种先进的超重型战斗机，拥有剑刃型机体可以轻松突破敌方空域。需要：D级权限君刃舰载机科技"

Locale_Text[930] = "破戟之刃"
Locale_Text[931] = "破刃之剑的简化版，拥有更好的机动性和更优秀的制造成本。需要：D级权限君刃舰载机科技"
