Locale_Text = {}


Locale_Text[5] =  "战斗机机库"
Locale_Text[6] =  "可以生产舰载机"
Locale_Text[10] = "轰炸机机库"
Locale_Text[11] = "可以投放4个小队的舰载轰炸机进行对舰作战"


Locale_Text[50] = "战斗机"
Locale_Text[51] = "艾洛斯帝国的制式战斗机,用来进行防空作战,建造条件:1级武器科技,属性:防御型单位"
Locale_Text[60] = "轰炸机"
Locale_Text[61] = "艾洛斯帝国的制式轰炸机,用来进行反舰作战,建造条件:1级武器科技,属性:攻击型单位"

Locale_Text[100] = "采矿船"
Locale_Text[101] = "一种制试采矿船,用来收集资源"
Locale_Text[105] = "资源控制舰"
Locale_Text[106] = "一直可以用来同时卸载大量资源的资源控制舰,装有一门重型防空炮塔,建造条件:2级船体科技,属性:生产单位"


Locale_Text[110] = "防空护卫舰"
Locale_Text[111] = "一种防空用的护卫舰(AA frigate),建造条件:1级武器科技和1级船体科技,属性:防御型单位"
Locale_Text[115] = "离子炮护卫舰"
Locale_Text[116] = "反舰攻击型护卫舰,适合多艘一起联合攻击敌人单艘的更大型目标,建造条件:1级武器科技和1级船体科技,属性:攻击型单位"
Locale_Text[120] = "电浆炮突击舰"
Locale_Text[121] = "装备了速射电浆炮的突击型护卫舰,建造条件:1级武器科技和1级船体科技,属性:攻击型单位"
Locale_Text[125] = "反舰鱼雷突击舰"
Locale_Text[126] = "装备了鱼雷发射器的突击舰,拥有良好的适应性,建造条件:2级武器科技和1级船体科技,属性:防御型单位"


Locale_Text[150] = "重型导弹艇"
Locale_Text[151] = "造价昂贵的重型导弹护航艇,适合集群出动给敌人以沉重的打击,建造条件:2级武器科技和1级船体科技,属性:防御型单位"



Locale_Text[200] = "离子炮驱逐舰"
Locale_Text[201] = "装备了一门重型离子武器的大型攻击型驱逐舰,适合多艘一起联合攻击敌人单艘的更大型目标,建造条件:3级武器科技和3级船体科技,属性:攻击型单位"

Locale_Text[210] = "火炮驱逐舰"
Locale_Text[211] = "装备了数门大口径火炮的防御型驱逐舰,成本较低,适合压制敌人大群护卫舰的进攻,建造条件:2级武器科技和2级船体科技,属性:防御型单位"
Locale_Text[215] = "防空驱逐舰"
Locale_Text[216] = "防空用的驱逐舰，专门用来驱逐空中单位,建造条件:2级武器科技和2级船体科技,属性:防御型单位"





Locale_Text[250] = "航母"
Locale_Text[251] = "一种可以生产轻型战斗机和召唤大型战舰支援的辅助型航母,建造条件:2级船体科技,属性:生产单位"
Locale_Text[255] = "探测系统"
Locale_Text[256] = "高级探测系统，必要条件：2级武器科技"

Locale_Text[260] = "光束狙击舰"
Locale_Text[261] = "一种巡洋舰级别的光束狙击舰，专门用来长程攻击敌人的大型单位，必要条件：3级武器科技和3级船体科技"

Locale_Text[270] = "防御巡洋舰"
Locale_Text[271] = "一种拥有厚重装甲和防御性护盾的压制性巡洋舰，能够轻松压制大群的小型战舰，必要条件：3级武器科技和3级船体科技"

Locale_Text[300] = "战列巡洋舰-菲米琳斯"
Locale_Text[301] = "装备了大口径火炮的战列巡洋舰，其各方面性能都接近战列舰，和战列巡洋舰-娜贝琉斯比起来，它在射速和射程上有更高的优势，但是命中率较低,建造条件:3级武器科技和4级船体科技,属性:防御型单位"


Locale_Text[305] = "战列巡洋舰-娜贝琉斯"
Locale_Text[306] = "装备了大型离子炮的战列巡洋舰，其各方面性能都接近战列舰，和战列巡洋舰-菲米琳斯比起来，它在精度和威力有更高的优势，但是射程较近，适合攻击单体目标,建造条件:4级武器科技和3级船体科技,属性:攻坚型单位"


Locale_Text[400] = "塔尔洛斯级战列舰"
Locale_Text[401] = "一种装备了大量重型火炮的防御型战列舰,拥有强大的攻防能力,建造条件:4级武器科技和4级船体科技,属性:防御型单位"


Locale_Text[405] = "塔尔洛斯级战列舰光束版"
Locale_Text[406] = "装备了大型离子炮塔的塔尔洛斯级，专门用来压制敌人的巨型战舰,建造条件:4级武器科技和4级船体科技,属性:防御型单位"
Locale_Text[407] = "英德拉斯级战列舰"
Locale_Text[408] = "新型电磁炮战列舰，专门用来压制敌人的巨型战舰,建造条件:5级武器科技和4级船体科技,属性:防御型单位"


Locale_Text[410] = "无畏舰"
Locale_Text[411] = "拥有厚重装甲和攻城重炮的大型无畏舰,建造条件:5级武器科技和5级船体科技,属性:攻击型单位"



Locale_Text[450] = "吸血鬼超级战斗机"
Locale_Text[451] = "拥有厚重装甲和强大武器的超精锐战斗机，,建造条件:4级武器科技和3级船体科技,属性:攻击型单位"


Locale_Text[455] = "赛芙莉尔号要塞舰"
Locale_Text[456] = "艾洛斯帝国的最强大武器，拥有难以想象的火力和战斗力,建造条件:6级武器科技和6级船体科技,属性:终极兵器"



Locale_Text[500] = "防空炮塔"
Locale_Text[501] = "一种装备了小口径防空武器的移动试平台,拥有反导能力,可以再次部署,建造条件:1级船体科技,属性:防御型单位"
Locale_Text[505] = "防空导弹塔"
Locale_Text[506] = "装备了短程防空导弹的武器平台,可以有效对付战斗机和护航艇,只能一次性部署,建造条件:1级武器科技和2级船体科技,属性:防御型单位"
Locale_Text[510] = "重型反舰导弹武器平台"
Locale_Text[511] = "装备了重型反舰攻击导弹的支援型武器平台,用来摧毁敌人的大型战舰,只能一次性部署,建造条件:2级武器科技和2级船体科技"
Locale_Text[515] = "重型火炮武装平台"
Locale_Text[516] = "装备了大口径重型火炮的高阶大型平台,可以缓慢移动,建造条件:4级武器科技和3级船体科技"
Locale_Text[520] = "高能脉冲炮平台"
Locale_Text[521] = "装备了可以区域杀伤的高能脉冲炮的高阶大型平台,可以缓慢移动,建造条件:3级武器科技和3级船体科技"


Locale_Text[530] = "重力场发生器"
Locale_Text[531] = "一种先进的重力场发生器，可以产生大范围的重力场,建造条件:2级船体科技"
Locale_Text[540] = "格林布鲁斯特要塞"
Locale_Text[541] = "固定的太空要塞,无法移动，需要靠跳跃来部署,建造条件:3级武器科技和5级船体科技"




Locale_Text[550] = "ADF-01战斗机"
Locale_Text[560] = "ADF-02战斗机"
Locale_Text[570] = "CFA-44战斗机"
Locale_Text[580] = "MIG33 Black战斗机"
Locale_Text[590] = "Su-33 Strigon战斗机"
Locale_Text[600] = "Viper MkI战斗机"
Locale_Text[610] = "XFA-27 Varkyrie战斗机"
Locale_Text[615] = "艾洛斯帝国的精锐战斗机"


Locale_Text[620] = "电浆炮突击艇"
Locale_Text[625] = "装备了电浆武器的大型突击艇,建造条件:2级武器科技和2级船体科技"

Locale_Text[630] = "猎隼号"
Locale_Text[635] = "集合维格尔人科技制造出来的艾洛斯新型战舰,建造条件:3级武器科技和4级船体科技。英雄舰：限造一艘英雄舰，出场自带ACE战斗机小队"
Locale_Text[640] = "巡航管制舰"
Locale_Text[645] = "拥有厚重装甲和导弹发射阵列的实验型航母,建造条件:3级武器科技和5级船体科技。英雄舰：限造一艘英雄舰，出场自带ACE战斗机中队"
Locale_Text[650] = "格蕾丝马瑞亚"
Locale_Text[655] = "拥有较高移动速度的实验型航母,建造条件:3级武器科技和5级船体科技。英雄舰：限造一艘英雄舰，出场自带ACE战斗机中队"
Locale_Text[660] = "曜锋号战列舰"
Locale_Text[665] = "异文明使节定制的特殊战列舰，拥有强大的攻城主炮和强大火力,建造条件:5级武器科技和4级船体科技。英雄舰：限造一艘英雄舰，出场自带ACE战斗机小队"


Locale_Text[700] = "空间撕裂者级巡洋舰"
Locale_Text[701] = "艾洛斯最新研发的一种主力巡洋舰，拥有坚固的装甲和不错的航速,建造条件:2级武器科技和3级船体科技。"


Locale_Text[710] = "阿尔贝迪欧号超级战列舰"
Locale_Text[711] = "艾洛斯最新研发的一种超级战列舰，拥有强大的武备和浮游炮群,建造条件:5级武器科技和5级船体科技。"


Locale_Text[720] = "海姆道尔级战列巡洋舰"
Locale_Text[721] = "艾洛斯最新研发的一种战列巡洋舰，拥有战列舰级的主炮和大量大口径主炮,建造条件:4级武器科技和4级船体科技。"




Locale_Text[1000] = "alos_af_unicornI型战斗机"
Locale_Text[1005] = "alos_af_unicornII型战斗机"
Locale_Text[1010] = "alos_af_unicornIII型战斗机"
Locale_Text[1015] = "MIG29战斗机"
Locale_Text[1020] = "MIG31战斗机"

Locale_Text[1030] = "绵羊级工程船"
Locale_Text[1031] = "菲雅利帝国援助的战地工程舰，仅能进行远程修理，无法采矿"

Locale_Text[1040] = "黑猫级工程舰"
Locale_Text[1041] = "菲雅利帝国援助的大型工程舰，拥有强力修理能力"


Locale_Text[1050] = "审判日"
Locale_Text[1051] = "埃赫洛斯嘉德帝国莱茵索伦军团审判日，是为帝国最后的希望"










