Locale_Text = {}



Locale_Text[1] = "高效能采矿艇"
Locale_Text[2] = "一种拥有超高采矿效率的采矿艇，适用于初期的资金积累"


Locale_Text[10] = "1级小型护盾产生器"
Locale_Text[11] = "可以产生装甲值5W左右的护盾，需要：1级护盾科技"
Locale_Text[20] = "小型从属舰"
Locale_Text[21] = "拥有部分战术舰功能的支援型战舰，需要：1级船体科技"
Locale_Text[22] = "中型从属舰"
Locale_Text[23] = "拥有部分战术舰功能的支援型战舰，需要：3级船体科技"
Locale_Text[25] = "中型战术舰船体"
Locale_Text[26] = "需要：2级船体科技 （警告，你只能拥有两艘战术舰，一旦需要升级，必须自爆其中一艘）"
Locale_Text[27] = "大型战术舰船体"
Locale_Text[28] = "需要：4级船体科技（警告，你只能拥有两艘战术舰，一旦需要升级，必须自爆其中一艘）"
Locale_Text[29] = "大型从属舰"
Locale_Text[30] = "拥有部分战术舰功能的支援型战舰，需要：5级船体科技"
Locale_Text[40] = "重型战术舰船体"
Locale_Text[41] = " 需要：6级船体科技（警告，你只能拥有两艘战术舰，一旦需要升级，必须自爆其中一艘）"
Locale_Text[4040] = "重型从属舰船体"
Locale_Text[4041] = "拥有4个巨型武器位的强力从属舰 需要：7级船体科技"
Locale_Text[42] = "巨型战术舰船体"
Locale_Text[43] = " 需要：9级船体科技（警告，你只能拥有两艘战术舰，一旦需要升级，必须自爆其中一艘）"
Locale_Text[44] = "战术航母船体"
Locale_Text[45] = "可是制造大量无人机的小型航母 需要：6级船体科技和3级无人机科技（警告，你只能拥有两艘战术舰，一旦需要升级，必须自爆其中一艘）"
Locale_Text[46] = "巨型母舰船体"
Locale_Text[47] = "可以制造大量的浮游炮 需要：8级船体科技和5级无人机科技（警告，你只能拥有两艘战术舰，一旦需要升级，必须自爆其中一艘）"
Locale_Text[48] = "小型战术舰船体"
Locale_Text[49] = "灵活快速的小型战术舰船体，拥有1个中型武器和3个小型武器 （警告，你只能拥有两艘战术舰，一旦需要升级，必须自爆其中一艘）"
Locale_Text[2500] = "超级母舰船体"
Locale_Text[2501] = "可以制造大量的浮游炮 需要：10级船体科技和7级无人机科技（警告，你只能拥有两艘战术舰，一旦需要升级，必须自爆其中一艘）"


-------------------------------------------------------------------------------------------


Locale_Text[60] = "双联装75毫米火炮"
Locale_Text[61] = "拥有高精度和高威力的小型火炮"
Locale_Text[50] = "双联装90毫米加农炮"
Locale_Text[51] = "拥有高精度和强大火力的先进加农炮"
Locale_Text[205] = "双联装175毫米舰炮"
Locale_Text[206] = "拥有可靠性能的先进反舰武器，可以有效击穿护卫舰的装甲"
Locale_Text[230] = "双联装200毫米舰炮"
Locale_Text[231] = "175毫米舰炮的升级版，在原先基础上增加了对中型舰艇的破坏力"
Locale_Text[215] = "单管425毫米重炮"
Locale_Text[216] = "大口径的重炮，拥有大威力，但是命中率偏低"
Locale_Text[410] = "单装1000毫米电磁轨道炮"
Locale_Text[411] = "一种高穿透力的长程火炮，命中率高，可以有效的击穿旗舰的装甲"
Locale_Text[400] = "三联装425毫米重型加农炮"
Locale_Text[401] = "性能稳定攻击力强大的重炮，炮弹爆炸时能造成范围伤害"
Locale_Text[420] = "单管1400毫米加农炮"
Locale_Text[421] = "拥有可怕质量和破坏力的大口径弹头，拥有强大的威力和射程"
Locale_Text[610] = "四联装1000毫米电磁轨道炮"
Locale_Text[611] = "一种高穿透力的长程火炮，命中率高，杀伤力强大"
Locale_Text[615] = "双联装4800毫米加农炮"
Locale_Text[616] = "一种威力超强的超口径巨炮，一发命中就可以重创敌人"


Locale_Text[55] = "双联装75毫米防空破片炮"
Locale_Text[56] = "使用空爆弹对敌人的战斗机造成范围伤害。需要：2级小型射弹武器科技"
Locale_Text[70] = "三联装57毫米频射炮"
Locale_Text[71] = "高射速的近防武器，可以对敌人的战斗机，炮艇，护卫舰造成额外伤害"
Locale_Text[210] = "四联装75毫米速射炮"
Locale_Text[211] = "拥有出色的防空性能，连续发射的弹头可以撕碎各类中小型战舰"
Locale_Text[200] = "六联装57毫米速射炮"
Locale_Text[201] = "可以发射大量的弹药，密集的弹雨可以轻松撕碎敌人的轻型单位"
Locale_Text[405] = "双联装560毫米反旗舰火炮"
Locale_Text[406] = "使用一种特制的高爆弹头来攻击敌舰，可以对旗舰级战舰的装甲造成额外伤害"


Locale_Text[500] = "ATTIS速射防御系统"
Locale_Text[501] = "装备了特制编程高爆弹头的305毫米速射火炮，可以有效消灭中小型单位"
Locale_Text[415] = "305毫米四联装速射炮"
Locale_Text[416] = "四联装305高速火炮，可以发射可怕的金属弹幕消灭敌人"
Locale_Text[600] = "四联装1400毫米巨炮"
Locale_Text[601] = "一种攻击力强大的巨型火炮，可以持续的对敌人舰队进行轰炸直到消灭目标"

Locale_Text[605] = "四联装3500毫米巨炮"
Locale_Text[606] = "装备了高爆弹头的大口径巨炮，可以造成范围伤害，持续射击可以轻松的毁灭一支舰队"

Locale_Text[105] = "脉冲发射器"
Locale_Text[106] = "一种用来反艇的光线武器，拥有较高的精度，可以对敌人的战斗机，炮艇，护卫舰造成额外伤害"
Locale_Text[110] = "离子炮发射器"
Locale_Text[111] = "用强大的能量流摧毁敌舰的主力反舰武器"
Locale_Text[255] = "双联装离子炮发射器"
Locale_Text[256] = "离子炮发射器的双联装版，让其可以拥有双倍的威力"
Locale_Text[260] = "双联装粒子炮发射器"
Locale_Text[261] = "双联装的粒子发生器，让其可以拥有双倍的威力"
Locale_Text[460] = "离子波动炮"
Locale_Text[461] = "一种拥有强大的穿透力的光线武器，可以有效击穿旗舰的装甲"
Locale_Text[510] = "双联装大型离子炮发射器"
Locale_Text[511] = "威力强大的大型离子炮发射器"
Locale_Text[465] = "激光束发射器"
Locale_Text[466] = "一种时间短暂但是高破坏力的光束武器"
Locale_Text[660] = "双联装离子加农炮"
Locale_Text[661] = "一种高性能的旗舰级光束武器，可以造成可怕的破坏"
Locale_Text[670] = "双联装巨型波动炮"
Locale_Text[671] = "这种武器拥有极远的射程和超强的穿透力，一次射击可以轻松贯穿数艘战舰"



Locale_Text[100] = "光子机枪"
Locale_Text[101] = "一种射速和威力都不错的武器，但是准头太低，可以对敌人的战斗机，炮艇，护卫舰造成额外伤害"
Locale_Text[120] = "电浆投射炮"
Locale_Text[121] = "将能量团压缩成光球后进行发射，在命中目标后炸开的攻击性武器"
Locale_Text[250] = "四联装光子机枪"
Locale_Text[251] = "光子机枪的四联装版，发射时漫天飞舞的光弹让敌人的战机难以逃离"
Locale_Text[270] = "重型镭射弹发射器"
Locale_Text[271] = "维格尔战列巡洋舰所使用的主力武器的简化版，破坏力强大"

Locale_Text[450] = "光子加农炮发射器"
Locale_Text[451] = "将能量压缩成一个能量团并抛射出去造成可怕伤害的武器"
Locale_Text[470] = "双联装等离子投射炮"
Locale_Text[471] = "可以快速投射大量小型等离子投射器，拥有可观的伤害输出"
Locale_Text[455] = "双联装重型镭射弹"
Locale_Text[456] = "发射大威力镭射弹的能量武器，单发威力较高"
Locale_Text[655] = "双联装等离子鱼雷发射器"
Locale_Text[656] = "强大的能量武器投射装置，拥有可怕的伤害力"
Locale_Text[665] = "双联装巨型光子加农炮"
Locale_Text[666] = "这种连续投射的能量炸弹所产生的爆炸可以轻松的重创敌舰，不过命中率较低"

Locale_Text[150] = "双联装防空导弹"
Locale_Text[151] = "高性能的防空导弹，可以准确的击落敌机"
Locale_Text[160] = "鱼雷发射器"
Locale_Text[161] = "可以通用的子母鱼雷和反舰鱼雷"
Locale_Text[300] = "四联装通用型飞弹发射井"
Locale_Text[301] = "四联装的通用型飞弹发射器，可以有效的攻击各种小型单位"
Locale_Text[310] = "六联装萤火虫飞弹发射井"
Locale_Text[311] = "一种体型小巧的反舰飞弹，依靠数量优势对敌人战舰造成伤害，需要：3级中型制导武器科技"
Locale_Text[505] = "四联装重型鱼雷"
Locale_Text[506] = "重型反舰鱼雷，爆炸威力惊人"
Locale_Text[520] = "暴风导弹发射器"
Locale_Text[521] = "强大的多目标攻击导弹，暴风导弹所携带的多弹头子母弹可以毁灭一支舰队"
Locale_Text[700] = "8联装长程导弹发射器"
Locale_Text[701] = "依次发射8联装重型导弹，形成导弹弹幕攻击敌人"
Locale_Text[715] = "双联装白河超重型导弹发射器"
Locale_Text[716] = "白河超重型导弹的双联装版，旗舰级发射塔可以大大增加导弹的飞行速度"

Locale_Text[515] = "重型反舰巡航导弹"
Locale_Text[516] = "一种专门为了对付主力舰而研制的超重型反舰导弹，可以对敌人的大型旗舰造成有效伤害"


Locale_Text[65] = "单管175毫米舰炮"
Locale_Text[66] = "拥有足够破坏力的反舰武器，可以对敌人的护卫舰和主力舰造成额外伤害。需要：4级小型射弹武器科技"
-----------------------------------------------------------------------------------------------
Locale_Text[115] = "粒子炮发射器"
Locale_Text[116] = "用能量长时间灼烧敌舰舰体，对其造成伤害，需要：4级小型能量武器科技"
-----------------------------------------------------------------------------------------------
Locale_Text[155] = "通用型导弹"
Locale_Text[156] = "一种既可以用来反舰也可以用来防空的导弹，高爆弹头造成区域伤害，需要：2级小型制导武器科技"
Locale_Text[165] = "重型反舰导弹"
Locale_Text[166] = "威力强大的反舰导弹，重型弹头可以重创敌舰，但是不能防空，需要：4级小型制导武器科技"
Locale_Text[170] = "重型鱼雷"
Locale_Text[171] = "大威力的重型反舰鱼雷，飞行速度较慢但是威力强大，需要：5级小型制导武器科技"
--------------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------
Locale_Text[220] = "单管电磁投射炮"
Locale_Text[221] = "一种简化版的电磁轨道炮，尽管威力不够强大，但是拥有强大的弹丸初速和超高的对舰命中率，需要：5级中型射弹武器科技"
-----------------------------------------------------------------------------------------------
Locale_Text[265] = "重型离子炮"
Locale_Text[266] = "一种主力舰上才能使用的大威力能量武器，强大的能量流可以轻易的烧穿敌人的装甲，需要：4级中型能量武器科技"
-----------------------------------------------------------------------------------------------
Locale_Text[305] = "双联装鱼雷发射井"
Locale_Text[306] = "通用鱼雷发射器的双联装发射井，需要：2级中型制导武器科技"
Locale_Text[315] = "双联装重型鱼雷发射井"
Locale_Text[316] = "双联装版的重型反舰鱼雷，需要：4级中型制导武器科技"
Locale_Text[320] = "暴风导弹发射井"
Locale_Text[321] = "一种威力强大的子母飞弹，飞近敌人后瞬间散步出大量的子弹药，需要：5级中型制导武器科技"
--------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------
Locale_Text[620] = "双联装2000毫米攻城轨道炮"
Locale_Text[621] = "战列舰所使用的巨型火炮，拥有强大的威力和射程，需要：5级旗舰级射弹武器科技"
-----------------------------------------------------------------------------------------------
Locale_Text[650] = "双联装粒子炮"
Locale_Text[651] = "灵活，精准，致命的巨型武器，用高频率的精准光线攻击将敌人摧毁，需要：1级旗舰级能量武器科技"
-----------------------------------------------------------------------------------------------
Locale_Text[705] = "8联装重型鱼雷发射器"
Locale_Text[706] = "依次发射大量的重型高爆鱼雷，依靠鱼雷的大量数量摧毁敌人，需要：2级旗舰级制导武器科技"
Locale_Text[710] = "四联装暴风弹幕导弹"
Locale_Text[711] = "发射4发暴风大幕导弹，对敌人形成饱和攻击，需要：3级旗舰级制导武器科技"
Locale_Text[720] = "双联装核弹发射器"
Locale_Text[721] = "双联装的核弹发射装置，增加更多的攻击力，需要：5级旗舰级制导武器科技"

Locale_Text[11000] = "通用子系统套装"
Locale_Text[11001] = "套装子系统"

Locale_Text[800] = "强化船体的装甲值，让船体可以承受更多打击，需要：对应的船体科技"
Locale_Text[801] = "1级船体强化模块"
Locale_Text[802] = "2级船体强化模块"
Locale_Text[803] = "3级船体强化模块"
Locale_Text[804] = "4级船体强化模块"
Locale_Text[805] = "5级船体强化模块"
Locale_Text[806] = "6级船体强化模块"
Locale_Text[807] = "7级船体强化模块"
Locale_Text[808] = "8级船体强化模块"
Locale_Text[809] = "9级船体强化模块"
Locale_Text[810] = "10级船体强化模块"

Locale_Text[850] = "护盾发生器，可以让战舰拥有一个可以快速恢复的防护盾，每级提升一倍的护盾容量，需要：对应的护盾科技"
Locale_Text[851] = "1级护盾发生器"
Locale_Text[852] = "2级护盾发生器"
Locale_Text[853] = "3级护盾发生器"
Locale_Text[854] = "4级护盾发生器"
Locale_Text[855] = "5级护盾发生器"
Locale_Text[856] = "6级护盾发生器"
Locale_Text[857] = "7级护盾发生器"
Locale_Text[858] = "8级护盾发生器"
Locale_Text[859] = "9级护盾发生器"
Locale_Text[860] = "10级护盾发生器"

Locale_Text[900] = "火控系统，可以成倍的提升战舰的攻击力，每级提升0点5的战斗力，需要：对应的火控科技"
Locale_Text[901] = "1级火控系统"
Locale_Text[902] = "2级火控系统"
Locale_Text[903] = "3级火控系统"
Locale_Text[904] = "4级火控系统"
Locale_Text[905] = "5级火控系统"
Locale_Text[906] = "6级火控系统"
Locale_Text[907] = "7级火控系统"
Locale_Text[908] = "8级火控系统"
Locale_Text[909] = "9级火控系统"
Locale_Text[910] = "10级火控系统"

Locale_Text[950] = "修理系统，可以成倍的加快战舰的自我修复速度，每级提升1倍的修理速度，需要：对应的修复科技"
Locale_Text[951] = "1级修理系统"
Locale_Text[952] = "2级修理系统"
Locale_Text[953] = "3级修理系统"
Locale_Text[954] = "4级修理系统"
Locale_Text[955] = "5级修理系统"
Locale_Text[956] = "6级修理系统"
Locale_Text[957] = "7级修理系统"
Locale_Text[958] = "8级修理系统"
Locale_Text[959] = "9级修理系统"
Locale_Text[960] = "10级修理系统"

Locale_Text[1000] = "探测系统，可以成倍的加强战舰的探测能力，每级提升1倍的探测范围，需要：对应的探测科技"
Locale_Text[1001] = "1级探测系统"
Locale_Text[1002] = "2级探测系统"
Locale_Text[1003] = "3级探测系统"
Locale_Text[1004] = "4级探测系统"
Locale_Text[1005] = "5级探测系统"

Locale_Text[1050] = "动力加强系统，加强战舰的机动力，每级提升10%的速度，重舰以上等级的战舰不能装备，需要：对应的动力科技"
Locale_Text[1051] = "1级动力加强系统"
Locale_Text[1052] = "2级动力加强系统"
Locale_Text[1053] = "3级动力加强系统"
Locale_Text[1054] = "4级动力加强系统"
Locale_Text[1055] = "5级动力加强系统"



Locale_Text[1100] = "第1小型无人机小队"
Locale_Text[1101] = "释放一组小型无人机支援作战，需要：无人机科技1级"
Locale_Text[1105] = "第2小型无人机小队"
Locale_Text[1106] = "释放一组小型无人机支援作战，需要：无人机科技2级"
Locale_Text[1110] = "第3小型无人机小队"
Locale_Text[1111] = "释放一组小型无人机支援作战，需要：无人机科技3级"
Locale_Text[1115] = "第4小型无人机小队"
Locale_Text[1116] = "释放一组小型无人机支援作战，需要：无人机科技4级"
Locale_Text[1120] = "第5小型无人机小队"
Locale_Text[1116] = "释放一组小型无人机支援作战，需要：无人机科技5级"

Locale_Text[1200] = "第1中型无人机小队"
Locale_Text[1201] = "释放一组中型无人机支援作战，需要：无人机科技3级"
Locale_Text[1205] = "第2中型无人机小队"
Locale_Text[1206] = "释放一组中型无人机支援作战，需要：无人机科技4级"
Locale_Text[1210] = "第3中型无人机小队"
Locale_Text[1211] = "释放一组中型无人机支援作战，需要：无人机科技5级"
Locale_Text[1215] = "第4中型无人机小队"
Locale_Text[1216] = "释放一组中型无人机支援作战，需要：无人机科技6级"
Locale_Text[1220] = "第5中型无人机小队"
Locale_Text[1216] = "释放一组中型无人机支援作战，需要：无人机科技7级"

Locale_Text[1300] = "第1大型无人机小队"
Locale_Text[1301] = "释放一组大型无人机支援作战，需要：无人机科技5级"
Locale_Text[1305] = "第2大型无人机小队"
Locale_Text[1306] = "释放一组大型无人机支援作战，需要：无人机科技6级"
Locale_Text[1310] = "第3大型无人机小队"
Locale_Text[1311] = "释放一组大型无人机支援作战，需要：无人机科技7级"
Locale_Text[1315] = "第4大型无人机小队"
Locale_Text[1316] = "释放一组大型无人机支援作战，需要：无人机科技8级"
Locale_Text[1320] = "第5大型无人机小队"
Locale_Text[1316] = "释放一组大型无人机支援作战，需要：无人机科技9级"



Locale_Text[1400] = "小型浮游炮-离子炮"
Locale_Text[1401] = "释放一组搭载了离子炮的浮游炮进行战斗，需要：5级船体科技和5级无人机科技"
Locale_Text[1405] = "小型浮游炮-速射炮"
Locale_Text[1406] = "释放一组搭载了速射炮的浮游炮进行战斗，需要：5级船体科技和2级无人机科技"
Locale_Text[1410] = "小型浮游炮-导弹型"
Locale_Text[1411] = "释放一组搭载了黄蜂导弹的浮游炮进行战斗，需要：5级船体科技和3级无人机科技"
Locale_Text[1420] = "中型轨道炮"
Locale_Text[1421] = "一种搭载了战列级别重型武器的轨道炮，需要：7级船体科技和5级无人机科技"
Locale_Text[1430] = "大型轨道炮"
Locale_Text[1431] = "一种搭载了无畏舰主炮的超大型轨道炮，需要：9级船体科技和5级无人机科技"
Locale_Text[1440] = "小型无人机"
Locale_Text[1441] = "释放一组小型无人机进行战斗，主要用来对付敌人的战机单位，需要：1级无人机科技"
Locale_Text[1445] = "中型无人机"
Locale_Text[1446] = "释放一组中型无人机进行战斗，可以克制炮艇和小型战机，需要：2级无人机科技"
Locale_Text[1450] = "大型无人机"
Locale_Text[1451] = "释放一组大型无人机进行战斗，拥有较为高效的对空能力，需要：4级无人机科技"

Locale_Text[1500] = "超空间模块"
Locale_Text[1501] = "让所属战舰和一定范围内的战舰可以进行超空间跳跃，需要：2级探测科技"

Locale_Text[1505] = "重力井模块"
Locale_Text[1506] = "让所属战舰产生一种阻止跳跃的重力场，需要：4级探测科技"

Locale_Text[1510] = "星辰战斗机"
Locale_Text[1511] = "一种强大的超级战斗机，拥有护盾和超级强悍的火力，需要：7级战斗机科技"

Locale_Text[1515] = "龙鹰攻击机"
Locale_Text[1516] = "一种造价昂贵的终极兵器，可以轻松的摧毁最大型的战舰，需要：10级战斗机科技"

Locale_Text[2000] = "反舰无人机"
Locale_Text[2001] = "释放一组反舰无人机进行战斗，可以发射反舰导弹攻击较大型的战舰，需要：3级无人机科技"
Locale_Text[2005] = "大型反舰无人机"
Locale_Text[2006] = "释放一组大型反舰无人机进行战斗，有效的攻击敌人的大中型战舰，需要：5级无人机科技"
Locale_Text[2010] = "攻击型渡鸦轰炸机"
Locale_Text[2011] = "一种携带了高能等离子炸弹的超重型轰炸机，有效的攻击敌人的大型战舰和旗舰，需要：5级无人机科技"
Locale_Text[2015] = "核弹型渡鸦轰炸机"
Locale_Text[2016] = "一种携带了核弹头的超重型轰炸机，有效的攻击敌人的旗舰和大舰队群，需要：8级无人机科技"


Locale_Text[2100] = "炽天使之环"
Locale_Text[2101] = "先进的能量兵器，拥有强大的火力。但是较为脆弱，容易在战斗中被摧毁"

Locale_Text[2110] = "依文洁琳号战列舰"
Locale_Text[2111] = "帝国骑士团团长的座舰，拥有强大的战斗力"




Locale_Text[2220] = "长矛重型截击机"
Locale_Text[2221] = "装甲厚重的大型截击机，拥有可观的生存力，需要：4级无人机科技"

Locale_Text[2230] = "长矛重型截击机攻击型"
Locale_Text[2231] = "装甲厚重的大型攻击型，拥有可观的生存力和反舰能力，需要：5级无人机科技"

Locale_Text[2240] = "裁决舰载机"
Locale_Text[2241] = "先进的反主力舰超级战斗机，制空能力同样也很出色，需要：7级无人机科技"

Locale_Text[2250] = "飞龙超级舰载机"
Locale_Text[2251] = "重型反旗舰战略轰炸机，投弹后需要返回装填，需要：7级无人机科技"

Locale_Text[2260] = "雷霆超级舰载机"
Locale_Text[2261] = "拥有反旗舰能力的超级舰载机，需要：8级无人机科技"

Locale_Text[2270] = "神罚舰载机"
Locale_Text[2271] = "先进的制空超级舰载机，需要：9级无人机科技"

Locale_Text[2280] = "光晕超级舰载机"
Locale_Text[2281] = "携带全套超级浮游炮组的超级舰载机，需要：10级无人机科技"
--zgn_superfighter_Dragonlance

Locale_Text[2285] = "神罚舰载机-歼灭型"
Locale_Text[2286] = "超级突击舰载机，可以实现高效率的战场突袭，千里之外一击瘫痪对手的核心中枢，需要：10级无人机科技和9级船体科技"



Locale_Text[2290] = "从属航母"
Locale_Text[2291] = "可以生产各种超级舰载机的重工航母，需要：7级船体科技和5级无人机科技"

Locale_Text[2295] = "离子炮模块"
Locale_Text[2296] = "战术航母的加强型模块"
Locale_Text[2305] = "导弹模块"
Locale_Text[2306] = "战术航母的加强型模块"
Locale_Text[2315] = "无人机模块"
Locale_Text[2316] = "战术航母的加强型模块"


Locale_Text[2400] = "超级从属舰"
Locale_Text[2401] = "拥有可换装超级主炮的超级战术舰，需要：10级船体科技"


Locale_Text[2410] = "5300毫米超倍径攻城炮"
Locale_Text[2411] = "超强威力的攻城重炮，需要：9级重炮武器科技"
Locale_Text[2420] = "6联装3500毫米榴弹投射器"
Locale_Text[2421] = "不断发射造成可怕杀伤的大威力毁灭武器，需要：9级速射炮武器科技"
Locale_Text[2430] = "超级离子加农炮发射阵列"
Locale_Text[2431] = "精华一切的超级光束，需要：9级光束武器科技"
Locale_Text[2440] = "连发型光子加农投射炮"
Locale_Text[2441] = "不断输出造成可怕伤害的能量弹武器，需要：9级能量弹武器科技"
Locale_Text[2450] = "40联装妖精飞弹风暴发射巢"
Locale_Text[2451] = "不断发射的重型反舰导弹集群，需要：9级导弹武器科技"
