Locale_Text = {}



Locale_Text[100] = "重型巡洋舰"
Locale_Text[101] = "一种精简版的战列巡洋舰,在大大削弱了火力和体积的同时却安装了大量致命的防空武器。建造条件:主力舰模块或者超空间模块"
Locale_Text[110] = "防空驱逐舰"
Locale_Text[111] = "将驱逐舰的主炮弹药换装破片弹头后改良而来的防空用驱逐舰。建造条件：超空间模块和驱逐舰机架"
Locale_Text[120] = "脉冲炮台"
Locale_Text[121] = "调整离子炮台火力输出功率后改进而来的反艇用脉冲炮台。建造条件：离子炮平台科技"
Locale_Text[125] = "教主级战列舰"
Locale_Text[126] = "制造要求较低的一种支援型战列舰，拥有可靠的防御力和火力。建造条件：科技模块和教主战列舰科技"
Locale_Text[130] = "领主级战列舰"
Locale_Text[131] = "一种安装了堡垒级鱼雷和大量离子炮的巨型战舰，专门用来攻击敌人的主力舰群。建造条件：高级科技模块和战列舰科技"
Locale_Text[140] = "防御无畏舰"
Locale_Text[141] = "巨大的重装甲无畏舰，可以轻松阻挡敌人的一切攻势。但是每一艘的建造都非常的缓慢，需要大量的时间  建造条件：无畏舰科技"
Locale_Text[150] = "大型无畏舰紧急召唤"
Locale_Text[151] = "消耗大量资源紧急召唤一艘无畏舰前来助战。"
Locale_Text[160] = "主力舰召唤信标"
Locale_Text[161] = "召唤在附近星区中巡航的大中型战舰舰跳跃到前线支援战斗"
Locale_Text[170] = "格斗突击舰"
Locale_Text[171] = "一种拥有强大近战火力的突击战舰,缺点是射程十分的近,需要飞近才能攻击。"
Locale_Text[180] = "雄蜂战斗机"
Locale_Text[181] = "从先祖科技中获得的一种先进战斗机，拥有强悍的战斗力。"
Locale_Text[190] = "鱼雷驱逐舰"
Locale_Text[191] = "一种先进的反主力舰战舰，装备有先进的穿甲鱼雷，可以对敌人的旗舰和大型主力舰造成有效伤害。"

Locale_Text[250] = "萨尤克之匙"
Locale_Text[251] = "先祖科技的产物，一种拥有强力离子加农炮的支援型战舰。  建造条件：高级科技模块和萨尤克之匙科技"


Locale_Text[200] = "战斗机机库"          
Locale_Text[201] = "可以生产舰载机"
Locale_Text[210] = "超级炮艇召唤设施"
Locale_Text[211] = "可以释放装甲突击舰支援战斗"
Locale_Text[220] = "主力舰级护盾发生器"
Locale_Text[221] = "可以产生一个容量为100WHP的大型防护盾 注意：无法和其他防御系子系统兼容"
Locale_Text[225] = "战列巡洋舰火控塔"
Locale_Text[226] = "可以提升1倍的火力，但是只对本体有效 注意：无法和其他攻击系子系统兼容"
Locale_Text[227] = "战列巡洋舰重力井" 
Locale_Text[228] = "产生一个重力场阻止敌人跳跃靠近 注意：无法和其他防御系子系统兼容"
Locale_Text[229] = "战列巡洋舰跳跃模块"
Locale_Text[230] = "让战列巡洋舰可以进行跳跃  注意：无法和其他防御系子系统兼容"
---------------------------------------------------
Locale_Text[300] = "移动模式"
Locale_Text[301] = "将核心的能量平均分配给船体各处，萨尤克可以自由的移动和跳跃"
Locale_Text[305] = "攻城模式"
Locale_Text[306] = "将核心的能量集中输出到主炮上，但是移动能力将受到限制"
Locale_Text[310] = "防御模式"
Locale_Text[311] = "将核心的能量释放出来形成一个强大的能量护盾，但是移动和开火能力将受到限制"

Locale_Text[400] = "重型防御平台"
Locale_Text[401] = "坚固的防御平台，可以抵挡各种武器的进攻,建造条件：高级科技模块和高级平台科技"

Locale_Text[500] = "旗舰级科技模块"
Locale_Text[501] = "先进的科技模块，允许建造最高级的舰队旗舰。  建造条件：高级科技模块"

Locale_Text[600] = "魔方级装甲突击舰"
Locale_Text[601] = "拥有厚重装甲的重型突击舰，可以在战场上进行持久的战斗，需要：护卫舰工厂或者超空间模块"


Locale_Text[610] = "权杖级巡洋舰"        --31
Locale_Text[615] = "一种可以大量生产的防御型巡洋舰"


Locale_Text[620] = "权杖级工程型"        --32
Locale_Text[625] = "拥有强力修理能力的工程型巡洋舰"

Locale_Text[625] = "克雷莫尔级战列舰"        --32
Locale_Text[626] = "希格拉人和一个名为希尔芬的菲雅利民间商会合作开发的一种新型战列舰"
Locale_Text[630] = "双马尾骑士号战列舰"        --33
Locale_Text[631] = "希尔芬某部门长武喵的座舰,作为希格拉虚拟偶像的粉丝骑士团而作了特殊涂装"


Locale_Text[635] = "阿塔兰忒级-希尔芬防空型"        --34
Locale_Text[636] = "卡厄斯联盟阿塔兰忒级驱逐舰的一种衍生改型，和希尔芬联合开发，该舰更擅长防空"


Locale_Text[645] = "信徒级舰载机-空优型"        --35
Locale_Text[646] = "希格拉最新开发的拦截机，拥有坚固的装甲和不弱的性能"

Locale_Text[655] = "信徒级舰载机-轰炸型"        --36
Locale_Text[656] = "信徒级舰载机的轰炸型，双管机炮被替换成了两座导弹发射器"

Locale_Text[665] = "信徒级舰载机-侦察型"        --37
Locale_Text[666] = "信徒级舰载机的侦察型，下方悬挂一个大型监视吊舱监视周围战场环境"


Locale_Text[675] = "神甫级脉冲艇"        --38
Locale_Text[676] = "最新开发的一种装甲脉冲艇，脉冲光线可以反战机也可以对抗炮艇"

Locale_Text[685] = "神甫级导弹艇"        --39
Locale_Text[686] = "装备了两座可快速装填的重型导弹发射器，可以有效对抗主力舰"

Locale_Text[695] = "神甫级工程艇"        --40
Locale_Text[696] = "可以开采资源也可以用维修激光修复战舰"

Locale_Text[705] = "卡奥斯级护卫舰-离子炮型"        --
Locale_Text[706] = "装备有一门离子炮，可以有效击毁主力舰"

Locale_Text[715] = "卡奥斯级护卫舰-防空炮型"        --
Locale_Text[716] = "装备有防空炮，可以有防空和击落敌机"

Locale_Text[725] = "卡奥斯级护卫舰-鱼雷型"        --
Locale_Text[726] = "装备有两座鱼雷发射器，可以有效击毁主力舰和中小型舰艇"

Locale_Text[735] = "卡奥斯级护卫舰-突击型"        --
Locale_Text[736] = "装备有一门离子炮，可以有效击毁主力舰"

Locale_Text[745] = "卡奥斯级护卫舰-支援型"        --
Locale_Text[746] = "装备有多门速射炮和电浆炮弹发射器，可以突破敌人舰队的防线"

Locale_Text[755] = "卡奥斯级护卫舰-侦察型"        --
Locale_Text[756] = "装备有先进侦察设备，可以有效的侦察敌人舰队情况"

Locale_Text[765] = "卡奥斯级护卫舰-治安型"        --
Locale_Text[766] = "一种治安舰，主要用来进行区域巡逻和维护治安"

Locale_Text[775] = "卡奥斯级护卫舰-精英型"        --
Locale_Text[776] = "装备有多门速射炮，离子发射器和两座导弹发射装置，拥有强大的火力输出"

Locale_Text[785] = "斯卡法汝级驱逐舰"        --
Locale_Text[786] = "装备有多种武器，可以灵活的应对各种中小型目标，也可以对抗主力舰"

Locale_Text[795] = "斯卡法汝级驱逐舰-防空型"        --
Locale_Text[796] = "装备有大量防空武器，可以有效的压制空域"

Locale_Text[805] = "斯卡法汝级驱逐舰-狙击型"        --
Locale_Text[806] = "装备有一门远程旗舰级离子束发射器，可以有效的攻击对方旗舰"

Locale_Text[815] = "斯卡法汝级驱逐舰-支援型"        --
Locale_Text[816] = "装备一门大型修理光束发生器，可以有效的进行远距离修理"

Locale_Text[825] = "斯卡法汝级驱逐舰-突击型"        --
Locale_Text[826] = "装备有多座重炮和鱼雷发射器，可以有效突入敌人舰队阵列"

Locale_Text[835] = "斯卡法汝级驱逐舰-精英型"        --
Locale_Text[836] = "装备有多种武器，拥有不亚于巡洋舰的战斗力"

Locale_Text[840] = "猎星者战斗机"        --31
Locale_Text[841] = "希尔芬和卡厄斯联合开发的制空战斗机"

Locale_Text[850] = "召唤菲雅利帝国第七代女皇级摧星巨舰"        --31
Locale_Text[851] = "召唤菲雅利人的摧星巨舰前来支援"


Locale_Text[860] = "艾瑞希尔级破交无畏舰"
Locale_Text[861] = "新锐的高速重甲无畏舰，拥有足以匹敌堡垒舰的战斗力  建造条件：先进无畏舰科技"

---------------------------------------------------
---------------------------------------------------
---------------------------------------------------
Locale_Text[1000] = "纯净水提炼装置"            --1
Locale_Text[1001] = "可以将冰矿融化成淡水，每分钟消耗1单位的冰矿和1单位的核燃料，生产出20单位的水"
Locale_Text[1005] = "啤酒酿造厂"                --2
Locale_Text[1006] = "可以用小麦酿造啤酒，每分钟消耗5单位的小麦和5单位的淡水，生产出5单位的啤酒"
---------------------------------------------------
Locale_Text[1100] = "氢燃料提炼装置"            --3
Locale_Text[1101] = "可以高效率的将淡水电解出氢燃料，每分钟消耗10单位的水，生产出2单位的氢燃料"
Locale_Text[1105] = "核燃料提炼装置"            --4
Locale_Text[1106] = "从一些珍稀矿石中提炼出核燃料，每分钟消耗1单位的珍稀矿石，生产出20单位的核燃料"
Locale_Text[1110] = "反物质燃料提炼装置"        --5 
Locale_Text[1111] = "将大量的能源和一些珍稀元素一起压缩成反物质燃料，每分钟消耗20单位的核燃料和1单位的珍稀矿石，生产出10单位的反物质燃料"
---------------------------------------------------
Locale_Text[1200] = "面包烘焙坊"                --6
Locale_Text[1201] = "将小麦研磨成面粉后高效率的烤制成面包。每分钟消耗20单位的小麦，生产出10单位的面包"
Locale_Text[1205] = "快餐食品店"                --7
Locale_Text[1206] = "将面包和猪肉一起烹制成汉堡三明治等美食。每分钟消耗20单位的面包和10单位的猪肉，生产出20单位的三明治"
Locale_Text[1210] = "高级厨房"                  --8 
Locale_Text[1211] = "将牛肉经过精心的调理，制作成美味的牛排。每分钟消耗10单位牛肉，生产出2单位的太空牛排"

Locale_Text[1300] = "日用品加工模块"            --9 
Locale_Text[1301] = "将一些基础合金制作成简单的生活用品。每分钟消耗1位的基础合金，生产出10单位的日常生活用品"

Locale_Text[1400] = "谷物农场"                  --10
Locale_Text[1401] = "用淡水和能源高效率的培育出谷物来。每分钟消耗10单位的淡水和1单位的核燃料，生产出30单位的谷物"
Locale_Text[1405] = "生猪饲养场"                --11
Locale_Text[1406] = "用淡水和谷物饲养生猪，然后屠宰后获得大量猪肉。每分钟消耗5单位的淡水和10单位的谷物，生产出5单位的猪肉"
Locale_Text[1410] = "奶牛饲养场"                --12
Locale_Text[1411] = "用淡水和谷物饲养奶牛，然后屠宰后获得大量牛肉。每分钟消耗10单位的淡水和10单位的谷物，生产出3单位的牛肉"

Locale_Text[1500] = "基础工具制作车间"          --13
Locale_Text[1501] = "用各种金属生产出最基础的维护工具。每分钟消耗10单位的基础合金和5单位的高强度合金，生产出5单位的基础工具"
Locale_Text[1505] = "高科技加工设备间"          --14
Locale_Text[1506] = "在基础工具的基础上制作出高性能的维护工具。每分钟消耗10单位的基础工具和5单位的高强度合金，生产出3单位的高级工具"
Locale_Text[1510] = "自动机器人生产线"          --15      
Locale_Text[1511] = "用大量金属材料制作出昂贵的自动维护机器人。每分钟消耗2单位的高级工具和10单位的高强度合金，生产出2单位的自动维护机器人"

Locale_Text[1600] = "基础合金冶炼熔炉"          --16
Locale_Text[1601] = "用高温将金属矿石中的金属元素提炼出来，制造成合金。每分钟消耗1单位的金属矿石和1单位的核燃料，生产出10单位的基础合金"
Locale_Text[1605] = "高强度合金冶炼设备"        --17
Locale_Text[1606] = "在基础合金上添加一些珍稀矿物增加强度，从而生产出具有更高性能的高强度合金。每分钟消耗10单位的基础合金和1单位的核燃料，还有1单位的珍稀矿石，生产出5单位的高强度合金"
Locale_Text[1610] = "高温熔炉"                  --18
Locale_Text[1611] = "用高性能的锻造熔炉和大量能量直接将基础合金升级为高强度合金。每分钟消耗10单位的基础合金和3单位的核燃料，生产出10单位的高强度合金"
Locale_Text[1615] = "特种合金冶炼设备"          --19
Locale_Text[1616] = "在高强度合金的基础上添加特殊元素，将其升级为特种合金。每分钟消耗10单位的高强度合金和5单位的珍稀矿石1单位的反物质燃料，生产出5单位的特种合金"

Locale_Text[1700] = "小口径武器配件加工流水线"  --20
Locale_Text[1701] = "在生产小口径武器所必须的各种零配件。每分钟消耗10单位的基础合金和2单位的高强度合金，生产出5单位的小口径武器配件"
Locale_Text[1705] = "中型武器配件加工车间"      --21
Locale_Text[1706] = "在生产小口径武器所必须的各种零配件。每分钟消耗20单位的基础合金和10单位的高强度合金，生产出5单位的中型武器配件"
Locale_Text[1710] = "大型武器配件加工厂"        --22
Locale_Text[1711] = "在生产小口径武器所必须的各种零配件。每分钟消耗10单位的高强度合金和2单位的特种合金，生产出5单位的大型武器配件"

Locale_Text[1800] = "超空间模块"        --23
Locale_Text[1801] = "消耗反物质能量在航母周围生成一个大范围的跳跃立场，引导友军舰队进行跳跃。每分钟消耗1单位的反物质能量"

Locale_Text[1850] = "高效能废水处理设备"        --24
Locale_Text[1851] = "一个高性能的废水处理设施，可以更高效的循环用水，从而节约出更多淡水给其他设备使用。每分钟产出10单位的淡水"
Locale_Text[1860] = "生活垃圾处理设施"        --25
Locale_Text[1861] = "一种高效能的生活垃圾处理设备，可以将其分解成土壤和肥料，种植农作物。每分钟消耗10单位生活垃圾，产出3单位的谷物"

Locale_Text[1865] = "基础补给合成设备"        --26
Locale_Text[1866] = "使用基础的食材合成基础补给。每分钟消耗10单位的三明治和10单位的淡水，产出5单位的基础补给"
Locale_Text[1870] = "弹药加工设备"        --27
Locale_Text[1871] = "可以加工各种口径的弹药和能量武器专用的弹药包。每分钟消耗10单位的基础合金和5单位的核燃料，产出5单位的弹药"
Locale_Text[1875] = "修理材料生产设备"        --28
Locale_Text[1876] = "使用各种金属原材料来生产修补材料。每分钟消耗10单位的基础合金和2单位的高强度合金，产出5单位的修理材料"

Locale_Text[1880] = "高级补给品生产车间"        --29
Locale_Text[1881] = "使用一些高级食材来制作基础补给。每分钟消耗10单位的啤酒和10单位的太空牛排，产出50单位的基础补给"
Locale_Text[1885] = "弹药加工流水线"        --30
Locale_Text[1886] = "高效率生产弹药的流水线。每分钟消耗20单位的高强度合金和10单位的核燃料，产出50单位的弹药"
Locale_Text[1890] = "修理材料生产工厂"        --31
Locale_Text[1891] = "高效率的生产修补材料的自动工厂。每分钟消耗10单位的高强度合金和1单位的自动维修机器人，产出50单位的修理材料"


