Locale_Text = {}



Locale_Text[100] = "主力舰召唤信标"
Locale_Text[101] = "召唤在附近星区中巡航的大中型战舰舰跳跃到前线支援战斗"
Locale_Text[110] = "血刃级战列舰"
Locale_Text[111] = "一种装甲坚固拥有快速激光武器的先进战舰,建造条件:超空间模块与战列舰科技"
Locale_Text[120] = "导弹无畏舰"
Locale_Text[121] = "一种装备了堡垒级飞弹的巨型无畏舰,建造条件:科技模块与导弹无畏舰科技"
Locale_Text[130] = "马卡恩之怒"
Locale_Text[131] = "移动的战争要塞，可怕的超巨型战舰"
Locale_Text[140] = "血刃级战列舰紧急召唤"
Locale_Text[141] = "消耗大量资源紧急召唤一艘血刃级战列舰"
Locale_Text[150] = "激光突击舰编队"
Locale_Text[151] = "装备了众多激光武器的战舰,可以用来反护卫舰"
Locale_Text[155] = "佩刀级突击舰编队"
Locale_Text[156] = "装备了高性能通用反舰导弹的小型战舰，可以依靠数量优势围攻敌人"


Locale_Text[200] = "舰载机整备机库"
Locale_Text[201] = "可以自动释放舰载机和轰炸机进行战斗"
Locale_Text[210] = "炮艇护卫舰船坞"
Locale_Text[211] = "可以自动投放炮艇和护卫舰进行战斗"
Locale_Text[220] = "主力舰级护盾发生器"
Locale_Text[221] = "可以产生一个容量为150WHP的大型防护盾   注意：无法和其他防御系子系统兼容"
Locale_Text[225] = "战列巡洋舰火控塔"
Locale_Text[226] = "可以提升1倍的火力，但是只对本体有效 注意：无法和其他攻击系子系统兼容"
Locale_Text[227] = "战列巡洋舰重力井"
Locale_Text[228] = "产生一个重力场阻止敌人跳跃靠近 注意：无法和其他防御系子系统兼容"
Locale_Text[229] = "战列巡洋舰跳跃模块"
Locale_Text[230] = "让战列巡洋舰可以进行跳跃  注意：无法和其他防御系子系统兼容"


Locale_Text[300] = "脉冲突袭舰"
Locale_Text[301] = "装备了众多脉冲武器的战舰,可以用来反艇,并且也有一定的反舰功能"

Locale_Text[310] = "激光束护卫舰编队"
Locale_Text[311] = "新型的激光束护卫舰，克制护卫舰和主力舰"
Locale_Text[320] = "防空导弹驱逐舰"
Locale_Text[321] = "装备了最新型防空导弹的精锐防空驱逐舰"
Locale_Text[330] = "独角兽级重装巡洋舰"
Locale_Text[331] = "装备了高能激光武器和反舰导弹的大型战舰"
Locale_Text[340] = "先锋级轻巡洋舰"
Locale_Text[341] = "一种结构简单,适合大量生产的轻型巡洋舰。"
Locale_Text[350] = "防空导弹塔"
Locale_Text[351] = "防空飞弹发射塔,适于用来进行反艇攻击"
Locale_Text[355] = "重型防御平台"
Locale_Text[356] = "一种拥有厚重装甲的防御平台，可以有效的阻挡大部分进攻（注意，该兵种无法移动，只能跳跃部署）"
Locale_Text[360] = "猎鲨级装甲舰"
Locale_Text[361] = "升级版的赛博拉斯装甲舰，拥有坚固的装甲和低廉的成本"
Locale_Text[370] = "图腾级装甲航母"
Locale_Text[371] = "货舰改装的重型航母，拥有足够的装甲和强大的生存力"


Locale_Text[380] = "装甲脉冲艇"
Locale_Text[381] = "维格尔人特别设计的一种重型脉冲艇，装有两门高频脉冲炮，专门用来在小型单位混战中发挥威力"

Locale_Text[390] = "血刃2型战列舰"
Locale_Text[391] = "新一代的血刃级战列舰，是旧有血刃级战列舰的全面升级"


Locale_Text[400] = "中级科技模块"
Locale_Text[401] = "解锁一些高级主力舰的建造"

Locale_Text[410] = "高级科技模块"
Locale_Text[411] = "解锁一些大型旗舰的建造"

Locale_Text[410] = "高级科技模块"
Locale_Text[411] = "解锁一些大型旗舰的建造"

Locale_Text[500] = "马卡恩之怒2型"
Locale_Text[501] = "强大的攻击型堡垒，可以摧毁一切敌人"


Locale_Text[510] = "拉格纳的混小子"
Locale_Text[511] = "召唤臭名昭彰的混小子前来助战"


Locale_Text[520] = "红莲级导弹攻城舰"
Locale_Text[521] = "装备了大型红莲超重型导弹的攻城巡洋舰，专门用来打击旗舰级目标"


Locale_Text[530] = "双头鲨级重型袭击舰"
Locale_Text[531] = "廉价量产的一种大型主力舰，拥有和战列舰级别单位抗衡的实力"



Locale_Text[540] = "马卡恩之怒3型"
Locale_Text[541] = "装备了强大激光束主炮和大量导弹阵列的超级战舰，拥有毁天灭地的攻击力"


Locale_Text[550] = "血刃级战列舰歼灭型"
Locale_Text[551] = "装备了先进型防空系统超级防空战列舰，可以有效压制对方的超级战斗机"


Locale_Text[560] = "血刃级战列舰歼灭型"
Locale_Text[561] = "装备了先进型防空系统超级防空战列舰，可以有效压制对方的超级战斗机"


Locale_Text[570] = "泰坦维修艇"
Locale_Text[571] = "从泰瓦轮共和国处收购来的修理艇，可以快速修理战舰"


Locale_Text[580] = "工程护卫舰"
Locale_Text[581] = "装备了远程修理系统的工程护卫舰，可以快速修理战舰"

--tur_repairfrigate
Locale_Text[590] = "工程型重巡洋舰"
Locale_Text[591] = "装备了远程修理系统的重巡洋舰，可以远程维修受损的战舰"

Locale_Text[595] = "莫尔迪基安大君级摧星巨舰"
Locale_Text[596] = "装备了超级激光阵列主炮的超级巨舰"


Locale_Text[600] = "破刃级重型拦截机"
Locale_Text[601] = "装备速射机炮，可以有效消灭敌人空中单位 前置科技：初级军备科技"
Locale_Text[605] = "破刃级重型攻击机"
Locale_Text[606] = "装备速射机炮，可以有效消灭敌人巡洋舰单位 前置科技：初级军备科技"

Locale_Text[610] = "尸鬼级重型突击舰"
Locale_Text[611] = "先进的快速突击舰，可以适应各种情况 前置科技：工程护卫舰"



Locale_Text[615] = "业火级导弹突击舰"
Locale_Text[616] = "发射红莲导弹进行战斗的支援型突击舰，可以对大型旗舰造成有效伤害"

Locale_Text[620] = "闪光之刃级战列巡洋舰"
Locale_Text[621] = "拥有超级激光束主炮的战列巡洋舰，可以有效的进行后排的支援 前置科技：先进旗舰科技"

Locale_Text[625] = "旧日支配者"
Locale_Text[626] = "刚达尼姆级超级战斗机-拥有强大的战斗性能压制所有单位 前置科技：破刃舰载机科技"

Locale_Text[630] = "小型莫尔迪基安贸易船"
Locale_Text[631] = "一种小型贸易船，可以每10秒产生40RU的资源 前置科技：大君挖煤船科技"


Locale_Text[640] = "约瑟夫门格勒级巨型工程船坞"
Locale_Text[641] = "巨型船坞工程舰，拥有超高效的修理能力，可以释放小型工程舰维修整个舰队"


Locale_Text[650] = "船头装甲护盾"
Locale_Text[651] = "让血刃2拥有更可靠的防御力，但是代价是牺牲部分正面火力"

Locale_Text[660] = "入侵者战斗机甲"
Locale_Text[661] = "一种18米高的战斗机甲，拥有优秀的制空能力"

Locale_Text[670] = "入侵者战斗机甲-导弹武装"
Locale_Text[671] = "一种18米高的战斗机甲，装备一门加强型的反旗舰导弹发射器"

Locale_Text[680] = "入侵者战斗机甲-脉冲炮武装"
Locale_Text[681] = "一种18米高的战斗机甲，装备一门加强型的脉冲炮发射器"

Locale_Text[690] = "游骑兵级舰队航母"
Locale_Text[691] = "一种大型的舰队航母，拥有4个建造栏和大量独有的专属舰载机"


Locale_Text[695] = "长枪MK2整备机库"
Locale_Text[696] = "装备了该模块后可以不断起飞长枪MK2战斗机支援战斗"
Locale_Text[700] = "特种轰炸机整备机库"
Locale_Text[701] = "装备了该模块后可以不断起飞秃鹰轰炸机和魔毯轰炸机支援战斗"
Locale_Text[710] = "入侵者机甲整备机库"
Locale_Text[711] = "装备了该模块后可以不断起入侵者机甲支援战斗"



Locale_Text[730] = "军团骑士级航空战列舰"
Locale_Text[731] = "军团骑士级和血刃MK2合体后的一种超级航空战列舰，拥有战列舰的火力和双倍的载机容量，同时还可以建造游骑兵级航母的独有舰载机，前置条件：入侵者战斗机甲"

Locale_Text[740] = "秃鹰轰炸机"
Locale_Text[741] = "一种可以发射1400毫米炮弹的轰炸机，可以有效攻击主力舰级战舰"

Locale_Text[750] = "魔毯轰炸机"
Locale_Text[751] = "一种低成本轰炸机，可以发射重型导弹攻击敌人护卫舰"


Locale_Text[770] = "长枪战斗机MK2"
Locale_Text[771] = "一种低成本战斗机，拥有一定的反艇能力"

Locale_Text[780] = "长枪战斗机MK2镭射型"
Locale_Text[781] = "一种低成本战斗机，拥有一定的反舰能力"

Locale_Text[790] = "入侵者战斗机甲-骑兵型"
Locale_Text[791] = "以魔毯轰炸机作为移动手段的入侵者机甲，拥有更强的机动性，同时可以发射红宝石飞弹攻击目标。"

Locale_Text[800] = "吞星者级重型精炼船"
Locale_Text[801] = "超大型的资源精炼船，可以在最短时间内搜刮光一片小行星带 前置科技：大君商船科技"

Locale_Text[805] = "马卡恩之怒堡垒舰-铁浮屠号"
Locale_Text[806] = "马卡恩之怒堡垒舰改造成的航空堡垒，前置条件：军团骑士级航空战列舰"

Locale_Text[810] = "莫尔迪基安轻型采矿艇"
Locale_Text[811] = "莫尔迪基安专门开发的一种轻型采矿艇 前置科技：基础军备科技"

Locale_Text[850] = "巡洋舰船坞"
Locale_Text[851] = "可以自动投放巡洋舰进行战斗"

Locale_Text[860] = "护卫舰和炮艇生产设施"
Locale_Text[861] = "可以进行护卫舰和炮艇生产"

Locale_Text[870] = "巡洋舰生产设施"
Locale_Text[871] = "可以进行巡洋舰和战列巡洋舰生产"

Locale_Text[880] = "独角兽级巡洋舰防空型"
Locale_Text[881] = "装备了高能激光武器和反舰导弹的大型战舰"

Locale_Text[890] = "混沌之刃导弹无畏舰"
Locale_Text[891] = "拥有大量导弹发射平台的重型导弹无畏舰"

Locale_Text[900] = "图腾级改装战列舰"
Locale_Text[901] = "货舰改装成的战列舰,虽然战斗力较差，但是成本相对低廉适合在早期阶段快速发动进攻"

Locale_Text[910] = "图腾级改装航母"
Locale_Text[911] = "货舰改装成的重型航母,相对传统航母来说结构更加坚固，同时能够释放更多的舰载机"


Locale_Text[920] = "破刃之剑"
Locale_Text[921] = "一种先进的超重型战斗机，拥有剑刃型机体可以轻松突破敌方空域"

Locale_Text[930] = "破戟之刃"
Locale_Text[931] = "破刃之剑的简化版，拥有更好的机动性和更优秀的制造成本"

Locale_Text[940] = "圣碑级激光无畏舰"
Locale_Text[941] = "大型激光炮无畏舰，发射高能激光束来摧毁自己的目标"

