Locale_Text = {}

--地图01帝国之门
Locale_Text[000] = "菲雅利之门(第E36C7号巴科拉之门)"
Locale_Text[005] = "菲雅利帝国本土通向银河系的唯一通道"
Locale_Text[010] = "特产：工业产品"
Locale_Text[015] = "大量来自菲雅利帝国本土的商品从这里运送到银河系中"
--地图02帝国殖民区
Locale_Text[200] = "帝国殖民区"
Locale_Text[205] = "菲雅利帝国在银河系的主要聚集区"
Locale_Text[210] = "特产：无"
Locale_Text[215] = "大量的帝国居民居住在太空城市中，太空农场向其供应粮食和各种生活物资"
--地图03帝国采矿点
Locale_Text[300] = "帝国采矿点"
Locale_Text[305] = "帝国殖民区的主要矿石来源"
Locale_Text[310] = "特产：矿石"
Locale_Text[315] = "一些维格尔舰队定期在此出没，骚扰附近的民用采矿船。"
--地图04坦尼斯
Locale_Text[400] = "坦尼斯"
Locale_Text[405] = "希格拉人的旗舰生产基地"
Locale_Text[410] = "特产：军备"
Locale_Text[415] = "这里的巨型船坞在菲雅利人的支援下正日夜不停的为希格拉人生产着巨型旗舰"
--地图05塞勒姆
Locale_Text[500] = "塞勒姆"
Locale_Text[505] = "希格拉人的主力舰生产基地"
Locale_Text[510] = "特产：无"
Locale_Text[515] = "尽管是希格拉人的舰队集结地，但是这里定期受到维格尔人的骚扰性进攻。"
--地图06希格拉首星
Locale_Text[600] = "希格拉首星"
Locale_Text[605] = "希格拉人的母星"
Locale_Text[610] = "特产：农业产品"
Locale_Text[615] = "这里饱受战火的摧残，维格尔人定期对这里发动大规模进攻"
--地图07 天使之月
Locale_Text[700] = "天使之月"
Locale_Text[705] = "希格拉人拱卫首星的前哨基地"
Locale_Text[710] = "特产：无"
Locale_Text[715] = "冲突激烈的前线战场，平均每天都有数十次交火在这里发生"
--地图08 第142号前哨基地
Locale_Text[800] = "第142号前哨基地"
Locale_Text[805] = "希格拉人部署在哥和拿深处的一处前哨基地"
Locale_Text[810] = "特产：矿石"
Locale_Text[815] = "维格尔人定期对这里发动围剿，残酷的战斗不时的爆发"
--地图09 V前哨
Locale_Text[900] = "亚加斯前哨站"
Locale_Text[905] = "维格尔入侵舰队的集结地"
Locale_Text[910] = "特产：无"
Locale_Text[915] = "大量的维格尔主力舰队在这里游荡，菲雅利舰队对这里的数次反攻都遭到失败"
--地图10 V小行星
Locale_Text[1000] = "索德拉根暗礁宙域"
Locale_Text[1005] = "维格尔人发动战争所需资源的采集地"
Locale_Text[1010] = "特产：矿石"
Locale_Text[1015] = "数支维格尔采集舰队在这里收集战争所需的资源，一些联军舰队定期的会在这里发动骚扰作战"
--地图11 V船坞群
Locale_Text[1100] = "阿莱诺亚空间船坞群周边"
Locale_Text[1105] = "不断生产战舰的大型船坞群"
Locale_Text[1110] = "特产：军备"
Locale_Text[1115] = "维格尔人数十座船坞群中的一座，大量船坞日夜不停的开工建造新船"
--地图12 V殖民
Locale_Text[1200] = "殖民行星玛加萨"
Locale_Text[1205] = "被维格尔人占领的一颗殖民星"
Locale_Text[1210] = "特产：奢侈品，奴隶"
Locale_Text[1215] = "维格尔人的地面部队一直在这颗行星上掠夺资源，进行压迫式的统治"

Locale_Text[1300] = "巴塔利安战舰坟场"
Locale_Text[1305] = "一支独立出来的维格尔叛军控制的地方"
Locale_Text[1310] = "特产：无"
Locale_Text[1315] = "一名名为维肯.末世的维格尔战争领主控制着这里，他对希格拉人和菲雅利人采取中立的态度"
--地图14 魔族01
Locale_Text[1400] = "尼福尔海姆"
Locale_Text[1405] = "埃赫洛斯嘉德帝国在M51银河系中的前哨基地"
Locale_Text[1410] = "特产：高科技产品，纳米产品"
Locale_Text[1415] = "埃赫洛斯嘉德人对银河系中的种族奉行中立的态度，但是此地经常遭到一些亚基虫族的袭击"
--地图15 魔族02
Locale_Text[1500] = "赫尔海利姆"
Locale_Text[1505] = "一个亚基虫族频繁活动的区域"
Locale_Text[1510] = "特产：触手"
Locale_Text[1515] = "变异的虫群在这里施虐，埃赫洛斯嘉德帝国已经在建立了一座前哨战负责消灭这些异虫"
--地图16 先祖遗迹
Locale_Text[1600] = "先祖遗迹"
Locale_Text[1605] = "充满了各种先祖遗物的遗迹群"
Locale_Text[1610] = "安全级别：中"
Locale_Text[1615] = "希格拉人萨尤克中掌握的先祖技术控制着这里"
--地图17 位置星区
Locale_Text[1700] = "独立星区"
Locale_Text[1705] = "允许玩家自由开发的独立星区"
Locale_Text[1710] = "安全级别：未知"
Locale_Text[1715] = "该区域充满了未知性，任何情况都可能发生"
--地图18 帝国农场群
Locale_Text[3000] = "帝国太空农场群"
Locale_Text[3005] = "为太空殖民地提供粮食补给的农场群"
Locale_Text[3010] = "特产：农场品"
Locale_Text[3015] = "每天都有大量的太空农场品从这里生产出来，为帝国舰队和帝国居民提供补给"
--地图19 帝国前线
Locale_Text[3200] = "帝国前线舰队集结地"
Locale_Text[3205] = "菲雅利帝国舰队的战争前哨"
Locale_Text[3210] = "特产：武器配件"
Locale_Text[3215] = "每天都有大量的帝国舰队从这里出发前往银河系深处同维格尔人战斗"
--地图20 海盗基地
Locale_Text[3600] = "维格尔海盗狩猎场"
Locale_Text[3605] = "维格尔人海盗的活动频繁区域"
Locale_Text[3610] = "特产：武器配件"
Locale_Text[3615] = "这里是无人管辖的混乱之地，维格尔海盗在这里攻击所有可以攻击的目标，包括维格尔人和它们自己"
--地图21 虫族腹地
Locale_Text[3400] = "亚基纳茨虫族巢群"
Locale_Text[3405] = "亚基纳茨虫族在银河系中活动的核心基地"
Locale_Text[3410] = "安全等级：危险"
Locale_Text[3415] = "大量的虫群舰队在这里活动，这里是非常危险的区域，任何舰队都可能有来无回。"
--地图22 图拉尼海盗活动区
Locale_Text[8000] = "图拉尼海盗活动区"
Locale_Text[8005] = "图拉尼海盗频繁活动的区域"
Locale_Text[8010] = "安全等级：危险"
Locale_Text[8015] = "有大量的图拉尼海盗在该区域活动，过往商船随时可能遭遇袭击。"
--地图23 卡德什大教堂
Locale_Text[8100] = "卡德什大教堂"
Locale_Text[8105] = "卡德什人的圣地，有可能遭遇卡德什母舰的袭击"
Locale_Text[8110] = "安全等级：危险"
Locale_Text[8115] = "无论联军舰队如何清剿，该区域的卡德什母舰数量一直都没有减少。"
--地图24 卡拉克
Locale_Text[8200] = "卡拉克行星"
Locale_Text[8205] = "归乡者的神圣家园"
Locale_Text[8210] = "安全等级：安全"
Locale_Text[8215] = "重新回到故乡的库申族人的神圣家园。"
--地图25 泰瓦伦共和国
Locale_Text[8300] = "泰瓦伦共和国边境"
Locale_Text[8305] = "一个新型的泰坦人国家"
Locale_Text[8310] = "安全等级：安全"
Locale_Text[8315] = "泰坦人正在这里重新建立属于自己的势力。"
--地图26 菲雅利帝国船坞
Locale_Text[8310] = "菲雅利帝国船坞群"
Locale_Text[8315] = "帝国在银河系的前线船坞群"
--地图27 朝圣者活动区
Locale_Text[8320] = "朝圣者活动区"
Locale_Text[8325] = "帝国划拨给朝圣者舰队的活动区"
--地图28 维格尔东线军阀活动区
Locale_Text[8330] = "维格尔东线军阀活动区"
Locale_Text[8335] = "相对中立的维格尔军阀活动区"
--地图29 维格尔东线军阀控制区
Locale_Text[8340] = "维格尔东线军阀控制区"
Locale_Text[8345] = "相对中立的维格尔军阀控制区"
--地图30 EDF控制区
Locale_Text[8350] = "EDF控制区"
Locale_Text[8355] = "和菲雅利帝国拥有贸易盟约的EDF建设的控制区"
--地图31 蚁巢舰队活动区
Locale_Text[8360] = "蚁巢舰队活动区"
Locale_Text[8365] = "菲雅利帝国专门针对虫族作战的蚁巢舰队的前哨站"
--地图32 莫尔迪基安大君
Locale_Text[8370] = "莫尔迪基安大君边境"
Locale_Text[8375] = "莫尔迪基安大君的军事前哨"
--地图33 卡厄斯联盟—前线
Locale_Text[8380] = "卡厄斯联盟—前线哨站"
Locale_Text[8385] = "卡厄斯联盟位于M51银河系的前线要塞"
--地图34 卡厄斯联盟—利贝尔共和国
Locale_Text[8390] = "卡厄斯联盟—利贝尔共和国"
Locale_Text[8395] = "由起义的奴隶所组成的自由共和国，是新加盟卡厄斯联盟的一个势力"
--地图35 卡厄斯联盟—联合泊地
Locale_Text[8400] = "卡厄斯联盟—联合泊地"
Locale_Text[8405] = "为卡厄斯联盟的主力舰队提供必需的物资供应和各种后勤支持"
--地图36 追忆之庭
Locale_Text[8410] = "追忆之庭重工总部船坞"
Locale_Text[8415] = "特殊势力追忆之庭的大型造船厂"
--地图37 卡厄斯联盟混沌商人
Locale_Text[8420] = "卡厄斯联盟混沌商人"
Locale_Text[8425] = ""
--地图38 第58特混舰队集结地
Locale_Text[8430] = "第58特混舰队集结地"
Locale_Text[8435] = "联盟星门所在地，负责m101向m51银河投送安全"
--地图39 卡厄斯永生者探索之初
Locale_Text[8440] = "卡厄斯永生者探索之初"
Locale_Text[8445] = "永生者探索据点，前线营地"
--地图40 索托亚地图
Locale_Text[8450] = "阿因特斯舰队定锚点"
Locale_Text[8455] = "阿因特斯舰队在M51银河系的定锚点，从此处可以直接支援通向德沃恩的秘密星门所在的星域。"
--地图41 星门都市格利普斯
Locale_Text[8460] = "星门都市格利普斯"
Locale_Text[8465] = "零号舰队在M51银河系的后勤和补给枢纽"





--任务F01
Locale_Text[1800] = "菲雅利后勤任务"
Locale_Text[1805] = "菲雅利帝国边境补给基地"
Locale_Text[1810] = "对受损的菲雅利帝国战舰进行维修"
Locale_Text[1815] = "激烈的战斗让一些菲雅利战舰严重受损，帮忙维修好这些战舰将会得到报酬"
--任务F02
Locale_Text[1900] = "菲雅利边境巡逻任务"
Locale_Text[1905] = "菲雅利帝国外围防线"
Locale_Text[1910] = "搜寻并摧毁潜入该区域的维格尔战舰"
Locale_Text[1915] = "每天都有大量的小规模维格尔舰队试图渗透进菲雅利人的太空防线，找出并摧毁这些维格尔战舰将会得到额外赏金"
--任务F03
Locale_Text[3100] = "菲雅利殖民点护卫任务"
Locale_Text[3105] = "菲雅利帝国边境的殖民点"
Locale_Text[3110] = "保护独立的太空殖民点"
Locale_Text[3115] = "菲雅利帝国边境地带有大量的殖民点和边境太空城市，但是这样的设施非常容易遭受维格尔人的攻击"
--任务F04
Locale_Text[3300] = "菲雅利商船护送任务"
Locale_Text[3305] = "菲雅利帝国贸易航道"
Locale_Text[3310] = "保护受困的菲雅利商船"
Locale_Text[3315] = "一支向前线护送补给的菲雅利商队遭遇袭击，请前往救援。"

--任务F05
Locale_Text[3320] = "弥赛亚要塞防御战"
Locale_Text[3325] = "协助弥赛亚要塞抵挡维格尔人的进攻"


--任务A02
Locale_Text[3500] = "虫族母舰狩猎任务"
Locale_Text[3505] = "虫族巢群核心区域"
Locale_Text[3510] = "在虫族巢群核心区域狩猎虫族母舰"
Locale_Text[3515] = "埃赫洛斯嘉德人已经锁定了该区域数支虫族母舰的位置，摧毁它们来削弱虫族的有生力量。"

--任务H
Locale_Text[2000] = "据点攻击任务"
Locale_Text[2005] = "希格拉边境星区"
Locale_Text[2010] = "对维格尔人的小型边境基地进行突袭，削弱维格尔人的进攻力量"
Locale_Text[2015] = "一些维格尔人在我们的边境地区部署了大量的小型据点作为进攻基地，摧毁这些基地可以获得额外的赏金。"
Locale_Text[2100] = "天使之月核心战场"
Locale_Text[2105] = "大型舰队会战任务"
Locale_Text[2110] = "和联军舰队一起战胜维格尔人的主力舰队"
Locale_Text[2115] = "维格尔人已经集结起来对我们的防线发动正面攻击，和反击的联军舰队一起战胜敌人将会获得额外的赏金。"
Locale_Text[2200] = "菲雅利希格拉联军反攻作战任务"
--任务V1
Locale_Text[2205] = "维格尔人舰队集结地"
Locale_Text[2210] = "和菲雅利希格拉联军舰队一起对维格尔人集结中的舰队发动反突击"
Locale_Text[2215] = "联军已经组织了一支强大的舰队准备反攻，消灭本地区所有的维格尔战舰将会获得大量的赏金。"
--任务V2
Locale_Text[2220] = "维格尔轨道轰炸任务"
Locale_Text[2225] = "协助帝国的轨道轰炸舰队对维格尔殖民星进行轨道轰炸"
--任务V3
Locale_Text[2230] = "巨舰建造守卫任务"
Locale_Text[2235] = "一艘东线军阀的超级巨舰正在建造当中，协助守卫其建造现场"

--任务X1
Locale_Text[2240] = "联盟边境巡逻任务"
Locale_Text[2245] = "协助联盟舰队执行边境巡逻任务"


Locale_Text[2300] = "虫族清缴任务"
Locale_Text[2305] = "埃赫洛斯嘉德边境地区"
Locale_Text[2310] = "和埃赫洛斯嘉德帝国一起清缴该区域的异形虫族"
Locale_Text[2315] = "一些异形虫族舰队潜伏在了这个区域，剿灭这些虫族将会获得大量的赏金。"




Locale_Text[2350] = "维格尔狩猎区"
Locale_Text[2355] = "维格尔人在星门之间架设了一些重力场，用来拦截过往的商船并且进行袭击"

Locale_Text[2400] = "维格尔守备区"
Locale_Text[2405] = "维格尔人在自己的太空控制区外面建设了一系列的太空据点，用来防止联军的渗透"

Locale_Text[2450] = "先祖遗迹群"
Locale_Text[2455] = "一些先祖遗迹的碎片会形成重力场，干扰过往的舰队"

Locale_Text[2500] = "BETA虫群活动区"
Locale_Text[2505] = "一些虫巢母舰会释放强大的重力场来干扰过往的舰队"

Locale_Text[2550] = "水晶体群活动区"
Locale_Text[2555] = "一些大型水晶体会主动拦截过往的太空舰船并且进行攻击"


Locale_Text[2560] = "求救信号"
Locale_Text[2565] = "一道来自友军的超空间求救信号让我们暂时改变了航行目标"



Locale_Text[2570] = "求援信号"
Locale_Text[2575] = "一道来自菲雅利友军的超空间求救信号让我们暂时改变了航行目标"


Locale_Text[2580] = "重力异常地带"
Locale_Text[2585] = "该区域中蕴含大量高密度物质的小行星影响了舰船的通行，请用常规方式驶离该区域"


--任务Z1
Locale_Text[2590] = "镜之棺骸歼灭战"
Locale_Text[2295] = "监测到本星区高能量反应，“镜”已经选定对象完成转化。请歼灭星区内所有敌方单位"



--拦截地图
Locale_Text[5000] = "跳跃中继点"
Locale_Text[5001] = "为了降低星门的工作强度而设置的跳跃中继点"
Locale_Text[5010] = "维格尔边境星区"
Locale_Text[5011] = "维格尔舰队活动的边境地带"
Locale_Text[5020] = "泰瓦伦边境星区"
Locale_Text[5021] = "泰瓦伦共和国的边境地带"
Locale_Text[5030] = "先祖遗迹外围"
Locale_Text[5031] = "先祖遗迹外围"
Locale_Text[5040] = "虫巢活动区外围"
Locale_Text[5041] = "虫巢活动区外围"
Locale_Text[5050] = "银河系边缘星区"
Locale_Text[5051] = "银河系边缘星区"
Locale_Text[5060] = "独立星区"
Locale_Text[5061] = "独立星区"


Locale_Text[5100] = "帝国之门-帝国殖民地"   --1
Locale_Text[5105] = "帝国殖民地-帝国农场群"  --2
Locale_Text[5110] = "帝国殖民地-帝国采矿场"  --3
Locale_Text[5115] = "帝国殖民地-帝国前线"  --4
Locale_Text[5120] = "帝国采矿场-独立星区"  --5
Locale_Text[5125] = "帝国前线-天使之月"  --6
Locale_Text[5130] = "天使之月-歌和拿"  --7
Locale_Text[5135] = "歌和拿-巴塔利安战舰坟场"  --8
Locale_Text[5140] = "巴塔利安战舰坟场-埃赫洛斯嘉德基地"  --9
Locale_Text[5145] = "天使之月-希格拉首星"  --10
Locale_Text[5150] = "塞勒姆-希格拉首星"  --11
Locale_Text[5155] = "塞勒姆-坦尼斯基地"  --12
Locale_Text[5160] = "图拉尼活动区-卡德什花园"  --13
Locale_Text[5165] = "卡德什花园-卡拉克"  --14
Locale_Text[5170] = "歌和拿-先祖星区"  --15
Locale_Text[5175] = "埃赫洛斯嘉德基地-埃赫洛斯嘉德前线"  --16
Locale_Text[5180] = "埃赫洛斯嘉德前线-虫族星区"  --17
Locale_Text[5185] = "天使之月-维格尔前哨"  --18
Locale_Text[5190] = "歌和拿-维格尔占领星"  --19
Locale_Text[5200] = "维格尔海盗区域-埃赫洛斯嘉德基地"  --20
Locale_Text[5205] = "维格尔前哨-维格尔占领星"  --21
Locale_Text[5210] = "维格尔占领星-维格尔海盗区域"  --22
Locale_Text[5215] = "维格尔前哨-维格尔小行星带"  --23
Locale_Text[5220] = "维格尔占领星-维格尔船坞群"  --24
Locale_Text[5225] = "维格尔海盗区域-泰瓦伦共和国前哨"  --25
Locale_Text[5230] = "独立星区-维格尔小行星带"  --26
Locale_Text[5235] = "维格尔小行星带-维格尔船坞"  --27
Locale_Text[5240] = "维格尔船坞-泰瓦伦共和国前哨" --28
Locale_Text[5245] = "坦尼斯基地-图拉尼活动区" --29
Locale_Text[5250] = "帝国采矿场-帝国船坞群" --33
Locale_Text[5255] = "帝国之门-帝国船坞群" --34
Locale_Text[5260] = "帝国前线-朝圣者活动区" --35
Locale_Text[5265] = "天使之月-朝圣者活动区" --36
Locale_Text[5270] = "维格尔小行星带-东线军阀活动区" --37
Locale_Text[5275] = "东线军阀活动区-东线军阀控制区" --38
Locale_Text[5280] = "东线军阀控制区-维格尔船坞群" --39
Locale_Text[5285] = "帝国农场群-EDF前哨站" --40
Locale_Text[5290] = "蚁巢舰队活动区-埃赫洛斯嘉德前线" --41
Locale_Text[5295] = "东线军阀活动区-莫尔迪基安大君边境" --42
Locale_Text[5300] = "独立星区-联盟前线" --43
Locale_Text[5305] = "联盟利贝尔共和国-联盟前线" --44
Locale_Text[5310] = "联盟利贝尔共和国-维格尔东线军阀活动区" --45
Locale_Text[5315] = "联盟联合泊地-联盟前线" --46
Locale_Text[5320] = "追忆之庭—帝国船坞群" --47
Locale_Text[5325] = "追忆之庭—卡厄斯联盟混沌商人" --48
Locale_Text[5330] = "卡厄斯联盟混沌商人—第58特混舰队集结地" --49
Locale_Text[5335] = "卡厄斯联盟混沌商人-联盟前线" --50
Locale_Text[5340] = "第58特混舰队集结地—联盟泊地" --51
Locale_Text[5345] = "第58特混舰队集结地—卡厄斯永生者探索之初" --52
Locale_Text[5350] = "阿因特斯舰队集结地—蚁巢舰队" --53
Locale_Text[5355] = "阿因特斯舰队集结地—星门都市格利普斯" --54



--种族选择
Locale_Text[10001] = "菲雅利冒险者"
Locale_Text[10005] = "菲雅利雇佣兵"
Locale_Text[10010] = "卡厄斯商人"

station_ID = {}

station_ID[10000] = "贸易太空站"
station_ID[10001] = "出售来自帝国本土的各种货物"
station_ID[10005] = "燃料供应站"
station_ID[10006] = "这个燃料站负责给来往的商队提供必需的燃料，收购淡水、珍稀矿石"
station_ID[10010] = "旗舰集结地"
station_ID[10011] = "来自帝国本土的大型旗舰都停泊在此，想要购买的话需要花费重金，收购食物、牛排、合金"
station_ID[10050] = "太空城市贸易站"
station_ID[10051] = "出售一些高级的补给物资，收购淡水、食物、电器、日用品"
station_ID[10055] = "主力舰船坞"
station_ID[10056] = "这里负责为前线生产大型主力舰，收购武器配件、船体构件"
station_ID[10060] = "小麦农场"
station_ID[10061] = "为附近的太空城市供应谷物，收购淡水、生活垃圾"
station_ID[10065] = "太空牧场"
station_ID[10066] = "为附近的太空城市供应肉类，收购淡水、谷物"
station_ID[10070] = "太空食品厂"
station_ID[10071] = "为附近的太空城市供应食品，收购淡水、谷物、猪肉、耗子"
station_ID[10075] = "淡水处理厂"
station_ID[10076] = "为附近的太空城市供应淡水，收购冰矿、核燃料"
station_ID[10080] = "出售各种矿石，收购：补给品、生活用品"
station_ID[10100] = "为希格拉人制造旗舰，收购：补给品、大型船体构件"
station_ID[10110] = "生产各种武器配件，收购：补给品、大型船体构件武器构件"
station_ID[10120] = "生产大型主力舰，收购：补给品、船体构件和武器构件"
station_ID[10130] = "生产各种合金，收购：金属矿石"
station_ID[10140] = "生产船体构件，收购：各种合金"
station_ID[10150] = "生产各种补给品，收购：肉类，谷物，生活用品"
station_ID[10200] = "生产各种农场品，收购：高级消费品，生活用品"
station_ID[10250] = "收购：各种补给物资"
station_ID[10300] = "低价出售矿石，收购：各种补给物资"
station_ID[10400] = "高价收购各种补给物资"
station_ID[10500] = "廉价出售各种矿石"
station_ID[10600] = "廉价提供维格尔战舰,收购各种补给物资，战舰生产材料"
station_ID[10700] = "出售奴隶和奢侈品，收购生活物资"
station_ID[10800] = "接受来自菲雅利人和希格拉人的各种物资援助，为来往的舰队提供补给"
station_ID[10900] = "出售各种先进的科技产品，收购各种战略物资"
station_ID[11000] = "收购补给品"
station_ID[11005] = "出售一些先进战舰，高价收购战略物资和奴隶"
station_ID[11010] = "准备向维格尔人发动进攻的帝国舰队，高价收购补给物资"
station_ID[11015] = "出售一些埃赫洛斯嘉德先进战舰，高价收购补给物资"
-----------------------------------------------------------------------------------------------
station_ID[12010] = "帝国之门贸易站"
station_ID[12011] = "出售来自帝国本土的高价值物资"
station_ID[12012] = "收购纳米物质，家用电器，珍惜矿石，奢侈品，人型电脑，触手，奢侈品"
station_ID[12020] = "帝国之门燃料站"
station_ID[12021] = "出售各种燃料"
station_ID[12022] = "收购淡水、珍惜矿石"
station_ID[12030] = "帝国之门旗舰集结地"
station_ID[12031] = "出售退役或者军方特许出售的各种大型旗舰"
station_ID[12032] = "收购三明治、牛排、高级修理工具、大型武器配件、自动维修机器人、鸡腿"
station_ID[12040] = "帝国之门冶炼厂"
station_ID[12041] = "出售基础合金和特种合金"
station_ID[12042] = "收购金属矿石"
station_ID[12050] = "帝国殖民地贸易站"--
station_ID[12051] = "出售啤酒、牛排"--
station_ID[12052] = "收购日常生活用品、小麦、面包、奴隶"--
station_ID[12055] = "冒险者工会"--
station_ID[12060] = "帝国殖民地主力舰船坞"
station_ID[12061] = "出售退役或者特许出售的帝国中型战舰"
station_ID[12062] = "收购基础合金、轻型武器配件、中型武器配件、小型船体构件、中型船体构件"
station_ID[12070] = "帝国殖民地太空农场"
station_ID[12071] = "出售：太空小麦"
station_ID[12072] = "收购生活垃圾、淡水"
station_ID[12080] = "帝国殖民地太空牧场"
station_ID[12081] = "出售猪肉"
station_ID[12082] = "收购小麦、淡水"
station_ID[12090] = "帝国殖民地太空食品厂"
station_ID[12091] = "出售三明治、鸡腿"
station_ID[12092] = "收购面包、猪肉、耗子、小麦"
station_ID[12100] = "帝国殖民地淡水处理厂"--
station_ID[12101] = "出售淡水"--
station_ID[12102] = "收购冰矿"--
station_ID[12110] = "帝国采矿区贸易站"
station_ID[12111] = "出售：冰矿"
station_ID[12112] = "收购：三明治"
station_ID[12120] = "希格拉旗舰船坞贸易站"
station_ID[12121] = "出售大型船体构件"
station_ID[12122] = "收购：大型武器配件、高级合金、自动维修机器人、特种合金"
station_ID[12130] = "希格拉旗舰船坞武器制造中心"
station_ID[12140] = "希格拉主力舰船坞贸易站"
station_ID[12141] = "出售：小型武器配件、高级修理工具"
station_ID[12142] = "收购：面包、冰矿、章鱼丸子、基础修理工具、金属矿石、帝国牛排、珍稀矿石、中型船体构件、鸡腿"
station_ID[12150] = "希格拉主力舰船坞船体构件工厂"--
station_ID[12160] = "希格拉主力舰船坞前线后勤供应站"
station_ID[12170] = "希格拉首星贸易站"
station_ID[12171] = "出售：淡水、牛肉、移民船票"
station_ID[12172] = "收购：日常生活用品、面包、帝国移民船票、牛排、触手、纳米物质、电器、奴隶、先祖遗物、咖啡、人形电脑、女仆、鸡腿、奢侈品"
station_ID[12180] = "天使之月贸易站"
station_ID[12181] = "出售：补给品"
station_ID[12182] = "收购：面包、三明治、轻武器配件、啤酒、自动步枪"
station_ID[12190] = "哥合拿贸易站"
station_ID[12191] = "出售金属矿石"
station_ID[12192] = "收购：三明治、太空猪肉、高级修理工具"
station_ID[12200] = "未知贸易站"--
station_ID[12201] = "出售马卡恩之怒巨舰"--
station_ID[12202] = "收购：三明治、太空贸易站、轻型武器配件、章鱼丸子、啤酒、自动步枪、鸡腿"--
station_ID[12210] = "未知贸易站"
station_ID[12211] = "出售：珍惜矿石"
station_ID[12212] = "不收购任何东西"
station_ID[12220] = "未知贸易站"
station_ID[12221] = "出售：维格尔制式战舰、大型武器配件"
station_ID[12222] = "收购：小麦、小型船体构件、金属矿石、中型武器配件、基础合金、高级修理工具、珍惜矿石、大型武器配件、高级合金、中型船体构件、自动维修机器人、特种合金、人形电脑"
station_ID[12230] = "未知贸易站"
station_ID[12231] = "出售奴隶、奢侈品"
station_ID[12232] = "收购日用品、小麦、面包、淡水、高级牛肉、帝国移民、触手、纳米物质、家用电器、帝国咖啡、帝国女仆"
station_ID[12240] = "巴塔利安战舰坟场贸易站"
station_ID[12241] = "出售：维格尔制式战舰、中型船体构件、基础合金"
station_ID[12242] = "收购：太空小麦、面包、三明治、基础修理工具、啤酒、大型武器配件、高级合金、大型船体构件、鸡腿"
station_ID[12250] = "尼福尔海姆贸易站"--
station_ID[12251] = "出售家用电器、高级合金、自动维修机器人、纳米物质、章鱼丸子"--
station_ID[12252] = "收购日常生活用品、小麦、面包、三明治、淡水、冰矿、猪肉、牛肉、帝国移民船票、金属矿石、帝国牛排、\n希格拉移民、珍惜矿石、奴隶、先祖遗物、咖啡、特种合金、帝国女仆、奢侈品"--
station_ID[12260] = "赫尔海利姆贸易站"
station_ID[12261] = "出售：触手"
station_ID[12262] = "收购：轻型武器配件、章鱼丸子、啤酒、自动步枪、中型武器配件、鸡腿"
station_ID[12270] = "未知贸易站"
station_ID[12271] = "出售：先祖战舰、先祖遗物"
station_ID[12272] = "出售一些特殊战舰"
station_ID[12282] = "收购三明治、日常用品，纳米物质，女仆，人形电脑"
station_ID[12290] = "未知贸易站"
station_ID[12291] = "出售：先祖战舰、先祖遗物"
station_ID[12292] = "收购：太空小麦、面包、三明治、基础修理工具、啤酒"
station_ID[12300] = "未知贸易站"--
station_ID[12310] = "未知贸易站"
station_ID[12320] = "未知贸易站"
station_ID[12330] = "未知贸易站"
station_ID[12335] = "帝国前线舰队补给基地"
station_ID[12336] = "出售：轻型武器配件、基础修理工具、较为新锐的现役战舰"
station_ID[12337] = "收购：太空猪肉、啤酒、小型船体构件、中型武器配件、帝国牛排、高级修理工具、自动维修机器人、鸡腿"
station_ID[12340] = "未知贸易站"
station_ID[12350] = "埃赫洛斯嘉德货舰"
station_ID[12351] = "出售埃赫洛斯嘉德特种战舰"
station_ID[12352] = "不收购任何东西"
station_ID[12360] = "希灵之眼"
station_ID[12361] = "出售菲雅利帝国特种战舰和来自宏世界的特殊商品"
station_ID[12362] = "不收购任何东西"
station_ID[12370] = "卡拉克贸易站"
station_ID[12371] = "出售：金属矿石、珍惜金属矿石"
station_ID[12372] = "收购：食物和各种补给物资"
station_ID[12380] = "泰瓦伦共和国前哨站"
station_ID[12381] = "出售：船体构件"
station_ID[12382] = "收购：武器配件和各种补给物资，金属矿石等"
station_ID[12390] = "秘密商店"
station_ID[12391] = "出售：一些秘密商品"
station_ID[12400] = "菲雅利帝国旗舰船坞群贸易站"
station_ID[12401] = "出售：旗舰建造蓝图"
station_ID[12402] = "收购：武器配件和各种补给物资，金属材料等"
station_ID[12410] = "朝圣者贸易站"
station_ID[12411] = "出售：低级人形造物和朝圣者特产"
station_ID[12412] = "收购：各类食物和生物"
station_ID[12420] = "东线军阀控制区"
station_ID[12421] = "出售：武器和大型引擎还有猫咪"
station_ID[12422] = "收购：武器和各种补给物资，食物等"
station_ID[12425] = "维格尔东线军阀活动区"
station_ID[12426] = "出售："
station_ID[12427] = "收购：武器和各种补给物资，食物等"
station_ID[12430] = "EDF贸易站"
station_ID[12431] = "出售：各种EDF特产"
station_ID[12432] = "收购：高科技产品，各种族特产"
station_ID[12440] = "蚁巢舰队补给贸易站"
station_ID[12441] = "出售：蚁巢特产"
station_ID[12442] = "收购：武器配件和各种补给物资，食物等"
station_ID[12450] = "农场群贸易站"
station_ID[12451] = "出售：基础补给"
station_ID[12452] = "收购：无"
station_ID[12460] = "联盟前线贸易站"
station_ID[12461] = "出售：酱油，生物电脑"
station_ID[12462] = "收购：武器配件和各种补给物资"
station_ID[12470] = "未知贸易站"--
station_ID[12471] = "出售特殊战舰"--
station_ID[12472] = ""--
station_ID[12480] = "联盟中继点贸易站"
station_ID[12481] = "出售：补给品"

-----------------------------------------34-------------
station_ID[12480] = "卡厄斯联盟—利贝尔共和国贸易站"--
station_ID[12481] = "出售：补给用品"--
station_ID[12482] = "收购：食品和生活物资"--
-----------------------------------------35-------------
station_ID[12490] = "卡厄斯联盟—联合泊地贸易站"--
station_ID[12491] = "出售：高科技零件"--
station_ID[12492] = "收购：武器配件"--
-----------------------------------------36-------------
station_ID[12500] = "追忆之庭重工总部船坞贸易站"--
station_ID[12501] = "出售：高科技零件"--
station_ID[12502] = "收购：先进电子产品"--
------------------------------------------37------------
station_ID[12510] = "卡厄斯联盟混沌商人贸易站"--
station_ID[12511] = "出售：联盟特产"--
station_ID[12512] = "收购：各种高级商品"--
-----------------------------------------38-------------
station_ID[12520] = "第58特混舰队集结地贸易站"--
station_ID[12521] = "收购：武器配件"--
station_ID[12522] = ""
-----------------------------------------39-------------
station_ID[12530] = "卡厄斯永生者探索之初贸易站"--
station_ID[12531] = "收购：奢侈品"--
station_ID[12532] = ""
----------------------------------------40--------------
station_ID[12540] = "阿因特斯舰队集结地贸易站"--
station_ID[12541] = "收购：武器配件和各种补给物资"--
station_ID[12542] = ""
------------------------------------------41------------
station_ID[12550] = "星门都市格利普斯贸易站"--
station_ID[12551] = "收购：食品和生活物资"--
station_ID[12552] = ""--

station_ID[12560] = "莫尔迪基安大君边境贸易站"
station_ID[12561] = "收购：食物，人口"
station_ID[12562] = "出售：大君语录 泡妞秘籍"


good_ID = {}
good_ID[50000] = "淡水"--1
good_ID[50001] = "简介：\n淡水是银河系中使用最广泛的物质。是最重要的补给物资，几乎所有的舰船和空间站都需要。"
good_ID[50005] = "啤酒"--2
good_ID[50006] = "简介：\n啤酒是一种常见的酒精饮料，很受那些太空飞行员的欢迎。啤酒主要由谷类酿造而成，一些太空城市和特殊的酿造船都可以酿造啤酒。"
good_ID[50010] = "哈克奥罗咖啡"--3
good_ID[50011] = "简介：\n咖啡是一种古老的饮料，很受上流社会人士的欢迎。希格拉首星和埃赫洛斯嘉德帝国前哨战等地都会高价收购这种商品"
good_ID[50100] = "氢燃料"--4
good_ID[50101] = "大部分战斗机和炮艇级单位都需要提供氢燃料，收购氢燃料的地方不多，大部分可以自行用淡水电解。"
good_ID[50105] = "核燃料"--5
good_ID[50106] = "大部分护卫舰和主力舰都需要提供核燃料，核燃料是重要的补给物资。一些中型太空站也需要核燃料作为能源"
good_ID[50110] = "反物质能量源"--6
good_ID[50111] = "反物质能量是重要燃料之一，主要用在旗舰和大型主力舰上。不过大部分大型空间站和大型工厂中也需要反物质能量源作为能源"
good_ID[50200] = "面包"--7
good_ID[50201] = "简介：\n面包是银河系中大部分种族的主食，可以提供足够的热量和养分。面包是一些小型护卫舰和商船的主要供给物。不少后勤设施和人口聚集区都会收购面包。"
good_ID[50205] = "三明治"--8
good_ID[50206] = "简介：\n三明治可以有效的补充体力和营养，是大中型舰船的主要食物补给。三明治可以在供应船中用面包和猪肉自己制作"
good_ID[50210] = "太空牛排"--9
good_ID[50211] = "简介：\n太空牛排是一种高品质的美食，很受太空舰长和上层贵族的欢迎。一些高级战舰和大型旗舰需要供应这种食物"
good_ID[50300] = "日常生活用品"--10
good_ID[50301] = "简介：\n日常生活用品包括了衣被鞋袜和毛巾牙刷之类的廉价物。日常生活用品是大部分商船的必须品，一些人口密集的太空城市和行星也需要收购它。"
good_ID[50305] = "家用电器"--11
good_ID[50306] = "简介：\n尽管和战争关系不大，但是它们确可以大大的提高船员和普通民众的生活质量。菲雅利帝国本土和希格拉首星会高价收购这种商品。"
good_ID[50310] = "奢侈品"--12
good_ID[50311] = "简介：\n尽管战争让银河系中的大部分民众流离失所，但是维格尔贵族却依然生产并享用这些最奢华的物资。菲雅利帝国本土和希格拉首星会高价收购这种商品。"
good_ID[50400] = "谷物"--13
good_ID[50401] = "简介：\n从远古时期起谷物就是人类重要的粮食来源。太空食品厂和一些补给站会收购这种食物，不过小麦的另外一个重要用途是在供应船中自行制作面包，或者用来喂猪和喂牛。"
good_ID[50405] = "猪肉"--14
good_ID[50406] = "简介：\n猪肉是大部分肉食的主要供应来源，可以用来制作三明治。太空食品厂和后勤供应站会直接收购猪肉，但是猪肉也可以用来在供应船中和面包一起制作三明治。"
good_ID[50410] = "牛肉"--15
good_ID[50411] = "简介：\n牛肉是大部分高级料理的主要食材，味道鲜美深受上层人士的欢迎。一些大型太空城市中会收购牛肉。牛肉也可以在高级工业船的厨房中制作成牛排。"
good_ID[50500] = "基础维护工具"--16
good_ID[50501] = "简介：\n基础维护工具用给飞船和各种机械设备进行日常的维护。基础维护工具主要给供应船日常维护使用，但是一些偏僻星区的补给基地也会高价收购这些东西"
good_ID[50505] = "高级工具"--17
good_ID[50506] = "简介：\n高级工具由一些高精度的电子检修设备和便携式的工程电脑所组成。高级工具是高级工业船必须的维护工具，但是一些大型造船基地和工业基地也需要用到。"
good_ID[50510] = "自动维修机器人"--18
good_ID[50511] = "简介：\n自动维修机器人是最先进的维护单位。高级的工业舰中需要用到它进行维护，一些生产大型旗舰的工业基地也会高价收购这种产品。"
good_ID[50600] = "冰矿石"--19
good_ID[50601] = "简介：\n小行星中开采出来的冰矿石中蕴含了大量的水资源。一些补给基地和淡水厂会收购这种矿石，但是冰矿也可以在工业舰中自行生产出淡水。"
good_ID[50605] = "金属矿石"--20
good_ID[50606] = "简介：\n金属矿石是各类合金的主要材料来源，各种基本的金属元素都可以从中提炼的到。太空冶炼厂和一些后勤工厂都会收购这种矿石，工业舰中也有设备可以自行冶炼。"
good_ID[50610] = "珍稀矿石"--21
good_ID[50611] = "简介：\n珍稀矿石中蕴含着各种各样的微量元素和贵金属，它也是生产核燃料甚至是反物质能量源的关键材料。一些燃料工厂和后勤基地会高价收购这种矿石。"
good_ID[50700] = "基础合金"--22
good_ID[50701] = "简介：\n基础合金是制造大部分船体和武器设备的主要材料，还可以和珍稀矿石一起被制作成高级合金。一些配件工厂和造船厂会大量收购。"
good_ID[50705] = "高强度合金"--23
good_ID[50706] = "简介：\n高强度合金主要用来制造飞船的龙骨和各种装甲板块以及承重结构等关键部件。一些配件工厂和造船厂会大量收购。"
good_ID[50710] = "特种合金"--24
good_ID[50711] = "简介：\n特种合金一般用来制造能源炉和能量武器的发射管道。但是一些特种装甲上也会添加这种材料。一些配件工厂和造船厂会大量收购。"
good_ID[50800] = "小口径武器配件"--25
good_ID[50801] = "简介：\n小型武器配件主要给一些小口径武器进行维护和保养。大部分护卫舰和战斗机都需要用到，一些造船厂也需要这种零配件。"
good_ID[50805] = "中型武器配件"--26
good_ID[50806] = "简介：\n中型武器配件主要用来给一些中口径和大口径的火炮进行保养。大部分中型战舰都需要用到，一些造船厂也需要这种零配件。"
good_ID[50810] = "大型武器配件"--27
good_ID[50811] = "简介：\n大型武器配件是一些巨型火炮的身管或者大直径轴承等笨重的结构零件的统称，宇宙中各大种族战舰的主力武器都有用到。一些大型造船厂也会收购"
good_ID[50900] = "基础引擎配件"--XX
good_ID[50901] = "和武器一样，飞船的引擎也由大量的零件材料所组成，比如管道，接头，阀门，电路等。这些部件在引擎日常的不断运转之下很容易损坏，需要及时的更换。引擎基础配件大多由基础合金制造，但是也会用到少量的高强度合金。"
good_ID[50905] = "高级引擎配件"--XX
good_ID[50906] = "高级引擎配件主要用在一些大中型舰船的引擎上，由一些较高强度的材料制成。高级引擎配件的制作工艺较为复杂，而且用到的材料比基础引擎配件要来的多。"
good_ID[50910] = "超空间引擎配件"--XX
good_ID[50911] = "超空间引擎一般由大量的能源管道和复杂的电子设备所组成，所以它所用的零配件配件也要求要有极高的制造工艺。目前超空间引擎配件只有各大种族的大型科研基地中才有生产。"
good_ID[51000] = "小型船体构件"--28
good_ID[51001] = "简介：\n小型船体构建一般由一些基础合金制造的金属板和高强度合金制作的龙骨所构成，数块小型船体构件就可以组装成一艘护卫舰级星舰的船体。一些造船厂和后勤基地都会收购这种商品"
good_ID[51005] = "中型船体构件"--29
good_ID[51006] = "简介：\n中型船体构件体积更大，结构更坚固，是组装大中型船体的主要材料。一些造船厂中往往会先把中型船体构件生产出来，再它组装船体。一些造船厂和后勤基地都会收购这种商品"
good_ID[51010] = "大型船体构件"--30
good_ID[51011] = "简介：\n大型船体构件是巨型船体的组要构成部件，目前各大种族的巨型战舰在生产制作中都要用到这些材料。一些造船厂和后勤基地都会收购这种商品"
good_ID[51100] = "常规引擎"--XX
good_ID[51101] = "这种引擎主要装备在一些小型护卫舰和中型战舰上，通过消耗氢燃料来产生足够的推进力。常规引擎的制作较为简单，一些条件简单的船厂就可以生产。"
good_ID[51110] = "超空间引擎"--XX
good_ID[51111] = "超空间引擎是太空战舰进行超远距离航行的必备设备，需要大量的能源才能驱动，而且造价不菲。"
good_ID[51200] = "菲雅利移民"--31
good_ID[51201] = "简介：\n尽管银河系中的生活要比帝国本土危险的多，但是也存在着机遇。所以菲雅利帝国国内还是有一些人会选择领一大笔补贴资金后进入银河系中发展。"
good_ID[51205] = "希格拉移民"--32
good_ID[51206] = "简介：\n处在战火前线的希格拉经常有一些希望能够迁徙到较安全的地方能过上更好生活的人，尽管这些人大多身无分文，但是菲雅利政府还是愿意花钱收留他们。"
good_ID[51210] = "维格尔奴隶"--33
good_ID[51211] = "简介：\n处在水生火热中的维格尔奴隶，他们多是一些运气不好的战俘或者占领星本土的民众。由于战俘的成分居多，所以无论是菲雅利帝国还是希格拉人都愿意花钱赎回这些人。"
good_ID[51300] = "耗子"--34
good_ID[51301] = "简介：\n经过了无数次生存和淘汰后，这种顽强的生物已经产生了进化，化身成为了人见人爱的萌物，现在每一个菲雅利家庭都喜欢收养这种可爱的小生物。"
good_ID[51305] = "菲雅利女仆"--35
good_ID[51306] = "简介：\n经过了希灵使徒专门训练的菲雅利女仆，她们熟练掌握一百种以上的格斗术、在镜头切换的一瞬间打扫整个城堡那么大的房间、轻松驾驶包括太空战舰在内的主人可能会乘坐的任何一种交通工具等各种技能，很受银河系各大种族权贵的欢迎。(女仆携带了占据大量空间的清洁用具和行李）"
good_ID[51310] = "人形电脑"--36
good_ID[51311] = "简介：\n埃赫洛斯嘉德帝国生化科技的产物，拥有少女一样的外貌和身体，内藏世界上最强大的核心处理器，可以外接各种设备装置来增加本体的性能。埃赫洛斯嘉德人形电脑是每个菲雅利宅男的理想伴侣。(人形电脑携带了占据大量空间的维护设备和交通工具）"
good_ID[51400] = "触手"--37
good_ID[51401] = "简介：\n埃赫洛斯嘉德帝国同亚基纳茨虫族战斗后得到的战利品，亚基纳茨虫族触手中蕴含着难以想象的生化科技，而且富含各种蛋白质和有机物，据说食用这些触手有壮阳的功效。"
good_ID[51405] = "纳米聚合物"--38
good_ID[51406] = "简介：\n一种纳米级别物质组合成的聚合物，这些物质在军工和民用领域用处都非常的大。"
good_ID[51410] = "章鱼丸子"--39
good_ID[51411] = "简介：\n埃赫洛斯嘉德帝国非常流行的一种美食小吃，口感非常独特，目前没有任何证据证明这些章鱼丸子和亚基纳茨虫族触手有任何联系。菲雅利帝国本土和希格拉首星大量进口这种食物"
good_ID[51450] = "先祖遗物"--40
good_ID[51451] = "简介：\n不知名的先祖遗迹碎片，蕴含着大量的秘密"
good_ID[51500] = "生活垃圾"--41
good_ID[51501] = "简介：\n人口密集的地方免不了会产生大量的生活垃圾，并不是所有的飞船都有先进的生活垃圾处理系统的。一些太空农场会收购这些生活垃圾用来当肥料，当然也可以建造垃圾回收设备自行处理"
good_ID[51550] = "基础补给"--42
good_ID[51551] = "所有舰船都需要这种基础的补给品来维持船员的日常生活，基础补给品中包含了猪肉，淡水，谷物，日常用品等物资，它们以最合理的配比整合在一起。"
good_ID[51600] = "弹药"--43
good_ID[51601] = "战舰在开火时需要消耗弹药，标准的弹药中包含了各种口径和型号的弹药还有能量武器通用的能量包，当然根据需要不同战舰所使用的武器和弹药也有所不同。"
good_ID[51650] = "修理物资"--44
good_ID[51651] = "维修战舰所用的各种修理物资，包含了替换破损区域用的船体板材和各种可以快速修补船体的纳米材料。只要有足够的修理物资大部分船体外壳都可以在短时间内快速修复"
good_ID[51655] = "稀释型叮当汁"--45
good_ID[51656] = "将某个生命女神的洗澡水进行亿万倍稀释后的产物，据说可以瞬间治愈一切疾病（这件商品用一套高规格的安保货柜储存）"
good_ID[51660] = "神界之石"--46
good_ID[51661] = "在希灵帝国首府大街上找到的石头，其中价值有待发掘（这件商品用一套高规格的安保货柜储存）"
good_ID[51665] = "神圣之息"--47
good_ID[51666] = "虚空生物呼吸过的空气，据说可以净化一切负面能量（这件商品用一套高规格的安保货柜储存）"
good_ID[51670] = "鸡腿"--48
good_ID[51671] = "香喷喷的鸡腿，是菲雅利帝国有名的美食，经过油炸处理，富含高热量，一个鸡腿就可以让一名船员满足一餐的营养需要"
good_ID[51675] = "M43突击步枪"--49
good_ID[51676] = "简介：\n菲雅利帝国现役主力步兵武器，是一款在精度，杀伤力，可操作性之间取得近乎完美平衡的致命武器。它的开发者是泰勒·赛拉斯\n（STORM TROOPER）"
good_ID[51680] = "中型模块化居住区"--50
good_ID[51681] = "简介：\n中型主力舰所使用的模块化居住区，可以容纳500到1000名船员和官兵居住"
good_ID[51685] = "大型模块化居住区"--51
good_ID[51686] = "简介：\n旗舰级的模块化居住区，包含了必要的维生设施等组件已经配套的各种后勤设施，可以容纳10000名以上船员和官兵居住"
good_ID[51690] = "旗舰级武器配件"--52
good_ID[51691] = "简介：\n大型旗舰所使用的旗舰级武器组件，主要由高性能主炮能源装置，弹药装填机构，和防护装甲等结构组成"
good_ID[51695] = "旗舰级动力组件"--53
good_ID[51696] = "简介：\n大型旗舰所使用的旗舰级动力组件，主要由大功率的旗舰级能源反应堆，高效率循环冷却装置和动力喷口所组成"
good_ID[51700] = "宠物蚁群"--54
good_ID[51701] = "简介：\n由一只蚁后少量工蚁组成的初始蚁群，其劳作扩张的过程极有观赏性，经过训练的工蚁可以胜任打扫卫生和采矿挖掘等基础工作"
good_ID[51705] = "蚁壳素"--55
good_ID[51706] = "简介：\n超级蚂蚁外壳中提取的蚁壳素，渗入装甲板后可以极大的增加装甲强度"
good_ID[51710] = "鼠粮"--56
good_ID[51711] = "简介：\n繁育仓鼠所需的数量，又各种类型的谷物混合而成"
good_ID[51715] = "宠物猫"--57
good_ID[51716] = "简介：\n可爱的宠物猫，平时以各种新鲜食物喂食，偶尔还会捕捉舰上的老鼠"
good_ID[51720] = "鲜活海鲜"--58
good_ID[51721] = "简介：\n特殊水槽所培育的各种海鲜生物，主要由各种鱼类所组成"
good_ID[51725] = "死神辣条"--59
good_ID[51726] = "简介：\n一种可怕的食物，此产品可制成强烈催泪弹，食用后会喷火，并导致几日的强烈痛苦。坑死小伙伴的必备佳品。"
good_ID[51730] = "低等人形造物"--60
good_ID[51731] = "简介：\n朝圣者制造的用于驾驶炮灰单位的泛滥产品,为减少消耗多用萝莉外形现在是朝圣者在M51的拳头产品(可食用多种口味)"
good_ID[51735] = "黑暗圣经"--61
good_ID[51736] = "简介：\n在某星球搜集的法术书，记载各种膜法和献祭方式，因阵营冲突导致无法利用，拿出来贩卖。"
good_ID[51740] = "金坷垃"--62
good_ID[51741] = "简介：\n金坷垃好处都有啥，谁说对了，就都给他！来自上合商人兜售的产品，据传在其母星地球畅销250年。使用后会加倍提高农作物产量，帝国境内各大农场会争相抢购。"
good_ID[51745] = "游击战三大件"--63
good_ID[51746] = "简介：\nAK-47、RPG和107火箭炮是来自遥远星系的爷爷辈武器，虽然各项性能远低家园星系同类产品。但其丧心病狂，简单上手，低成本，高杀伤的优点逐渐被各战乱星球的普通士兵追捧。"
good_ID[51755] = "辣椒"--64
good_ID[51756] = "简介：\n上合商人带来的一种辅助食材，让整个家园星系获得了一种新的味觉“辣”。伴随地球各种美味佳肴进入M51，往往一两样简单食物添加后就会变的美味。传说帝国审判长对它亲爱有加，某些苦寒地区更视为珍宝。"
good_ID[51760] = "奢华家具"--65
good_ID[51761] = "简介：\n超豪华的木质家具，拥有一件精制做工的木质家具在太空时代反而是一种难得享受"
good_ID[51765] = "特装战斗服"--66
good_ID[51766] = "简介：\n特殊渠道进口的艾库丽斯制战斗服，结合了该星最新技术为使用者量身定制，能有效应对任何威胁，仅有女性型。"
good_ID[51770] = "机械妖精"--67
good_ID[51771] = "简介：\n大小为正常人类六分之一的迷你智能人形机器人ELF，内置艾库丽斯星数据处理终端，仅有女性型。"
good_ID[51775] = "御坂妹妹"--68
good_ID[51776] = "简介：\n雷霆骑士御版御版的克隆体，虽然身材比较平，但是相对温顺的性格还是很受人欢迎"
good_ID[51780] = "奶茶"--69
good_ID[51781] = "简介：\n雷霆骑士御版御版在兼职女仆的时候亲自调制的奶茶，口感独特，虽然她没有胸"
good_ID[51105] = "大型引擎"--70
good_ID[51106] = "一种装备在大中型战舰上的星舰引擎，一般会同时装备多台来提供足够的推力和转向力。这种引擎的建造成本比小型引擎要昂贵的多。"
good_ID[51750] = "白酒"--71
good_ID[51751] = "简介：\n最早出现在上合组织进贡菲雅利女皇陛下的宴席上，后来流入坊间，被一些老酒鬼奉为最能激起味蕾的佳酿。由于路途遥远运输不便，一度在市面上消失，只有在EDF所属贸易站有售。"
good_ID[51785] = "哈士奇"--72
good_ID[51786] = "简介：\n来自蓝星的古老犬种，据说是上天创造狼的草稿。它的一举一动都备受主人关注，但运送他们可要小心，你的货仓要足够结实。"
good_ID[51790] = "食用油"--73
good_ID[51791] = "简介：\n食用油是各国人民日常生活的必备品之一，卡厄斯联盟罗德尼食用油公司开发了新型的0添加食用油，降低了油脂是一种健康食用油，以此满足各国日益增长的口腹及健康需求"
good_ID[51800] = "无畏舰蓝图"--74
good_ID[51801] = "简介：\n允许玩家建造无畏舰级的大型战舰"
good_ID[51810] = "备用船员"--75
good_ID[51811] = "简介：\n额外的备用船员可以在打捞一些废弃船只的时候派上用场"
good_ID[51820] = "陆战队员"--76
good_ID[51821] = "简介：\n不管是清理大型战舰残骸还是守卫战舰都需要这些陆战队员"
good_ID[51830] = "被拯救的奴隶"--77
good_ID[51831] = "简介：\n这些奴隶刚刚从占领星上被拯救出来，急需运走"
good_ID[51840] = "舰队收藏棋子包"--78
good_ID[51841] = "简介：\n作为全宇宙最流行的桌面游戏，舰队收藏的核心是原厂仿造现役舰的全可动模型棋子。棋子包的内容完全随机。"
good_ID[51850] = "战术女装"--79
good_ID[51851] = "简介：\n一开始，战术女装只是作为回馈顾客的礼物，结果后来因为人气愈发高涨，反倒成为了卡厄斯的重要出口商品—这是唯一一种全新的不如二手的价格高的产品。（这种战术女装男女都能穿）"
good_ID[51860] = "诡异的龙须面"--80
good_ID[51861] = "简介：\n这些意义不明的龙须面似乎不应该出现在你的舰船货舱中，制作它的材料无法鉴别，但是似乎并不是普通的食材，把它带到冒险者工会去处理似乎是比较靠谱的选择"
good_ID[51870] = "金属矿石储备"--81
good_ID[51871] = "简介：\n储存在殖民地仓库中的金属矿石储备，不占用舰队空间，但是需要转换才能带走"
good_ID[51880] = "谷物储备"--82
good_ID[51881] = "简介：\n储存在殖民地仓库中的谷物储备，不占用舰队空间，但是需要转换才能带走"
good_ID[51890] = "肉制品储备"--83
good_ID[51891] = "简介：\n储存在殖民地仓库中的肉制品储备，不占用舰队空间，但是需要转换才能带走"
good_ID[51900] = "淡水储备"--84
good_ID[51901] = "简介：\n储存在殖民地仓库中的淡水储备，不占用舰队空间，但是需要转换才能带走"
good_ID[51910] = "食品储备"--85
good_ID[51911] = "简介：\n储存在殖民地仓库中的食品储备，不占用舰队空间，但是需要转换才能带走"
good_ID[51920] = "合金储备"--86
good_ID[51921] = "简介：\n储存在殖民地仓库中的合金储备，不占用舰队空间，但是需要转换才能带走"
good_ID[51930] = "能量块"--87
good_ID[51931] = "简介：\n储存在殖民地仓库中的能量块，不占用舰队空间，负责殖民地的各种工业商品运转"
good_ID[51940] = "殖民地弹药储备"--88
good_ID[51941] = "简介：\n储存在殖民地仓库中的殖民地弹药储备，不占用舰队空间，但是需要转换才能带走"
good_ID[51950] = "生活用品储备"--89
good_ID[51951] = "简介：\n储存在殖民地仓库中的生活用品储备，不占用舰队空间，但是需要转换才能带走"
good_ID[51960] = "冰矿储备"--90
good_ID[51961] = "简介：\n储存在殖民地仓库中的冰矿储备，不占用舰队空间，但是需要转换才能带走"
good_ID[51970] = "安保力量"--91
good_ID[51971] = "简介：\n殖民地中的安保人员力量，不占用舰队空间，但是弹药和物资供应才能保持工作"
good_ID[51980] = "殖民地工人"--92
good_ID[51981] = "简介：\n负责维持整个殖民地运转的工作人员，他们工作一段时间后就需要休假才能恢复工作"
good_ID[51990] = "疲惫的殖民地工人"--93
good_ID[51991] = "简介：\n工作了一段时间的殖民地工人，他们需要物资和补给还有住房才能恢复工作状态"
good_ID[52000] = "未整备的安保力量"--94
good_ID[52001] = "简介：\n长时间值班后的安保人员，需要修正和补充弹药后才能继续工作"
good_ID[52010] = "酱油"--95
good_ID[52011] = "简介：\n源于生态农业技术，生产的特级酿造酱油，保证晒足1800天，味醇色泽好。"
good_ID[52020] = "生物电脑"--96
good_ID[52021] = "简介：\n伊格西恩电子体的物理服务器，采用顶尖生物科技打造的生物计算机，可用于提供规模化的电子体服务。"
good_ID[52030] = "舰队收藏棋子包"--97
good_ID[52031] = "简介：\n作为全宇宙最流行的桌面游戏，舰队收藏的核心是原厂仿造现役舰的全可动模型棋子。棋子包的内容完全随机。。"
good_ID[52040] = "战术女装"--98
good_ID[52041] = "简介：\n一开始，战术女装只是作为回馈顾客的礼物，结果后来因为人气愈发高涨，反倒成为了卡厄斯的重要出口商品—这是唯一一种全新的不如二手的价格高的产品。"
good_ID[52050] = "龙须面"--99
good_ID[52051] = "简介：\n以寄生在卡厄斯矿场，形如龙须的生物为材料， 包裹面筋手擀成的拉面。 有嚼劲， 口感极佳。-其实只是方便面的一种"
good_ID[52060] = "旗舰级核心组件储备"--100
good_ID[52061] = "简介：\n用来建造大型旗舰的核心组件，包括旗舰级武器系统和动力系统"
good_ID[52070] = "人型电脑储备"--101
good_ID[52071] = "简介：\n这些制造好的人形电脑被封存在特殊的容器中，随时都可以启封使用"
good_ID[52080] = "大型船体储备"--102
good_ID[52081] = "简介：\n刚从流水线生产好的大型船体组件，还未进行可装运的打包"
good_ID[52090] = "电子元件储备"--103
good_ID[52091] = "简介：\n小到光学芯片大到复杂的集成电路面板，它们可以引用在各种电子产品上"
good_ID[52100] = "大型武器配件储备"--104
good_ID[52101] = "简介：\n各种口径的舰载武器配件，比如大口径舰炮身管和能量武器发射装置"
good_ID[52110] = "马卡恩之怒蓝图"--105
good_ID[52111] = "简介：\n需要10张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52120] = "第3代女皇级蓝图"--106
good_ID[52121] = "简介：\n需要10张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52130] = "第四代女皇B级蓝图"--107
good_ID[52131] = "简介：\n需要10张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52140] = "克蕾雅-达尔克号蓝图"--108
good_ID[52141] = "简介：\n需要10张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52150] = "莎拉-达尔克号蓝图"--109
good_ID[52151] = "简介：\n需要10张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52160] = "永恒2级蓝图"--110
good_ID[52161] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52170] = "女皇之锤蓝图"--111
good_ID[52171] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52180] = "第五代女皇级蓝图"--112
good_ID[52181] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52190] = "第四代女皇级蓝图"--113
good_ID[52191] = "简介：\n需要10张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52200] = "第二代马卡恩之怒蓝图"--114
good_ID[52201] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52210] = "审判庭号蓝图"--115
good_ID[52211] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52220] = "阿芙乐尔级蓝图"--116
good_ID[52221] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52230] = "第五代女皇级痛蓝图"--117
good_ID[52231] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52240] = "阿芙乐尔级改良型蓝图"--118
good_ID[52241] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52250] = "圣域号蓝图"--119
good_ID[52251] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52260] = "塔纳托斯级蓝图"--120
good_ID[52261] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52270] = "第六代女皇级B型蓝图"--121
good_ID[52271] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52280] = "帝国上将蓝图"--122
good_ID[52281] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52290] = "马卡恩之怒3蓝图"--123
good_ID[52291] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52300] = "第6代女皇级C型蓝图"--124
good_ID[52301] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52310] = "第六代女皇级A型蓝图"--125
good_ID[52311] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52320] = "朝圣者级蓝图"--126
good_ID[52321] = "简介：\n需要30张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52330] = "阿尔贝迪欧号蓝图"--127
good_ID[52331] = "简介：\n需要30张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52340] = "第六代女皇级D型蓝图"--128
good_ID[52341] = "简介：\n需要30张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52350] = "大君级摧星蓝图"--129
good_ID[52351] = "简介：\n需要40张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52360] = "第七代女皇催星蓝图"--130
good_ID[52361] = "简介：\n需要40张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52370] = "命运级催星巨舰蓝图"--131
good_ID[52371] = "简介：\n需要40张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52380] = "赛芙莉尔号蓝图"--132
good_ID[52381] = "简介：\n需要30张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52390] = "电子元件"--133
good_ID[52391] = "简介：\n生产各种先进设备锁必须的电子元件，包括了继承芯片和各种电路板等。该产品已经打包好可以出售给各个势力"
good_ID[52400] = "一份机密文件"--134
good_ID[52401] = "简介：\n没人知道这个文件内部拥有什么数据，你只需要把它送到目的地就好"
good_ID[52410] = "一批应急食品"--135
good_ID[52411] = "简介：\n一批用来救灾的食品，它可以挽救数十万平民的生命"
good_ID[52420] = "一批特殊矿石"--136
good_ID[52421] = "简介：\n一批含有特殊矿物元素的金属矿石，可以生产各种高性能合金"
good_ID[52430] = "特殊生物材料"--137
good_ID[52431] = "简介：\n一整批的特殊生物材料，用来培养特殊的生物物质进行各种特别用途"
good_ID[52440] = "一支全副武装的帝国兵团"--138
good_ID[52441] = "简介：\n数十万人的地面部队，搭配有大量的先进载具和武器装备，它们可以轻松的攻占一颗行星"
good_ID[52450] = "维格尔战列舰悬赏"--139
good_ID[52451] = "简介：\n一艘特殊的维格尔战列舰正在天使之月星区活动，摧毁它可以得到巨额奖励"
good_ID[52460] = "维格尔无畏舰悬赏"--140
good_ID[52461] = "简介：\n一艘特殊的维格尔无畏舰正在维格尔小行星带活动，摧毁它可以得到巨额奖励"
good_ID[52470] = "维格尔航空战列舰悬赏"--141
good_ID[52471] = "简介：\n一艘特殊的维格尔航空战列舰正在歌和拿星区活动，摧毁它可以得到巨额奖励"
good_ID[52480] = "维格尔战争堡垒悬赏"--142
good_ID[52481] = "简介：\n一艘特殊的维格尔战争堡垒正在维格尔船坞星区活动，摧毁它可以得到巨额奖励"
good_ID[52490] = "维格尔摧星巨舰悬赏"--143
good_ID[52491] = "简介：\n一艘特殊的维格尔摧星巨舰正在维格尔前哨星区活动，摧毁它可以得到巨额奖励"
good_ID[52500] = "精英型远行者蓝图"--144
good_ID[52501] = "简介：\n需要10张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52510] = "铁浮图级蓝图"--145
good_ID[52511] = "简介：\n需要10张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52520] = "君王级蓝图"--146
good_ID[52521] = "简介：\n需要10张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52530] = "一份商业合同"--147
good_ID[52531] = "简介：\n一份特殊的商业合同，背后是巨额商业贸易内容。"
good_ID[52540] = "一份建造合约"--148
good_ID[52541] = "简介：\n一份特殊的委托建造合约，委托者希望卡厄斯联盟帮忙建造些什么特殊的工程。"
good_ID[52550] = "裂痕2E型蓝图"--149
good_ID[52551] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52560] = "裂痕2F型蓝图"--150
good_ID[52561] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52570] = "裂痕2G型蓝图"--151
good_ID[52571] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52580] = "突袭者级蓝图"--152
good_ID[52581] = "简介：\n需要4张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52590] = "防风级蓝图"--153
good_ID[52591] = "简介：\n需要10张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52595] = "封装的轻型战斗机组件"--154
good_ID[52596] = "这种封装的战斗机只有对应航母的维护车间才能进行装配并部署。"
good_ID[52605] = "封装的重型战斗机组件"--155
good_ID[52606] = "这种封装的战斗机只有对应航母的维护车间才能进行装配并部署。"
good_ID[52615] = "封装的炮艇组件"--156
good_ID[52616] = "这种封装的战斗机只有对应航母的维护车间才能进行装配并部署。"
good_ID[52625] = "封装的先进战斗机组件"--157
good_ID[52626] = "这种封装的战斗机只有对应航母的维护车间才能进行装配并部署。"
good_ID[52635] = "封装的重型轰炸机组件"--158
good_ID[52636] = "这种封装的战斗机只有对应航母的维护车间才能进行装配并部署。"
good_ID[52645] = "封装的超级战斗机组件"--159
good_ID[52646] = "这种封装的战斗机只有对应航母的维护车间才能进行装配并部署。"
good_ID[52650] = "进攻警告"--160
good_ID[52651] = "这是一则进攻提醒，一支维格尔舰队正在入侵你的殖民地，请尽快赶回去协助防御"
good_ID[52660] = "大君语录"--161
good_ID[52661] = "人类是无法互相理解的！你们又要挑起战争吗？"
good_ID[52670] = "把妹手册"--162
good_ID[52671] = "那里有一只超阔爱的猫娘诶，让我翻翻手册康康怎么把她拐回家，emmmm芳香蝾螈？"
good_ID[52680] = "管理员"--163
good_ID[52681] = "这么臭的管理员真的有地方会收吗.jpg 这是很讨厌的管理员，现在我们要卖给谁呢，啧这个贱兮兮的表情，要不我们先打一顿再说"
good_ID[52690] = "十四公主蓝图"--164
good_ID[52691] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52700] = "裂痕121蓝图"--165
good_ID[52701] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52710] = "裂痕2FGF蓝图"--166
good_ID[52711] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52720] = "索托亚玛拉型蓝图"--167
good_ID[52721] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52730] = "一万名特殊的金发奴隶"--168
good_ID[52731] = "简介：\n这是一万名特殊的金发女奴隶，是大君特意送给薛科维茨的。"
good_ID[52740] = "虫巢母舰悬赏"--169
good_ID[52741] = "简介：\n一艘特殊的虫巢母舰正在虫巢星区活动，将它击毁可以获得特殊奖励。"
good_ID[52750] = "特殊的礼物"--170
good_ID[52751] = "简介：\n阿因特斯代仲裁庭阿萝拉给莫尔迪基安大君的重要包裹。"

good_ID[52760] = "赫利奥斯蓝图"--171
good_ID[52761] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52770] = "混沌之刃蓝图"--172
good_ID[52771] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"

good_ID[52780] = "哈迪斯级蓝图"--173
good_ID[52781] = "简介：\n需要20张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"

good_ID[52790] = "尤里西斯蓝图"--174
good_ID[52791] = "简介：\n需要40张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"

good_ID[52800] = "Avalon阿瓦隆蓝图"--175
good_ID[52801] = "简介：\n需要40张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52810] = "Excalibur胜利之剑蓝图"--176
good_ID[52811] = "简介：\n需要40张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52820] = "叹息之墙蓝图"--177
good_ID[52821] = "简介：\n需要40张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"

good_ID[52830] = "机械零件"--178
good_ID[52831] = "简介：\n各种大型工程设备和机械设备都需要的基础零件，由螺丝，连接件和各种复杂的金属构件所组成。"
good_ID[52840] = "堡垒级蓝图碎片"--179
good_ID[52841] = "简介：\n通过对堡垒级舰船蓝图进行逆向分解所得到的研究数据，有可能组合出新的堡垒级舰船蓝图。"
good_ID[52850] = "荣誉勋章"--180
good_ID[52851] = "简介：\n特殊的荣誉勋章，当你为一些大型势力提供帮助后有可能获得，可以使用到一些特殊的地方。"



good_ID[52860] = "跃迁能量"--181
good_ID[52861] = "简介：\n殖民地星门所储备的跃迁能量，只有拥有足够的跃迁能量储备殖民地星门才能展开超空间之门又或者是引导舰队跃迁返回。"
good_ID[52870] = "舰队点数"--182
good_ID[52871] = "简介：\n殖民地生产的各种舰船换算的点数，可以用来兑换战舰，又或者是在其他地图召唤支援。"

good_ID[52880] = "机械零件储备"--183
good_ID[52881] = "简介：\n殖民地生产的机械零件，这些零件用集装箱储存在殖民地的大型仓库中。"

good_ID[52890] = "纳米物质储备"--184
good_ID[52891] = "简介：\n殖民地生产的纳米物质，这些纳米物质用特殊的高级容器储存在殖民地的大型仓库中。"

good_ID[52900] = "舰载机组件储备"--185
good_ID[52901] = "简介：\n殖民地生产的舰载机组件，这些舰载机组件储存在殖民地的仓库中，随时可以组装成舰载机。"

good_ID[52910] = "乌兰巴托级指挥母舰蓝图"--186
good_ID[52911] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52920] = "先进堡垒级蓝图碎片"--187
good_ID[52921] = "简介：\n通过对先进堡垒级舰船蓝图进行逆向分解所得到的研究数据，有可能组合出新的堡垒级舰船蓝图。"
good_ID[52930] = "摧星级蓝图碎片"--188
good_ID[52931] = "简介：\n通过对先进摧星级舰船蓝图进行逆向分解所得到的研究数据，有可能组合出新的摧星级舰船蓝图。"


good_ID[52940] = "先进旗舰蓝图碎片"--189
good_ID[52941] = "简介：\n通过对先进旗舰级舰船蓝图进行逆向分解所得到的研究数据，有可能组合出新的先进旗舰级舰船蓝图。"
good_ID[52950] = "洛神号蓝图"--190
good_ID[52951] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52960] = "修伯利安蓝图"--191
good_ID[52961] = "简介：\n需要40张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"

good_ID[52970] = "光辉女神级无畏舰蓝图"--192
good_ID[52971] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52980] = "浩劫级无畏舰蓝图"--193
good_ID[52981] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[52990] = "暗夜女神级无畏舰蓝图"--194
good_ID[52991] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[53000] = "永恒级无畏舰蓝图"--195
good_ID[53001] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[53010] = "艾瑞希尔级蓝图"--196
good_ID[53011] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[53020] = "耶梦加得号蓝图"--197
good_ID[53021] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[53030] = "晨锋级蓝图"--198
good_ID[53031] = "简介：\n需要40张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[53040] = "圣碑级蓝图"--199
good_ID[53041] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[53050] = "神罚歼灭套件蓝图"--200
good_ID[53051] = "简介：\n需要30张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"


good_ID[53060] = "福龙号蓝图"--201
good_ID[53061] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"
good_ID[53070] = "威龙号蓝图"--202
good_ID[53071] = "简介：\n需要5张才能建造\n建造战舰所必须的数据蓝图，制作它的工艺极为复杂而且经过了高强度的数据加密，属于不可复制的消耗品。有的时候为了建造一艘高难度战舰还需要许多份相同的蓝图才行。"




















shipyard_ID = {}
shipyard_ID[53005] = "依靠殖民地中储备的物资建造一艘战舰"
shipyard_ID[53080] = "建造第四代女皇级战争堡垒"
shipyard_ID[53000] = "建造马卡恩之怒"
shipyard_ID[53010] = "建造第三代女皇级战争堡垒"
shipyard_ID[53020] = "建造第四代女皇级战争堡垒精英型"
shipyard_ID[53030] = "建造克蕾雅-达尔克号"
shipyard_ID[53040] = "建造莎拉-达尔克号"
shipyard_ID[53050] = "建造永恒2级战争堡垒"
shipyard_ID[53060] = "建造女皇之锤"
shipyard_ID[53070] = "建造第五代女皇级战争堡垒"
shipyard_ID[53090] = "建造第二代马卡恩之怒战争堡垒"
shipyard_ID[53100] = "建造审判庭号战争堡垒"
shipyard_ID[53110] = "建造阿芙乐尔级超级武库舰"
shipyard_ID[53120] = "建造第五代女皇级战争堡垒痛"
shipyard_ID[53130] = "建造圣域号战争堡垒"
shipyard_ID[53140] = "建造阿芙乐尔级改"
shipyard_ID[53150] = "建造塔纳托斯级超级武库舰"
shipyard_ID[53160] = "建造第六代女皇级B型"
shipyard_ID[53170] = "建造帝国上将"
shipyard_ID[53180] = "建造第三代马卡恩之怒巨舰"
shipyard_ID[53190] = "建造第六代女皇级C型"
shipyard_ID[53200] = "建造第六代女皇级A型"
shipyard_ID[53210] = "建造朝圣者级超级航母"
shipyard_ID[53220] = "建造阿尔贝迪欧号"
shipyard_ID[53230] = "建造第六代帝国女皇级天罚型"
shipyard_ID[53240] = "建造莫尔迪基安大君级摧星巨舰"
shipyard_ID[53250] = "建造第七代女皇级催星巨舰"
shipyard_ID[53260] = "建造命运级催星巨舰"
shipyard_ID[53270] = "建造斯卡法汝级驱逐舰防空型"
shipyard_ID[53280] = "建造费娜尼亚级"
shipyard_ID[53290] = "建造陌刀级驱逐舰"
shipyard_ID[53300] = "建造斯卡法汝级舰炮型"
shipyard_ID[53310] = "建造独角兽级重型巡洋舰"
shipyard_ID[53320] = "建造阔刃级袭击舰"
shipyard_ID[53330] = "建造猎鲨级袭击舰"
shipyard_ID[53340] = "建造远行者级战列舰"
shipyard_ID[53350] = "建造远行者级战列舰精英型"
shipyard_ID[53350] = "建造突袭者级轻型战术舰"




shipyard_ID[53420] = "建造防风级超级货舰"
shipyard_ID[53430] = "建造阔刃3装甲型"


shipyard_ID[53345] = "委托当地造船厂建造一艘飞船"
shipyard_ID[53350] = "委托建造阔刃级袭击舰"
shipyard_ID[53360] = "委托建造巡回者级袭击舰"
shipyard_ID[53370] = "委托建造战列巡洋舰-娜贝琉斯"
shipyard_ID[53380] = "委托建造菲米琳斯"
shipyard_ID[53390] = "委托建造导弹袭击舰"
shipyard_ID[53400] = "委托建造隼风装甲舰"
shipyard_ID[53410] = "委托建造SR6快速袭击舰"
shipyard_ID[53420] = "委托建造图拉尼运载舰"
shipyard_ID[53435] = "委托建造阔刃3装甲型"
shipyard_ID[53440] = "委托建造阔刃3"
shipyard_ID[53450] = "委托建造闪光之刃级战列巡洋舰"
shipyard_ID[53460] = "委托建造俱乐部级战列巡洋舰"
shipyard_ID[53470] = "委托建造俱乐部级豪华游轮"
shipyard_ID[53480] = "委托建造玉门级超大型码头舰"
shipyard_ID[53490] = "委托建造远行者级战列舰"


shipyard_ID[53500] = "委托建造远行者级货运舰"
shipyard_ID[53510] = "委托建造教主级支援战列舰"
shipyard_ID[53520] = "委托建造伊利亚巡空舰"
shipyard_ID[53530] = "委托建造曙光级战列舰"
shipyard_ID[53540] = "委托建造曙光C"
shipyard_ID[53550] = "委托建造血刃级战列舰"
shipyard_ID[53560] = "委托建造领主级战列舰"
shipyard_ID[53570] = "委托建造塔尔洛斯级战列舰"
shipyard_ID[53580] = "委托建造塔尔洛斯级战列舰光束"
shipyard_ID[53590] = "委托建造死亡之戟"
shipyard_ID[53600] = "委托建造库申战列舰"
shipyard_ID[53610] = "委托建造泰坦战列"
shipyard_ID[53620] = "委托建造裂痕级战列舰"
shipyard_ID[53630] = "委托建造裂痕C"
shipyard_ID[53640] = "委托建造月环"
shipyard_ID[53650] = "委托建造痛月环"
shipyard_ID[53660] = "委托建造破晓I"
shipyard_ID[53670] = "委托建造破晓3"
shipyard_ID[53680] = "委托建造裂痕2A"
shipyard_ID[53690] = "委托建造裂痕2B"
shipyard_ID[53700] = "委托建造坚毅级战列舰"
shipyard_ID[53710] = "委托建造克雷莫尔之刃级战列舰"
shipyard_ID[53720] = "委托建造雅典娜级重型航母"
shipyard_ID[53730] = "委托建造奥丁"
shipyard_ID[53740] = "委托建造重锤轮回"
shipyard_ID[53750] = "委托建造极光轮回"
shipyard_ID[53760] = "委托建造库申无畏舰"
shipyard_ID[53770] = "委托建造末世无畏舰"
shipyard_ID[53780] = "委托建造虚空"
shipyard_ID[53790] = "委托建造暗夜女神"
shipyard_ID[53800] = "委托建造牵星级巨型码头舰"
shipyard_ID[53810] = "委托建造防御无畏舰"
shipyard_ID[53820] = "委托建造秩序级无畏舰"
shipyard_ID[53830] = "委托建造阿切洛特级巨型工程船坞舰"
shipyard_ID[53840] = "委托建造泰坦无畏"
shipyard_ID[53850] = "委托建造艾洛斯无畏舰"
shipyard_ID[53860] = "委托建造防风级超级货舰"
shipyard_ID[53870] = "委托建造女皇4代"
shipyard_ID[53880] = "委托建造艾洛斯运输舰"
shipyard_ID[53890] = "委托建造魔族大型货舰"

shipyard_ID[53895] = "处理废弃舰船"
shipyard_ID[53900] = "拆解或者修复这艘星舰"

shipyard_ID[53905] = "购买"




shipyard_ID[53943] = "建造虚空蚁巢舰队型"

shipyard_ID[53950] = "建造第三代女皇级"
shipyard_ID[53960] = "建造永恒级无畏舰"
shipyard_ID[53970] = "委托建造奥丁精英型"
shipyard_ID[53980] = "委托建造马卡恩之怒"
shipyard_ID[53990] = "拆分打捞游骑兵"

shipyard_ID[54000] = "购买掠夺者级巡洋舰"
shipyard_ID[54010] = "购买侵略者级导弹攻城舰"
shipyard_ID[54020] = "购买毁灭者导弹袭击舰"

shipyard_ID[54030] = "向秘密商人购买舰船"
shipyard_ID[54040] = "建造厄瑞玻斯级特装战列舰"

shipyard_ID[54050] = "建造英德拉斯级战列舰"
shipyard_ID[54060] = "建造猎隼号"
shipyard_ID[54070] = "建造依文洁琳号战列舰"
shipyard_ID[54080] = "建造巡航管制舰"
shipyard_ID[54090] = "建造曜锋号战列舰"

shipyard_ID[54100] = "建造雅典娜精英1号舰"
shipyard_ID[54110] = "建造雅典娜精英3号舰"
shipyard_ID[54120] = "建造雅典娜精英2号舰"

shipyard_ID[54130] = "警告该型舰只能造1艘，额外建造会引发BUG"


shipyard_ID[54140] = "建造塞尔芬迪娜级"
shipyard_ID[54150] = "建造军团骑士"
shipyard_ID[54160] = "建造游骑兵航母"
shipyard_ID[54170] = "建造格蕾丝马瑞亚"
shipyard_ID[54180] = "建造赛芙莉尔号"
shipyard_ID[54190] = "建造突袭者"
shipyard_ID[54200] = "建造精英远行者"
shipyard_ID[54210] = "建造裂痕2E型重骑兵型"

shipyard_ID[54220] = "建造裂痕2F莫尔迪基安大君型"

shipyard_ID[54230] = "建造裂痕2G型旅团辅助航母"
shipyard_ID[54240] = "建造十四公主"
shipyard_ID[54250] = "建造裂痕121"
shipyard_ID[54260] = "建造裂痕2GFG"

shipyard_ID[54270] = "建造索托亚玛拉型"
shipyard_ID[54280] = "建造铁马卡恩之怒浮屠号"

shipyard_ID[54290] = "建造君王级战略旗舰"
shipyard_ID[54300] = "建造索托亚级超级航母"
shipyard_ID[54310] = "建造索托亚级精英型"
shipyard_ID[54320] = "建造安吉丽娜级"
shipyard_ID[54330] = "建造赫利奥斯级无畏舰"
shipyard_ID[54340] = "建造混沌之刃级无畏舰"

shipyard_ID[54350] = "建造安吉丽娜级重型航母"
shipyard_ID[54360] = "建造远行者MK2级袖珍战列舰"
shipyard_ID[54370] = "建造远行者MK2级货舰"

shipyard_ID[54380] = "建造阳帆级护卫战巡"

shipyard_ID[54390] = "建造哈迪斯级移动航空基地"
shipyard_ID[54400] = "建造尤里西斯"
shipyard_ID[54410] = "建造Avalon阿瓦隆"
shipyard_ID[54420] = "建造Excalibur胜利之剑"
shipyard_ID[54430] = "建造叹息之墙"
shipyard_ID[54440] = "建造图腾级战列舰"
shipyard_ID[54450] = "建造图腾级航母"
shipyard_ID[54460] = "建造图腾级货舰"
shipyard_ID[54470] = "建造乌兰巴托级"

shipyard_ID[54480] = "建造永恒级"
shipyard_ID[54490] = "建造暗夜女神级"
shipyard_ID[54500] = "建造浩劫级"
shipyard_ID[54510] = "建造光辉女神级"
shipyard_ID[54520] = "建造洛神级"
shipyard_ID[54530] = "建造休伯利安号"

shipyard_ID[54540] = "建造艾瑞希尔"
shipyard_ID[54550] = "建造耶梦加得号"

shipyard_ID[54560] = "建造提丰级战巡"
shipyard_ID[54570] = "建造炼风级战巡"
shipyard_ID[54580] = "建造提丰级战巡D型"

shipyard_ID[54590] = "建造晨锋级"
shipyard_ID[54591] = "曦景湛然，刃吟如歌。苍星战团直卫，为终结战争来此"
shipyard_ID[54600] = "建造尤里西斯"
shipyard_ID[54601] = "审判日的特殊改进型"

shipyard_ID[54610] = "建造圣碑级激光无畏舰"
shipyard_ID[54611] = "大型激光炮无畏舰，可以发射高能激光束来摧毁目标"

shipyard_ID[54620] = "建造神罚歼灭型"
shipyard_ID[54621] = "神罚的武装强化版本，用来突袭强大的舰队"




 g_sellposition = {} 
 g_sellposition[1]="收购地点：\n帝国之门燃料站\n帝国殖民地太空农场\n帝国殖民地太空牧场\n卡拉克\n卡厄斯联盟混沌商人\n星门都市格利普斯\n" 
 g_sellposition[2]="收购地点：\n天使之月贸易站\n坦尼斯旗舰船坞贸易站\n帝国之门旗舰集结地\n帝国前线\n巴塔利安战舰坟场贸易站\n卡厄斯联盟—联合泊地\n星门都市格利普斯\n" 
 g_sellposition[3]="收购地点：\n希格拉首星贸易站\n尼福尔海姆贸易站\n维格尔东线军阀控制区\nEDF控制区\n卡厄斯联盟—联合泊地\n" 
 g_sellposition[4]="收购地点：\n没有地方收购\n" 
 g_sellposition[5]="收购地点：\n帝国采矿区贸易站\nEDF控制区\n莫尔迪基安大君星区\n" 
 g_sellposition[6]="收购地点：\n这东西是超空间跳跃用的，所有商店都不会收购，请不要把它卖了\n" 
 g_sellposition[7]="收购地点：\n天使之月贸易站\n帝国采矿区贸易站\n希格拉首星贸易站\n朝圣者活动区\n莫尔迪基安大君星区\n卡厄斯联盟—利贝尔共和国\n" 
 g_sellposition[8]="收购地点：\n天使之月贸易站\n坦尼斯旗舰船坞贸易站\n先祖遗迹\n帝国前线\n卡拉克\n朝圣者活动区\n蚁巢舰队活动区\n星门都市格利普斯\n" 
 g_sellposition[9]="收购地点：\n帝国之门旗舰船坞群\n希格拉首星贸易站\n赫尔海利姆贸易站\n朝圣者活动区\n星门都市格利普斯\n" 
 g_sellposition[10]="收购地点：\n帝国殖民地贸易站\n希格拉首星贸易站\n希格拉首星贸易站\n卡拉克\n泰瓦伦共和国\n卡厄斯联盟—联合泊地\n" 
 g_sellposition[11]="收购地点：\n帝国之门贸易站\n泰瓦伦共和国\nEDF控制区\n追忆之庭星区\n" 
 g_sellposition[12]="收购地点：\n帝国之门贸易站\n希格拉首星贸易站\n朝圣者活动区\n卡厄斯联盟混沌商人\n" 
 g_sellposition[13]="收购地点：\n帝国农场食品厂\n帝国殖民地贸易站\n维格尔殖民星区\n莫尔迪基安大君星区\n星门都市格利普斯\n卡拉克\n" 
 g_sellposition[14]="收购地点：\n帝国农场群\n朝圣者活动区\n维格尔东线军阀控制区\n莫尔迪基安大君星区\n星门都市格利普斯\n" 
 g_sellposition[15]="收购地点：\n帝国殖民地贸易站\n朝圣者活动区\n星门都市格利普斯\n" 
 g_sellposition[16]="收购地点：\n帝国采矿区贸易站\n巴塔利安战舰坟场贸易站\n卡厄斯联盟—利贝尔共和国\n追忆之庭星区\n" 
 g_sellposition[17]="收购地点：\n希格拉首星贸易站\n巴塔利安战舰坟场贸易站\n帝国前线\n维格尔东线军阀活动区\n" 
 g_sellposition[18]="收购地点：\n哥合拿贸易站\n泰瓦伦共和国\n维格尔东线军阀活动区\n追忆之庭星区\n" 
 g_sellposition[19]="收购地点：\n帝国殖民地\n卡拉克\n卡厄斯联盟—利贝尔共和国\n星门都市格利普斯\n" 
 g_sellposition[20]="收购地点：\n帝国之门旗舰船坞\n坦尼斯旗舰船坞贸易站\n尼福尔海姆贸易站\n卡厄斯联盟—联合泊地\n" 
 g_sellposition[21]="收购地点：\n帝国之门旗舰船坞\n尼福尔海姆贸易站\n卡厄斯联盟—联合泊地\n" 
 g_sellposition[22]="收购地点：\n帝国殖民地主力舰船坞\n巴塔利安战舰坟场贸易站\n菲雅利帝国船坞\n卡厄斯联盟—前线\n" 
 g_sellposition[23]="收购地点：\n坦尼斯旗舰船坞贸易站\n泰瓦伦共和国\n追忆之庭星区\n" 
 g_sellposition[24]="收购地点：\n坦尼斯旗舰船坞贸易站\n尼福尔海姆贸易站\n卡厄斯联盟混沌商人\n" 
 g_sellposition[25]="收购地点：\n天使之月贸易站\n帝国殖民地主力舰船坞\n塞勒姆主力舰船坞贸易站\n维格尔东线军阀活动区\nEDF控制区\n卡厄斯联盟—联合泊地\n" 
 g_sellposition[26]="收购地点：\n帝国殖民地主力舰船坞\n天使之月贸易站\nEDF控制区\n卡厄斯联盟—前线\n" 
 g_sellposition[27]="收购地点：\n坦尼斯旗舰船坞贸易站\n菲雅利帝国船坞群\nEDF控制区\n蚁巢舰队活动区\n卡厄斯联盟—联合泊地\n" 
 g_sellposition[28]="收购地点：\n帝国殖民地主力舰船坞\nEDF控制区\n卡厄斯联盟—联合泊地\n卡厄斯联盟—联合泊地\n" 
 g_sellposition[29]="收购地点：\n帝国殖民地主力舰船坞\n塞勒姆主力舰船坞贸易站\n帝国前线\nEDF控制区\n卡厄斯联盟—前线\n" 
 g_sellposition[30]="收购地点：\n帝国之门旗舰集结地\n尼福尔海姆贸易站\n海盗基地\n菲雅利帝国船坞群\nEDF控制区\n蚁巢舰队活动区\n卡厄斯联盟—联合泊地\n" 
 g_sellposition[31]="收购地点：\n帝国采矿区贸易站\n希格拉首星贸易站\n蚁巢舰队活动区\n莫尔迪基安大君星区\n卡厄斯联盟—联合泊地\n卡厄斯联盟混沌商人\n" 
 g_sellposition[32]="收购地点：\n帝国殖民地贸易站\n莫尔迪基安大君星区\n卡厄斯联盟混沌商人\n" 
 g_sellposition[33]="收购地点：\n帝国殖民地贸易站\n朝圣者活动区\n莫尔迪基安大君星区\n" 
 g_sellposition[34]="收购地点：\n帝国之门贸易站\n帝国农场群\n朝圣者活动区\n" 
 g_sellposition[35]="收购地点：\n尼福尔海姆贸易站\n莫尔迪基安大君星区\n卡厄斯联盟混沌商人\n" 
 g_sellposition[36]="收购地点：\n帝国之门贸易站\nEDF控制区\n莫尔迪基安大君星区\n追忆之庭星区\n" 
 g_sellposition[37]="收购地点：\n帝国之门贸易站\n朝圣者活动区\n追忆之庭星区\n未知贸易站\n" 
 g_sellposition[38]="收购地点：\n帝国之门贸易站\n菲雅利帝国船坞群\n追忆之庭星区\n卡厄斯联盟—联合泊地\n" 
 g_sellposition[39]="收购地点：\n帝国殖民地贸易站\n希格拉首星贸易站\n卡厄斯联盟—联合泊地\n" 
 g_sellposition[40]="收购地点：\n帝国之门贸易站\n尼福尔海姆贸易站\n追忆之庭星区\n" 
 g_sellposition[41]="收购地点：\n帝国之门旗舰船坞\n帝国农场\n" 
 g_sellposition[42]="收购地点：\n赫尔海利姆贸易站\n" 
 g_sellposition[43]="收购地点：\n赫尔海利姆贸易站\n" 
 g_sellposition[44]="收购地点：无\n" 
 g_sellposition[45]="收购地点：\n希格拉首星贸易站\n" 
 g_sellposition[46]="收购地点：\n未知贸易站\n" 
 g_sellposition[47]="收购地点：\n未知贸易站\n" 
 g_sellposition[48]="收购地点：\n帝国殖民地贸易站\n海盗基地\n维格尔东线军阀控制区\n" 
 g_sellposition[49]="收购地点：\n天使之月贸易站\n巴塔利安战舰坟场贸易站\n菲雅利帝国船坞群\n维格尔东线军阀活动区\n卡厄斯联盟—联合泊地\n" 
 g_sellposition[50]="收购地点：\n塞勒姆主力舰船坞贸易站\n尼福尔海姆贸易站\n第58特混舰队集结地\n" 
 g_sellposition[51]="收购地点：\n坦尼斯旗舰船坞贸易站\n卡厄斯联盟—联合泊地\n" 
 g_sellposition[52]="收购地点：\n坦尼斯旗舰船坞贸易站\n维格尔船坞群\n菲雅利帝国船坞群\n卡厄斯联盟—联合泊地\n" 
 g_sellposition[53]="收购地点：\n坦尼斯旗舰船坞贸易站\n维格尔船坞群\n菲雅利帝国船坞群\n卡厄斯联盟—联合泊地\n" 
 g_sellposition[54]="收购地点：\n帝国之门贸易站\n朝圣者活动区\n" 
 g_sellposition[55]="收购地点：\n菲雅利帝国船坞群\n" 
 g_sellposition[56]="收购地点：\n卡厄斯联盟—利贝尔共和国\n朝圣者活动区" 
 g_sellposition[57]="收购地点：\n帝国之门贸易站\n希格拉首星贸易站\n卡拉克\n朝圣者活动区\n" 
 g_sellposition[58]="收购地点：\n帝国殖民地贸易站\n帝国农场\n卡拉克\n" 
 g_sellposition[59]="收购地点：\n巴塔利安战舰坟场贸易站\n卡厄斯联盟—利贝尔共和国\n" 
 g_sellposition[60]="收购地点：\n帝国殖民地贸易站\n希格拉首星贸易站\n追忆之庭星区\n" 
 g_sellposition[61]="收购地点：\n巴塔利安战舰坟场贸易站\n卡拉克\n追忆之庭星区\n" 
 g_sellposition[62]="收购地点：\n希格拉首星贸易站\n莫尔迪基安大君星区\n" 
 g_sellposition[63]="收购地点：\n海盗基地\n维格尔东线军阀控制区\n" 
 g_sellposition[64]="收购地点：\n帝国殖民地贸易站\n帝国农场\n卡厄斯联盟—利贝尔共和国\n" 
 g_sellposition[65]="收购地点：\n帝国之门贸易站\n卡厄斯永生者探索之初\n" 
 g_sellposition[66]="收购地点：\n希格拉首星贸易站\n海盗基地\n第58特混舰队集结地\n" 
 g_sellposition[67]="收购地点：\n希格拉首星贸易站\n尼福尔海姆贸易站\n莫尔迪基安大君星区\n" 
 g_sellposition[68]="收购地点：\n尼福尔海姆贸易站\n" 
 g_sellposition[69]="收购地点：\n帝国殖民地贸易站\n卡拉克\n星门都市格利普斯\n"  
 g_sellposition[70]="收购地点：\n坦尼斯旗舰船坞贸易站\n巴塔利安战舰坟场贸易站\n菲雅利帝国船坞群\n" 
 g_sellposition[71]="收购地点：\n帝国殖民地贸易站\n巴塔利安战舰坟场贸易站\n卡厄斯永生者探索之初\n"   
 g_sellposition[72]="收购地点：\n帝国之门贸易站\n希格拉首星贸易站\n巴塔利安战舰坟场贸易站\n莫尔迪基安大君星区\n"   
 g_sellposition[73]="收购地点：\n希格拉首星贸易站\n卡厄斯联盟混沌商人\n星门都市格利普斯\n"   
 g_sellposition[74]="生产200需要：\n能量块1000\n殖民地工人500" 
 g_sellposition[78]="生产需要：\n" 
 g_sellposition[79]="生产需要：\n"  
 g_sellposition[80]="生产需要：\n" 
 g_sellposition[81]="生产200需要：\n能量块1000\n殖民地工人500\n" 
 g_sellposition[82]="生产2000需要：\n能量块50\n淡水储备250\n殖民地工人50\n" 
 g_sellposition[83]="生产1000需要：\n殖民地工人100\n谷物储备1000\n能量块500\n淡水储备500\n谷物储备1000\n殖民地工人100\n" 
 g_sellposition[84]="生产2000需要：\n能量块400\n冰矿储备1600\n谷物储备1000\n殖民地工人40\n" 
 g_sellposition[85]="生产2000需要：\n能量块800\n肉制品储备1000\n谷物储备2000\n能量块800\n淡水储备200\n谷物储备1000\n肉制品储备1000\n殖民地工人40\n" 
 g_sellposition[86]="生产500需要：\n殖民地工人10\n金属矿石储备100\n" 
 g_sellposition[87]="生产10000需要：\n殖民地工人50\n淡水储备1000\n" 
 g_sellposition[88]="生产1000需要：\n殖民地工人50\n能量块300\n合金储备200\n能量块400\n" 
 g_sellposition[89]="生产1000需要：\n殖民地工人10\n能量块20\n合金储备50\n" 
 g_sellposition[90]="生产2000需要：\n殖民地工人50\n能量块2000\n" 
 g_sellposition[91]="恢复200需要：\n殖民地工人100\n食品储备200\n生活用品储备200\n弹药储备1000\n能量块800\n" 
 g_sellposition[92]="恢复2000需要：\n食品储备2000\n生活用品储备2000\n淡水储备2000\n能量块2000\n" 
 g_sellposition[93]="生产需要：\n" 
 g_sellposition[94]="生产需要：\n" 
 g_sellposition[95]="收购地点：\n希格拉首星贸易站\n帝国殖民地贸易站\n尼福尔海姆贸易站\n" 
 g_sellposition[96]="收购地点：\n帝国之门贸易站\n尼福尔海姆贸易站\n菲雅利帝国船坞群\nEDF控制区\n星门都市格利普斯\n" 
 g_sellposition[97]="收购地点：\n巴塔利安战舰坟场贸易站\n" 
 g_sellposition[98]="收购地点：\n巴塔利安战舰坟场贸易站\n维格尔东线军阀活动区\n" 
 g_sellposition[99]="收购地点：\n帝国之门贸易站\n希格拉首星贸易站\n卡厄斯联盟—利贝尔共和国\n卡厄斯永生者探索之初\n" 
 g_sellposition[100]="生产1个需要：\n殖民地工人1000\n能量块1000\n大型武器配件10\n电子元件储备1000\n合金储备100\n" 
 g_sellposition[101]="生产5需要：\n殖民地工人200\n能量块20000\n肉制品储备100\n电子元件储备100\n合金储备10\n" 
 g_sellposition[102]="生产10需要：\n殖民地工人100\n能量块1000\n电子元件储备200\n合金储备500\n" 
 g_sellposition[103]="生产1000需要：\n殖民地工人100\n能量块1000\n谷物储备400\n合金储备500\n" 
 g_sellposition[104]="生产10需要：\n殖民地工人50\n能量块2000\n电子元件储备200\n合金储备10\n" 
 g_sellposition[133]="收购地点：\n帝国之门贸易站\n尼福尔海姆贸易站\n菲雅利帝国船坞群\n卡厄斯永生者探索之初\n星门都市格利普斯\n莫尔迪基安大君星区\n" 
 g_sellposition[161]="收购地点：\n巴塔利安战舰坟场贸易站\n海盗基地\n维格尔东线军阀控制区\n卡厄斯联盟—利贝尔共和国\n卡厄斯联盟混沌商人\n" 
 g_sellposition[162]="收购地点：\n帝国殖民地贸易站\n希格拉首星贸易站\n尼福尔海姆贸易站\n泰瓦伦共和国\n卡厄斯联盟—利贝尔共和国\n卡厄斯联盟混沌商人\n" 
 g_sellposition[163]="收购地点：\n先祖遗迹\n" 
 g_sellposition[178]="收购地点：\n星门都市格利普斯\n卡厄斯联盟—联合泊地\n帝国前线\n尼福尔海姆贸易站\n巴塔利安战舰坟场贸易站\n坦尼斯旗舰船坞贸易站\n帝国殖民地主力舰船坞\n" 
 
   
 Locale_ship = {}

-------------------------------------------------------------------------------
Locale_ship[0001] = "小型帝国商船"
Locale_ship[0002] = "FY1000吨级小型货船，一种最常见的小型货船，装了一部质量低劣的跳跃引擎。而且防御力十分脆弱，没有武装。优点是价格便宜，消耗较低。  "
Locale_ship[0005] = "双头鲨级袭击舰"
Locale_ship[0006] = "由两艘战列巡洋舰船体组成的大型战舰，拥有不错的生命力和载货量，是维格尔人发动袭击作战的首选兵种"
Locale_ship[0010] = "白羊级护卫舰MK2型"
Locale_ship[0011] = "新型的通用型护卫舰，也可以对护卫舰进行攻击，优点是消耗较低，不需要太多补给。  "
Locale_ship[0015] = "重型突击舰"
Locale_ship[0016] = "拥有高超性价比的重型护卫舰，厚重的装甲让它可以同主力舰抗衡，不错的货仓容量也适合用来运载一些商品，该舰还有一个小型机库用来携带无人机。  "
Locale_ship[0020] = "希格拉鱼雷舰"
Locale_ship[0021] = "通用性较强的一种护卫舰，可以发射反舰鱼雷和反护航艇鱼雷。  "
Locale_ship[0025] = "导弹护卫舰"
Locale_ship[0026] = "装备了强力反舰导弹的护卫舰，可以对敌人的主力舰造成有效威胁。  "
Locale_ship[0030] = "突袭舰"
Locale_ship[0031] = "装备了数门小口径防空炮的防空战舰，也可以执行一些袭击任务。  "
Locale_ship[0035] = "埃赫洛斯嘉德鱼雷舰"
Locale_ship[0036] = "重装甲型鱼雷护卫舰，它们拥有比常规护卫舰更加厚重的装甲，可以在战斗中更加持久的发挥火力  "
-------------------------------------------------------------------------------
Locale_ship[0100] = "中型帝国货船"
Locale_ship[0101] = "FY2000吨级中型货船，1000吨级小型商船的升级版，在容量大大提升的情况下跳跃性能却显著提高，是大部分小型商船队的最佳选择。而且防御力十分脆弱，没有武装。  "
Locale_ship[0105] = "小型交通艇"
Locale_ship[0106] = "方便快捷的交通运输艇，专门为大型旗舰增加卸货效率而设计。可以高效率的运输人员，补给，还有各种物资"
Locale_ship[0110] = "量产型驱逐舰"
Locale_ship[0111] = "一种成本低廉的小型主力舰，很适合为一些小型商业舰队护航，也适合独自运载货物，价格便宜是它的最大优点。  "
Locale_ship[0115] = "希格拉驱逐舰"
Locale_ship[0116] = "希格拉人的制式主力舰，大量中口径火炮可以轻松的消灭小型战舰，船头装备的重型鱼雷可以有效的对主力舰造成伤害  "
Locale_ship[0120] = "重炮驱逐舰"
Locale_ship[0121] = "轻巧快速的重炮驱逐舰，这种驱逐舰拥有优秀的机动力和大口径的重型火炮，可以有效的对敌人轻小型战舰造成伤害。不过装甲较为脆弱是它的最大缺点  "
Locale_ship[0125] = "格蕾丝马瑞亚"
Locale_ship[0126] = "拥有较高移动速度的实验型航母，随船携带一堆先进的精锐战斗机参战（舰队中仅能装备一艘该类型的战舰）"
-------------------------------------------------------------------------------
Locale_ship[0200] = "大型货船"
Locale_ship[0201] = "FY3000吨级大型货船，3000吨级货船继承了FY系列商船的一贯优点和缺点，消耗低，价格便宜。但是防御脆弱，速度缓慢  "
Locale_ship[0205] = "装甲型亚特兰大级巡洋舰"
Locale_ship[0206] = "拥有厚重装甲和宽大货仓的辅助型巡洋舰，可以在危险的敌占区运送大量货物和商品"
Locale_ship[0207] = "亚特兰大装甲加强型"
Locale_ship[0208] = "亚特兰大级的装甲加强型，拥有厚重装甲和宽大货仓，可以在危险的敌占区运送大量货物和商品"
Locale_ship[0210] = "轻型巡洋舰"
Locale_ship[0211] = "一种造价低廉的高效能巡洋舰，可以用来执行各种战斗任务。  "
Locale_ship[0215] = "希格拉重巡洋舰"
Locale_ship[0216] = "希格拉舰队中最常见的一种主力舰，拥有良好的泛用性能，可以有效的执行各种任务。  "
Locale_ship[0220] = "费纳尼亚级巡洋舰"
Locale_ship[0221] = "一种价格更低廉的量产型巡洋舰，相对不错的性价比弥补了质量上的缺陷"
Locale_ship[0225] = "独角兽级重巡洋舰"
Locale_ship[0226] = "一种拥有厚重装甲的强大战舰，是战场上冲锋陷阵的主力。  "
-------------------------------------------------------------------------------
Locale_ship[0300] = "希格拉舰队航母"
Locale_ship[0301] = "希格拉人的舰队航母，除了能携带大量舰载机外，还能生产部分的补给。同时也可以生产一些补给品（本舰在超空间模块后可以带领其他舰船进行跳跃）"
Locale_ship[0305] = "重型航母"
Locale_ship[0306] = "维格尔人常用的舰队航母，拥有厚重的装甲和所有航母中最大的货仓。同时也可以生产一些补给品（本舰在超空间模块后可以带领其他舰船进行跳跃）"
Locale_ship[0310] = "武装航母"
Locale_ship[0311] = "装备了大量火炮和武器的武装航母，经常用来深入敌后执行一些袭击任务。同时也可以生产一些补给品（本舰在超空间模块后可以带领其他舰船进行跳跃）"
Locale_ship[0315] = "弥璃级舰队航母"
Locale_ship[0316] = "菲雅利人的舰队航母，除了能携带大量舰载机外，还拥有不错的改造潜力。同时也可以生产一些补给品（本舰在超空间模块后可以带领其他舰船进行跳跃）"
-------------------------------------------------------------------------------
Locale_ship[0400] = "重型帝国货舰"
Locale_ship[0401] = "该舰的庞大货仓可以运送一些超大体积的货物，它的防御力不足，只适合在有大量舰队护航或是较为安全的地方航行。  "
Locale_ship[0405] = "主教级货舰"
Locale_ship[0406] = "希格拉人最常用的货物运输舰，可以运载大量的物资，同时装甲也比较厚重  "
Locale_ship[0410] = "埃赫洛斯嘉德巨型运输舰"
Locale_ship[0411] = "一种巨大的运输货舰，原本用来作为行星间的移民运输船使用，拥有难以想象的庞大货仓和极其缓慢的移动速度。  "
Locale_ship[0415] = "远行者级战列舰"
Locale_ship[0416] = "由巨型货舰改装而来的支援型战列舰，拥有厚重的装甲和相对低廉的价格以及宽大的货仓和机库"
Locale_ship[0420] = "埃赫洛斯嘉德巨型工业舰"
Locale_ship[0421] = "一种巨大的运输货舰，原本用来作为行星间的移民运输船使用，拥有难以想象的庞大货仓和极其缓慢的移动速度。  "
-------------------------------------------------------------------------------
Locale_ship[0500] = "阔刃级袭击舰"
Locale_ship[0501] = "一种以厚重装甲闻名的超重型战舰，阔刃级袭击舰拥有厚重的船体和宽大的货仓，舰载机库让它可以独立进行巡航。不过行动缓慢是它最大的缺陷"
Locale_ship[0505] = "巡回者级袭击舰"
Locale_ship[0506] = "巡回者级是一种真正意义上的袭击舰，它拥有完美的战斗力和较高的巡航速度，宽大的货仓和舰载机库让它可以在敌人后方游走"
Locale_ship[0510] = "战列巡洋舰-菲米琳斯"
Locale_ship[0511] = "装备了大量大口径巨炮的埃赫洛斯嘉德战列巡洋舰，可以有效的对敌人舰群进行压制"
Locale_ship[0515] = "教主级支援战列舰"
Locale_ship[0516] = "一种支援型的战列舰，拥有大量离子炮塔和宽大的货仓，可以进行各种任务。"
-------------------------------------------------------------------------------
Locale_ship[0605] = "曙光级战列舰"
Locale_ship[0606] = "菲雅利帝国舰队的核心力量，装备了大量巨炮的巨型战舰，曙光级战列舰可以和任何一种维格尔战舰相抗衡，不过庞大的船体需要大量的后勤物资才能供养。"
Locale_ship[0607] = "曙光C型战列舰"
Locale_ship[0608] = "装备了双联装电磁轨道炮曙光级战列舰，射击间隔较长，主要用来反制敌方旗舰"
Locale_ship[0609] = "曙光G型战列舰"
Locale_ship[0610] = "装备了三联装光束主炮的曙光级战列舰，适合压制敌人的大型旗舰"



Locale_ship[0615] = "血刃级战列舰"
Locale_ship[0616] = "维格尔人的舰队核心力量，拥有强大的激光主炮和大量攻坚武器，不过需要大量的补给才能保持战斗力"
Locale_ship[0620] = "领主级战列舰"
Locale_ship[0621] = "希格拉人舰队的核心力量，装备了大量的重型离子炮和高性能的反舰鱼雷发射器生存能力十分强大"
-------------------------------------------------------------------------------
Locale_ship[0700] = "轮回级无畏舰MK2"
Locale_ship[0701] = "一种可怕的巨型战舰，搭载的八座巨炮拥有毁天灭地的威力。"
Locale_ship[0705] = "防御无畏舰"
Locale_ship[0706] = "一种拥有厚重装甲的巨型战舰，可以抵挡最猛烈的攻击。"
Locale_ship[0710] = "末世级无畏舰"
Locale_ship[0711] = "一种强大的导弹无畏舰，所发射的红莲导弹可以轻松摧毁任何一艘敌舰"
Locale_ship[0715] = "埃赫洛斯嘉德无畏舰"
Locale_ship[0716] = "拥有厚重装甲和2座超级主炮塔的巨型战舰，它是埃赫洛斯嘉德帝国的核心力量"
-------------------------------------------------------------------------------
Locale_ship[0800] = "兵锋级无人机"
Locale_ship[0801] = "菲雅利帝国最常见到的一种战斗无人机，轻便小巧，消耗低廉。"
Locale_ship[0805] = "希格拉拦截机"
Locale_ship[0806] = "希格拉人的专用制空战斗机，拥有不错的性能。"
Locale_ship[0810] = "突击机"
Locale_ship[0811] = "维格尔人的常用战斗机，拥有大口径机枪和较低的制造成本。"
-------------------------------------------------------------------------------
Locale_ship[0900] = "霉菌级重炮艇"
Locale_ship[0901] = "菲雅利帝国最新开发的重型护航艇，可以有效的驱逐敌人的战斗机群。（该单位只有体积较大的机库才能搭载）"
Locale_ship[0910] = "反舰无人机编队"
Locale_ship[0911] = "装载了大威力反舰飞弹的攻击型无人机，可以轻松的摧毁敌人的主力舰。（对巡洋舰级别单位有额外攻击优势）"
Locale_ship[0915] = "脉冲艇编队"
Locale_ship[0916] = "希格拉脉冲艇编队，可以用来摧毁敌人的战斗机或者炮艇。（该单位只有体积较大的机库才能搭载）"
Locale_ship[0920] = "导弹艇编队"
Locale_ship[0921] = "拥有较强通用性的导弹艇，灵巧的导弹可以对付各种敌人。（该单位只有体积较大的机库才能搭载）"
-------------------------------------------------------------------------------
Locale_ship[1000] = "尘埃级工程艇"
Locale_ship[1001] = "这种新出现的小型工程单位迅速的在帝国民间和军方中流行起来"
Locale_ship[1005] = "希格拉采矿艇"
Locale_ship[1006] = "希格拉人常用的一种采矿设备，可以再太空中开采矿石，也可以用来修补战舰（该单位只有体积较大的机库才能搭载）"
Locale_ship[1010] = "维格尔采矿艇"
Locale_ship[1011] = "维格尔军队中常用的采矿设备，也可以用来修补战舰（该单位只有体积较大的机库才能搭载）"
Locale_ship[1015] = "埃赫洛斯嘉德采矿艇"
Locale_ship[1016] = "埃赫洛斯嘉德帝国的一种制式采矿设备，这种采矿艇服役年代比较久远"
Locale_ship[1100] = "月影级探险船"
Locale_ship[1101] = "月环重工专门开发的一种民用探险船，拥有高航速和低消耗。主要防卫武器为该公司最新开发的长程离子光束\n设计者：幻天破"
Locale_ship[1150] = "妖姬运载舰"
Locale_ship[1151] = "一种拥有强大战斗力的巨型母舰，拥有宽大的货仓和大威力的主炮，还可以自行生产商品和补给物资（该舰可以搭载5个工业模块）"
Locale_ship[1200] = "萨尤克之钥"
Locale_ship[1201] = "一种拥有高威力主炮的先祖战舰，虽然难以对其级别进行明确的判定，但是可以确定该舰队拥有强大的战斗力"
Locale_ship[1210] = "守护者"
Locale_ship[1211] = "一种驱逐舰级别的先祖战舰"
Locale_ship[1220] = "雄峰战斗机"
Locale_ship[1221] = "先祖科技下的产物，难以摧毁，而且威力强大"
Locale_ship[1250] = "渡鸦轰炸机"
Locale_ship[1251] = "一种专门用来攻击主力舰的战略轰炸机，装备了威力强大的等离子炸弹。在投弹后需要进行长时间的蓄能投弹（该单位只有体积较大的机库才能搭载）"
Locale_ship[1300] = "航向黎明号"
Locale_ship[1301] = "埃赫洛斯嘉德帝国参考UNSC技术仿制而来的一种先进战舰，拥有强大的船首电磁炮和不错的战斗力"
Locale_ship[1305] = "英德拉斯级战列舰"
Locale_ship[1306] = "埃赫洛斯嘉德帝国的新锐战列舰，拥有强大的电磁炮武器。  "
Locale_ship[1310] = "猎鲨级袭击舰"
Locale_ship[1311] = "维格尔人的新型模块化战舰，拥有不错的航程和足够强大的战斗力，成本却很低廉"
Locale_ship[1350] = "希格拉舰载攻击机"
Locale_ship[1351] = "希格拉人的制式舰载机，可以有效的对敌人的中小型战舰进行压制。可以停泊于大部分有机库的舰船上"
Locale_ship[1355] = "猎隼号"
Locale_ship[1356] = "埃赫洛斯嘉德帝国接收的VGR叛军为其所建造的旗舰，作为多功能战舰同时具有可观的火力与防护并具备了生产能力。"
Locale_ship[1360] = "巡航管制舰"
Locale_ship[1361] = "希尔梅里亚号，埃赫洛斯嘉德帝国建造的一艘验证型战舰，用于新型设备的测试工作。搭载有最新的等离子引擎。"
Locale_ship[1365] = "放逐者级驱逐舰"
Locale_ship[1366] = "先进的多功能驱逐舰，强大的光束武器可以有效的应付各种情况。"
Locale_ship[1370] = "清除者"
Locale_ship[1371] = "一种机动灵活，拥有持续性火力的先进巡洋舰。该舰的先进的自动维修系统还可以让其在战斗中快速的修复损伤"
Locale_ship[1375] = "破晓II级"
Locale_ship[1376] = "妖精重工重型战术舰改装而来的先进战列舰，拥有威力强大的3500四联装攻城火炮和厚重的装甲"
Locale_ship[1380] = "轻羽级支援航母"
Locale_ship[1381] = "一种专门为了边境巡逻而设计的超轻型航母，它的容量和货仓都十分有限，造价便宜和可以携带小规模舰队进行超空间跳跃是最大的优点"
Locale_ship[1385] = "妖精女皇号"
Locale_ship[1386] = "菲雅利帝国的战争方舟，拥有威力强大的主炮和坚不可摧的装甲。它是菲雅利帝国的精神象征。（注意，妖精女皇号的供给要求极高，一旦补给耗尽和资金耗尽该舰会自动离开舰队)"
Locale_ship[1390] = "沙迦级装甲舰"
Locale_ship[1391] = "装甲厚重的重型战舰，可以承受强火力的攻击，巨盾的升级版"
Locale_ship[1395] = "巡空者MK3突击舰"
Locale_ship[1396] = "拥有良好生存力的小型突击舰，装备了频射火炮和庞大的载货机仓"
Locale_ship[1400] = "扫荡者级战列舰"
Locale_ship[1401] = "可以高速清扫小型战舰的先进战列舰，拥有良好的攻防能力"
Locale_ship[1405] = "奥丁级无畏舰"
Locale_ship[1406] = "设施完善的先进无畏舰，拥有独自作战的强大实力"
Locale_ship[1410] = "马卡恩之怒"
Locale_ship[1411] = "维格尔人的巨型战争堡垒，一些维格尔的大军阀同意将其出售给帝国商人以换取足够的利润"
Locale_ship[1415] = "永恒级无畏舰"
Locale_ship[1416] = "参考希灵人技术制作出的先进无畏舰，强大的主炮可以摧毁一切旗舰级单位"
Locale_ship[1420] = "魔方级装甲突击船"
Locale_ship[1421] = "小巧坚固的装甲突击舰，可以在敌人的凶猛火力中生存下来，但是较为笨拙"
Locale_ship[1425] = "星辰战斗机"
Locale_ship[1426] = "精锐的先进战斗机，菲雅利帝国只会将这种先进战斗机出售给对帝国有重大贡献的人"
Locale_ship[1430] = "耀峰战列舰"
Locale_ship[1431] = "外来文明在埃赫洛斯嘉德帝国定制的一艘先进战列舰，该舰还随船携带了一队先进战斗机（舰队中仅能装备一艘该类型的战舰）"
Locale_ship[1440] = "埃赫洛斯嘉德采矿艇"
Locale_ship[1441] = "拥有优秀收集能力的埃赫洛斯嘉德采矿艇，同时还可以高效率修复船体"
Locale_ship[1442] = "买了这艘特殊的埃赫洛斯嘉德采矿艇之后,我感觉自己整个人都变得萌萌哒！"
Locale_ship[1450] = "希格拉离子炮护卫舰"
Locale_ship[1451] = "希格拉人的一种主力反主力武器，可以轻松的摧毁敌人的巡洋舰和驱逐舰。"
Locale_ship[1460] = "菲雅利帝国防空驱逐舰"
Locale_ship[1461] = "一种制式防空驱逐舰，可以用来有效的清除敌人的战斗机和炮艇。"
Locale_ship[1470] = "希格拉权杖级巡洋舰"
Locale_ship[1471] = "希格拉的新锐中坚力量，可以有效的对付护卫舰和驱逐舰"
Locale_ship[1480] = "埃赫洛斯嘉德撕裂者巡洋舰"
Locale_ship[1481] = "一种可以高效率清除小型战舰的埃赫洛斯嘉德战舰"
Locale_ship[1490] = "红莲级攻城巡洋舰"
Locale_ship[1491] = "装备了红莲级超重型导弹的攻城巡洋舰，专门用来摧毁敌人的大型旗舰和建筑的太空建筑"
Locale_ship[1500] = "方阵级电磁炮巡洋舰"
Locale_ship[1501] = "装备了电磁轨道炮的大型巡洋舰，专门用来压制敌人的大型旗舰的进攻"
Locale_ship[1510] = "埃赫洛斯嘉德狙击舰"
Locale_ship[1511] = "强大的旗舰杀手，只要足够数量的埃赫洛斯嘉德狙击舰出现在战场上就意味着敌人大型旗舰的灾难"
Locale_ship[1520] = "拉格纳的混小子"
Locale_ship[1521] = "一艘特种战舰，拥有极高的速度和不错的战斗力和不小的货舱"
Locale_ship[1530] = "远行者级货运舰"
Locale_ship[1531] = "体形庞大拥有坚固装甲的巨型货舰，它是菲雅利帝国太空运输力量的主力。"
Locale_ship[1540] = "隼风级高速装甲舰"
Locale_ship[1541] = "一种战列巡洋舰大小的高速装甲舰，拥有优秀的跳跃速度和常规航行的速度，同时还有良好的泛用性和经济成本。"
Locale_ship[1550] = "死亡之戟"
Locale_ship[1551] = "血刃级战列舰的特殊改型，拥有足够强大的战斗力，同时还有足够的货舱用来装载补给物资。"
Locale_ship[1560] = "浩劫级无畏舰"
Locale_ship[1561] = "专门为了突破敌人防线而设计的巨大钢铁怪兽，拥有不错的速度和坚固的装甲以及大容量货舱，缺乏反旗舰武器是最大的缺点"
Locale_ship[1570] = "龙枪舰载机"
Locale_ship[1571] = "帝国骑士团高阶骑士的座机，每一架都拥有逆天的战斗力"
Locale_ship[1580] = "依文洁琳号战列舰"
Locale_ship[1581] = "菲雅利帝国骑士团团长的座舰，拥有强大的攻防能力"
Locale_ship[1590] = "赛芙莉尔号要塞舰"
Locale_ship[1591] = "埃赫洛斯嘉德帝国的最强大战舰，据说一艘可以匹敌2艘以上的女皇号。"
Locale_ship[1600] = "马卡恩之怒2型"
Locale_ship[1601] = "更加强大的维格尔战争堡垒，拥有轻松毁灭一支舰队的实力"
--------------------------------------------



Locale_ship[1605] = "卡拉克驱逐舰"
Locale_ship[1606] = "拥有坚固装甲的驱逐舰，卡拉克人在回归卡拉克之后，一直在坚持使用这款老旧但是可靠的驱逐舰进行战斗"
Locale_ship[1610] = "卡拉克运载舰"
Locale_ship[1611] = "这种古老的运载舰拥有非常坚固的装甲，但是运载能力略有欠缺"
Locale_ship[1615] = "卡拉克重巡洋舰"
Locale_ship[1616] = "这种装甲坚固的巡洋舰一直在卡拉克舰队中扮演者中坚力量的角色"
Locale_ship[1620] = "放逐级战列舰"
Locale_ship[1621] = "装备了多联装光子脉冲炮的重甲战列舰，拥有持久的作战能力"

Locale_ship[1620] = "放逐级战列舰"
Locale_ship[1621] = "装备了多联装光子脉冲炮的重甲战列舰，拥有持久的作战能力"

Locale_ship[1622] = "流浪号战列舰"
Locale_ship[1623] = "放逐级的二号舰，拥有多门电磁轨道炮，强大的火力代价是脆弱的防御和较差的续航"

Locale_ship[1625] = "壁垒级无畏舰"
Locale_ship[1626] = "移动的战争堡垒，宽大的储备空间可以支持长时间的巡航作战"



Locale_ship[1630] = "泰坦驱逐舰"
Locale_ship[1631] = "这种老式驱逐舰拥有可靠的性能，可以胜任大部分战斗"

Locale_ship[1635] = "泰坦航母"
Locale_ship[1636] = "这种航母在泰坦舰队中服役多年，拥有较大的载机量和较高的航速"

Locale_ship[1640] = "泰坦重巡洋舰"
Locale_ship[1641] = "曾经称霸银河的一种古老战舰，现在依然在泰坦舰队中扮演主力舰的角色"

Locale_ship[1645] = "帕拉丁级战列舰"
Locale_ship[1646] = "泰坦人最新开发的战列舰，拥有多门离子束炮塔，成本较低，航速较快"
Locale_ship[1649] = "猎兵级袭击舰"
Locale_ship[1650] = "猎兵级袭击舰民用型"
Locale_ship[1651] = "菲雅利军方新型袭击舰的民用型，航速较快，货仓空间较大，可以胜任探险，战斗等多种任务"

Locale_ship[1652] = "猎兵级袭击舰军用型"
Locale_ship[1653] = "战斗力强悍的军用型SR6猎兵级袭击舰，让它在战斗力上可以和战列巡洋舰匹敌，但是载货能力有所减小，"

Locale_ship[165202] = "猎兵级袭击舰指挥型"
Locale_ship[165302] = "战斗力强悍的指挥型SR6猎兵级袭击舰（看我眼色行事），在战斗力上可以和战列巡洋舰匹敌，但是载货能力有所减小，"




Locale_ship[1655] = "卡拉克重炮艇"
Locale_ship[1656] = "拥有厚重装甲的重型炮艇，可以在战斗中长时间生存。，"

Locale_ship[1660] = "泰坦重炮艇"
Locale_ship[1661] = "拥有强悍火力的重型炮艇，可以高效率的歼灭敌人的空中单位。，"



Locale_ship[1665] = "卡拉克护航机"
Locale_ship[1666] = "拥有厚重装甲的护航机，可以在大型舰船周围高效率的歼灭敌人空中单位"


Locale_ship[1670] = "图拉尼运载舰"
Locale_ship[1671] = "这种专门改装的海盗运载舰拥有巡洋舰的火力和航母的载机能力，和图拉尼人关系匪浅的泰坦人也会出售这种战舰"

Locale_ship[1675] = "俘获的卡德什云母"
Locale_ship[1676] = "一种拥有强大载机能力和光束主炮的巨大母舰，卡拉克人将其俘获后公开出售以换取资源和物资"



--------------------------------------------
Locale_ship[1685] = "SV51超级舰载机"  --125
Locale_ship[1686] = "一种超先进的战斗机，它的设计方是一个迷"
Locale_ship[1695] = "VF25超级战斗机"  --126
Locale_ship[1696] = "拥有强大性能的综合型战斗机"
Locale_ship[1705] = "骏骑号渗透护卫舰"  --127
Locale_ship[1706] = "装备了4座小口径速射炮和离子光束的高速护卫舰"
Locale_ship[1715] = "破晓3型战列舰"  --128
Locale_ship[1716] = "装备有2座四联装电磁轨道炮的先进战列舰"
Locale_ship[1725] = "雷灵号战列舰"  --129
Locale_ship[1726] = "雷霆骑士御版御版的座舰"

Locale_ship[1735] = "索托亚级超级装甲航母"  --130
Locale_ship[1736] = "拥有超大舰载机容量的巨型装甲航母，坚固的装甲可以抵挡一切攻击，机库容量：150队"
Locale_ship[1745] = "精英型索托亚级超级装甲航母"  --131
Locale_ship[1746] = "装备了8座电磁轨道炮和更强大装甲的索托亚超级航母，机库容量：150队"
Locale_ship[1755] = "劫火级袭击舰"  --132
Locale_ship[1756] = "由第三代阔刃级战列巡洋舰改良来的先进袭击舰，拥有厚重的装甲和紧凑的体型"
Locale_ship[1765] = "阔刃3装甲型"  --133
Locale_ship[1766] = "阔刃3级战列巡洋舰改良来的装甲舰，拥有厚重的顶部装甲和反旗舰光束"
Locale_ship[1775] = "阔刃3型战列巡洋舰"  --134
Locale_ship[1776] = "第三代的阔刃级战列巡洋舰，拥有更大的体型和更稳定的战斗力"
--------------
Locale_ship[1785] = "星尘级驱逐舰"  --135
Locale_ship[1786] = "拥有可怕防空能力的先进驱逐舰，强大的防空弹幕可以轻松扫荡一切战斗机和小型战舰"
Locale_ship[1795] = "星尘级驱逐舰防空型"  --136
Locale_ship[1796] = "装备了更多57毫米防空弹幕的防空型星尘级驱逐舰"
Locale_ship[1805] = "虚空级无畏舰"  --137
Locale_ship[1806] = "拥有8座双联装3500巨炮的大型无畏舰，可怕的3500毫米巨炮弹幕可以摧毁一切对手"
Locale_ship[1815] = "虚空级无畏舰精英型"  --138
Locale_ship[1816] = "精英型的虚空级无畏舰，拥有更坚固的装甲可以抵御攻击"
Locale_ship[1825] = "暗夜女神级无畏舰"  --139
Locale_ship[1826] = "多方势力联合出资制造的一艘先进无畏舰，拥有全方位的战斗力"

Locale_ship[1835] = "光辉女神级无畏舰"  --140
Locale_ship[1836] = "暗夜女神级无畏舰由帝国军方专门改造的特殊改进型，拥有更强大的战斗力"
Locale_ship[1845] = "黑猫级工程舰"  --141
Locale_ship[1846] = "拥有先进远程修理能力的战列巡洋舰级工程舰"
Locale_ship[1855] = "雷鸣级狙击舰"  --142
Locale_ship[1856] = "护卫舰级的光束狙击舰，可以有效的反制对方的大型旗舰"
Locale_ship[1865] = "永恒2级战争堡垒"  --143
Locale_ship[1866] = "第一代永恒级无畏舰的扩大强化版，拥有更强大的生存力和更厚重的装甲"
Locale_ship[1875] = "圣域号战争堡垒"  --144
Locale_ship[1876] = "蚁巢舰队特有的精英战争堡垒，拥有更厚重的装甲来抵挡攻击"

--------------
Locale_ship[1885] = "审判庭号战争堡垒"  --145
Locale_ship[1886] = "永恒2战争堡垒的特殊改进型之一，拥有更强大的装甲和扛打击力"
Locale_ship[1895] = "女皇之锤"  --146
Locale_ship[1896] = "永恒2级战争堡垒的改进型，超级光束主炮被替换成一门威力超强的5300加农炮"
Locale_ship[1905] = "第三代女皇级战争堡垒"  --147
Locale_ship[1906] = "重新翻新过的第三代女皇级战争堡垒，虽然设计已经过时，但是依然拥有不可小视的战斗力"
Locale_ship[1915] = "莎拉-达尔克号"  --148
Locale_ship[1916] = "特殊改进的第三代女皇级战争堡垒，以某位帝国高级指挥官爱妻的名字命名"
Locale_ship[1925] = "克蕾雅-达尔克号"  --149克蕾雅-达尔克号
Locale_ship[1926] = "特殊改进的第三代女皇级战争堡垒，以某位帝国高级指挥官爱妻的名字命名"

Locale_ship[1935] = "朝圣者级超级航母"  --150
Locale_ship[1936] = "朝圣者旅团的超级母舰，搭载了先进的造物兵器"
Locale_ship[1945] = "第三代马卡恩之怒巨舰"  --151
Locale_ship[1946] = "维格尔人最新一代的战争堡垒，拥有最强大的战斗力"
Locale_ship[1955] = "雷霆舰载机"  --152
Locale_ship[1956] = "御版御版骑士的超级舰载机，拥有强大的机载反旗舰电磁主炮"
Locale_ship[1965] = "光晕超级舰载机"  --153
Locale_ship[1966] = "光晕骑士的超级舰载机，强大的浮游炮群可以战胜一切对手"
Locale_ship[1975] = "审判之剑号超级舰载机"  --154
Locale_ship[1976] = "光晕舰载机的特殊改进型，专门为帝国审判长准备"


--------------
Locale_ship[1985] = "超级舰载机圣裁"  --155
Locale_ship[1986] = "拥有先进穿甲主炮的超级舰载机，厚重的装甲可以抵御各种伤害"
Locale_ship[1995] = "裁决舰载机"  --156
Locale_ship[1996] = "圣裁舰载机的量产版，用来替换老旧的龙鹰舰载机"
Locale_ship[2005] = "飞龙超重型轰炸机"  --157
Locale_ship[2006] = "装备了超重型反旗舰飞弹的超重型轰炸机，一次投射后需要返航装填"
Locale_ship[2015] = "终焉之棘超级战斗机"  --158
Locale_ship[2016] = "拥有超级光束主炮和超级机炮的超重型战斗机"
Locale_ship[2025] = "摆渡人重型轰炸机"  --159
Locale_ship[2026] = "装备有数咩重型反旗舰导弹的重型轰炸机，可以轻松摧毁对方的旗舰"

Locale_ship[2035] = "殉道者战斗机"  --160
Locale_ship[2036] = "朝圣者旅团的最基础舰载机单位，依靠数量压制敌人"
Locale_ship[2045] = "殉道者轰炸机"  --161
Locale_ship[2046] = "朝圣者旅团的最基础舰载轰炸机单位，依靠数量压制敌人"
Locale_ship[2055] = "太空民用汽车01"  --162
Locale_ship[2056] = "一种最基础的民用汽车，帝国平民日常交通所使用。"
Locale_ship[2065] = "太空民用汽车02"  --163
Locale_ship[2066] = "一种最基础的民用汽车，帝国平民日常交通所使用。"
Locale_ship[2075] = "太空民用卡车01"  --164
Locale_ship[2076] = "拥有基础运载能力的民用卡车"

--------------
Locale_ship[2085] = "太空民用卡车02"  --165
Locale_ship[2086] = "拥有基础运载能力的民用卡车"
Locale_ship[2095] = "民用采矿驳船"  --166
Locale_ship[2096] = "拥有较强运载能力的大型采矿驳船，是民用货运船只中的主力"
Locale_ship[2105] = "第六代女皇级A型"  --167
Locale_ship[2106] = "最新一代的女皇级，装备了9座3联装4800巨炮的超级巨舰，拥有可怕的战斗力"
Locale_ship[2115] = "第六代女皇级B型"  --168
Locale_ship[2116] = "最新一代的女皇级，装备了9座3联装旗舰级光束主炮，拥有可怕的战斗力"
Locale_ship[2125] = "第六代女皇级C型"  --169
Locale_ship[2126] = "最新一代的女皇级，装备了5座3联装4800巨炮和超重型穹甲的超级巨舰，拥有可怕的战斗力和防御力"

Locale_ship[2135] = "长矛轰炸机"  --170
Locale_ship[2136] = "装备了两颗反旗舰飞弹的重型轰炸机，拥有克制对方旗舰的能力"
Locale_ship[2145] = "长矛攻击机"  --171
Locale_ship[2146] = "装备了两座反主力舰导弹发射阵列的重型攻击机，拥有克制对方主力舰的能力"
Locale_ship[2155] = "长矛截击机"  --172
Locale_ship[2156] = "装备了两座重型机炮的重型截击机，可以确保帝国舰队的制空权"





Locale_ship[10000] = "基本型"

Locale_ship[10005] = "防空型"
Locale_ship[10010] = "工程型"
Locale_ship[10011] = "拥有修理能力的工程型改造型"

Locale_ship[10209] = "亚特兰大防空加强型"
Locale_ship[10210] = "亚特兰大级的防空改装型，拥有大量防空炮塔，可以高效率的驱逐敌人的空中单位"
Locale_ship[10211] = "亚特兰大光线型"
Locale_ship[10212] = "亚特兰大级的反舰强化型，拥有大量的离子炮塔，拥有强大的攻击力"


Locale_ship[10251] = "收割者级巡洋舰"
Locale_ship[10252] = "扫荡者级巡洋舰的升级版，拥有强大的攻击力和防御力，扫射光束可以轻松摧毁所有级别的中小型战舰"




Locale_ship[10301] = "狼牙级战列舰"
Locale_ship[10302] = "图拉尼人在泰坦战列舰基础上开发来的改进型，和泰坦战列舰相比，它拥有更加宽大的货仓和更高的航速，但是生存力大大降低"


Locale_ship[10351] = "导弹型"
Locale_ship[10352] = "在标准驱逐舰船体上加装了大量的导弹发射阵列，可以同时发射大量导弹"


Locale_ship[10401] = "弥离级导弹型"
Locale_ship[10402] = "在弥离级船体两侧加装了大型导弹发射阵列，可以在战斗中进行有效的火力支援"

Locale_ship[10405] = "弥离级光线型"
Locale_ship[10406] = "在弥离级船体两侧加装了大型离子炮发射阵列，可以在战斗中进行有效的火力支援"

Locale_ship[10410] = "弥离级轰炸型"
Locale_ship[10411] = "在弥离级船体两侧加装了大型的特殊的格纳库，可以在战斗中释放渡鸦轰炸机进行战术支援"

Locale_ship[10420] = "裂痕级战列舰"
Locale_ship[10421] = "曙光级战列舰的后续继承者，拥有更加坚固的装甲和更加可靠的战斗力。是任何商会中期最可靠的选择"

Locale_ship[10430] = "裂痕级战列舰C型"
Locale_ship[10431] = "换装了4座三联装电磁炮的；裂痕级战列舰，拥有强大的反旗舰能力。"

Locale_ship[10440] = "裂痕扫荡者级战列舰"
Locale_ship[10441] = "将裂痕级和扫荡者级合二为一后的产物，拥有两种旗舰都有的优点。"

Locale_ship[10450] = "帝国意志级战列舰"
Locale_ship[10451] = "装备了大量先进电磁炮的强大战列舰，拥有坚固的装甲和较高的航速和极其豪华的内部设备，不过造价非常高昂，据说定制该舰的里斯妃特商会因为其高昂的造价几乎破产，商会千金都卖身为奴。"

Locale_ship[10460] = "月环级破袭舰"
Locale_ship[10461] = "一种战列舰级别的强大战舰（由幻天破绘制），拥有宽大的货仓和较高的航速，其装备的4门高能离子加农炮可以有效对抗同级单位"

Locale_ship[10465] = "月环级破袭舰-痛"
Locale_ship[10466] = "拥有特殊涂装的月环级破袭舰，虽然说性能上和原型相比没有太大的不同，但是由于其特别的造型让它非常难以购买到"


Locale_ship[10470] = "月轮级突击炮艇"
Locale_ship[10471] = "一种装备了全向射界环形轨道武器的先进突击炮艇（由幻天破绘制），可以有效拦截地方的空中单位"

Locale_ship[10480] = "破晓级战列舰"
Locale_ship[10481] = "非常古老的一款战列舰，其历史可以追述到200年前帝国刚刚进入M51银河系时期。在一些民间和军方爱好者的强烈要求下，菲雅利军方将封存的少量破晓级启封出售"


Locale_ship[10490] = "亚菲丽丝号"
Locale_ship[10491] = "据说是菲雅利女皇的座舰，拥有全银河系最强大的性能和战斗力。只要98亿8千万8888888，你就可以把妖精女皇抱回家"
Locale_ship[10500] = "帝国号移动要塞"
Locale_ship[10501] = "菲雅利帝国最强大的移动战争堡垒，战场上几乎无法匹敌，然而移动缓慢是巨大的缺点"

Locale_ship[10510] = "前进者级护卫舰"
Locale_ship[10511] = "装备了通用炮塔的先进护卫舰，拥有出色的防御能力"
Locale_ship[10512] = "突击型"
Locale_ship[10513] = "装备了两座175毫米通用炮塔，可以有效的执行反护卫舰任务"
Locale_ship[10514] = "防空型"
Locale_ship[10515] = "装备了两座四联装75毫米防空炮塔，可以有效的执行防空任务"
Locale_ship[10516] = "离子炮型"
Locale_ship[10517] = "装备了两座离子炮塔，可以有效的执行反主力舰任务"
Locale_ship[10518] = "支援型"
Locale_ship[10519] = "装备了一座425毫米加农炮塔，可以有效的远程火力支援任务"

Locale_ship[10550] = "民用采矿艇"
Locale_ship[10551] = "帝国民间使用的小型采矿艇，体积小巧但是能力有限"

-------------------------------------战斗机
Locale_ship[11000] = "弯刀战斗机"
Locale_ship[11001] = "装备了57毫米机炮的量产型舰载机，在各种场合都有很好的范用性"
Locale_ship[11010] = "战斗攻击型"
Locale_ship[11011] = "装备了57毫米机炮和防空导弹的量产型舰载机，可以有效反艇"
Locale_ship[11020] = "轰炸型"
Locale_ship[11021] = "装备了反舰导弹发射架的量产型战斗机，可以依靠数量优势对地方空中单位造成巨大威胁"
Locale_ship[11025] = "核弹型"
Locale_ship[11026] = "装备了核导弹的渡鸦轰炸机，可以有效的进行范围杀伤"
Locale_ship[11030] = "龙鹰轰炸机"
Locale_ship[11031] = "精锐的反舰攻击单位，拥有横扫一支舰队的实力"
Locale_ship[11040] = "飞龙攻击机"
Locale_ship[11041] = "装备了反主力舰鱼雷的攻击型单位，拥有长航程。装备了两座双联装37毫米机炮塔可以有效对方敌人的空中单位"

Locale_Text[11045] = "破刃级重型拦截机"   --192
Locale_Text[11046] = "装备速射机炮，可以有效消灭敌人空中单位"
Locale_Text[11050] = "破刃级重型攻击机"    --193
Locale_Text[11051] = "装备先进破甲飞弹，可以有效消灭敌人巡洋舰单位"

Locale_Text[11055] = "破刃级重型拦截机零式"   --194
Locale_Text[11056] = "装备速射机炮，可以有效消灭敌人空中单位"
Locale_Text[11060] = "破刃级重型攻击机零式"    --195
Locale_Text[11061] = "装备先进破甲飞弹，可以有效消灭敌人巡洋舰单位"


Locale_Text[11075] = "猎星者舰载机"   --201
Locale_Text[11076] = "装备了紫晶导弹和速射机炮的重型舰载攻击机"
Locale_Text[11080] = "猎星者舰载机空优型"    --202
Locale_Text[11081] = "装备了速射机炮和先进防空导弹的重型舰载拦截机"

Locale_Text[11090] = "豪华跑车"    --205-208
Locale_Text[11091] = "体积小巧的民用车辆，虽然工艺精湛，但是在太空贸易和战斗中毫无用处"

Locale_Text[11100] = "流星舰载机"    --210
Locale_Text[11101] = "卡厄斯联盟的一种制式空优舰载机"

Locale_Text[11110] = "流星舰载机-改"    --211
Locale_Text[11111] = "流星舰载机的改装型，装备了6颗石英反舰导弹"

Locale_Text[11120] = "流星舰载机-改二"    --212
Locale_Text[11121] = "流星舰载机的精英改装型，装备了4颗紫晶反舰导弹，而且拥有更厚重的装甲"

Locale_Text[11130] = "集装箱卡车"    --213
Locale_Text[11131] = "一种小型卡车，用于运输集装箱"

Locale_Text[11140] = "集装箱托盘"    --214
Locale_Text[11141] = "一种带有引擎的集装箱托盘，可以运载多个集装箱进行物流"


Locale_Text[11150] = "太空巴士"    --232
Locale_Text[11151] = "太空大巴，主要用来运输大量的人员和平民"


Locale_Text[11160] = "太空汽车"    --233
Locale_Text[11161] = "单人的民用车辆，主要方便平民的自由出行"

Locale_Text[11170] = "太空卡车"    --234
Locale_Text[11171] = "太空卡车，主要用来运输数量较少的货物"

Locale_Text[11180] = "小型太空驳船"    --235
Locale_Text[11181] = "小型太空驳船，主要用来在太空城市附近运输大数量的货物"


Locale_Text[11190] = "太空驳船"    --236
Locale_Text[11191] = "太空驳船，主要用来运输大数量的货物，比如辅助大型星舰卸载货物"

Locale_Text[11200] = "战斗无人机-飞镖"    --248
Locale_Text[11201] = "一种量产型战斗无人机，主要依靠数量来制空"

Locale_Text[11210] = "轰炸无人机-飞镖"    --249
Locale_Text[11211] = "一种量产型轰炸无人机，依靠数量优势来快速消灭敌舰群"


Locale_Text[11220] = "超级战斗无人机-三叉戟"    --244
Locale_Text[11221] = "安装有自动机炮和大量武器的超级无人战斗机，拥有强大的战斗力"

Locale_Text[11230] = "超级战斗无人机-三叉戟蚁巢型"    --245
Locale_Text[11231] = "安装有自动机炮和大量武器的超级无人战斗机，拥有强大的战斗力"

Locale_Text[11240] = "超级战斗无人机-三叉戟阿因特斯型"    --246
Locale_Text[11241] = "安装有自动机炮和大量武器的超级无人战斗机，拥有强大的战斗力"

Locale_Text[11250] = "女武神级运输艇"    --247
Locale_Text[11251] = "一种低成本可以快速反应的小型运输艇，可以快速部署小规模地面部队"

Locale_Text[11260] = "信徒级舰载机-空优型"        --258
Locale_Text[11261] = "希格拉最新开发的拦截机，拥有坚固的装甲和不弱的性能"

Locale_Text[11270] = "信徒级舰载机-轰炸型"        --259
Locale_Text[11271] = "信徒级舰载机的轰炸型，双管机炮被替换成了两座导弹发射器"

Locale_Text[11280] = "信徒级舰载机-侦察型"        --260
Locale_Text[11281] = "信徒级舰载机的侦察型，下方悬挂一个大型监视吊舱监视周围战场环境"

Locale_Text[11290] = "神甫级脉冲艇"        --261
Locale_Text[11291] = "最新开发的一种装甲脉冲艇，脉冲光线可以反战机也可以对抗炮艇"

Locale_Text[11300] = "神甫级导弹艇"        --262
Locale_Text[11301] = "装备了两座可快速装填的重型导弹发射器，可以有效对抗主力舰"

Locale_Text[11310] = "神甫级工程艇"        --263
Locale_Text[11311] = "可以开采资源也可以用维修激光修复战舰"

Locale_Text[11320] = "雷鸟超级战略轰炸机"        --287
Locale_Text[11321] = "一种超重型的战略轰炸机，由于体型过大，只能在少量拥有特殊起降通道的战舰上停靠"

Locale_Text[11330] = "雷鸟超级预警机"        --288
Locale_Text[11331] = "一种搭载了先进探测设备的大型预警机，可以探测大范围外的敌人舰队动向，由于体型过大，只能在少量拥有特殊起降通道的战舰上停靠"

Locale_Text[11335] = "ASSC-152A夜莺"        --289
Locale_Text[11336] = "先进的战术攻击机，可以对敌人大型旗舰进行等离子炸弹轰炸"

Locale_Text[11340] = "ASSC-152B夜莺"        --290
Locale_Text[11341] = "先进的战术攻击机，可以对敌人大型旗舰进行等离子炸弹轰炸"

Locale_Text[11350] = "卡尔瓦罗亚"        --291
Locale_Text[11351] = "追忆之庭缩装备的夜莺改进型，可以对敌人大型旗舰进行等离子炸弹轰炸"


Locale_Text[11360] = "美杜莎精英战斗机"        --294
Locale_Text[11361] = "卡厄斯联盟专门开发的远程截击机，携带的远程对空导弹可以在远距离摧毁敌人机群"
Locale_Text[11370] = "美杜莎精英截击机-防空核弹型"        --295
Locale_Text[11371] = "卡厄斯联盟专门开发的远程截击机，携带的战术核弹可以在远距离摧毁敌人机群"
Locale_Text[11380] = "索尔加尔瓦"        --296
Locale_Text[11381] = "追忆之庭专门开发的一种特别型截击机，取消了导弹改为可以长时间战斗的光束武器"


Locale_Text[11390] = "方舟工程舰"        --327
Locale_Text[11391] = "阿因特斯舰队的通用工程舰，除了采集资源还可以承担轻量级维修任务。"
Locale_Text[11400] = "大君的挖煤船"        --328
Locale_Text[11401] = "莫尔迪基安大君舰队专用工程舰的...外贸版，跟大君舰队的型号似乎也没有什么不同。"

Locale_Text[11410] = "幻象IV游侠"        --162
Locale_Text[11411] = "可装备不同武装的阿因特斯决战型单兵单位；4号破城炮兵装专用于强击大型目标。"
Locale_Text[11420] = "幻象V啸月"        --163
Locale_Text[11421] = "可装备不同武装的阿因特斯决战型单兵单位；5号散剑兵装专用于高机动压制战斗。"

Locale_Text[11430] = "玄鸟级侦察机"        --355
Locale_Text[11431] = "通用小型侦察机，能在各种条件下应用。"




-------------------------------------护航艇
Locale_ship[11500] = "导弹型"
Locale_ship[11501] = "装备了防空导弹，可以有效对付各类轻装甲目标，包括战斗机和炮艇"
Locale_ship[11510] = "脉冲型"
Locale_ship[11511] = "装备了脉冲发射装置，可以有效对付炮艇和护卫舰"

Locale_ship[11520] = "解放者"
Locale_ship[11521] = "阿因特斯综合外域技术设计而成的超重型炮艇单位，拥有变形为重炮模式的掠袭形态。"

Locale_ship[11530] = "探索者"
Locale_ship[11531] = "这是一只萌萌哒OB，别打，怕疼，会爆。"


-------------------------------------护卫舰
Locale_ship[12000] = "绵羊级工程舰"
Locale_ship[12001] = "由绵羊级采矿船升级而来的工程舰，装备四联装长程修理光束"

Locale_ship[12005] = "尸鬼级重型突击舰"
Locale_ship[12006] = "先进的快速突击舰，可以胜任任何战况"
Locale_ship[12010] = "业火级导弹突击舰"
Locale_ship[12011] = "发射红宝石导弹进行战斗的支援型突击舰，可以对大型旗舰造成有效伤害"


Locale_ship[13075] = "小型莫尔迪基安贸易船"
Locale_ship[13076] = "一种小型的莫尔迪基安贸易船，和同类商船相比拥有较为坚固的船体"


Locale_ship[12020] = "金线团级贸易船"  --228
Locale_ship[12021] = "一种标准的联盟商船，护卫舰级的体积，可以在联盟任何地方见到"

Locale_ship[12030] = "西西弗斯级工程艇"  --231
Locale_ship[12031] = "联盟的通用工程艇，可以采矿和运输少量的货物，还可以进行工程维修"


Locale_Text[12040] = "卡奥斯级护卫舰-离子炮型"        --264
Locale_Text[12041] = "装备有一门离子炮，可以有效击毁主力舰"

Locale_Text[12050] = "卡奥斯级护卫舰-防空炮型"        --265
Locale_Text[12051] = "装备有防空炮，可以有防空和击落敌机"

Locale_Text[12060] = "卡奥斯级护卫舰-鱼雷型"        --266
Locale_Text[12061] = "装备有两座鱼雷发射器，可以有效击毁主力舰和中小型舰艇"

Locale_Text[12070] = "卡奥斯级护卫舰-突击型"        --267
Locale_Text[12071] = "装备有一门离子炮，可以有效击毁主力舰"

Locale_Text[12080] = "卡奥斯级护卫舰-支援型"        --268
Locale_Text[12081] = "装备有多门速射炮和电浆炮弹发射器，可以突破敌人舰队的防线"

Locale_Text[12090] = "卡奥斯级护卫舰-侦察型"        --269
Locale_Text[12091] = "装备有先进侦察设备，可以有效的侦察敌人舰队情况"

Locale_Text[12100] = "卡奥斯级护卫舰-治安型"        --270
Locale_Text[12101] = "一种治安舰，主要用来进行区域巡逻和维护治安"

Locale_Text[12110] = "卡奥斯级护卫舰-精英型"        --271
Locale_Text[12111] = "装备有多门速射炮，离子发射器和两座导弹发射装置，拥有强大的火力输出"

Locale_Text[12120] = "su33strigon精英战斗机"        --282
Locale_Text[12121] = "装备有各种武器可以有效反舰的精英战斗轰炸机"

Locale_Text[12130] = "xfa27精英战斗机"        --282
Locale_Text[12131] = "装备有各种武器可以有效制空的精英战斗机"

Locale_Text[12140] = "strigonEX吸血鬼超级战斗机"        --282
Locale_Text[12141] = "装备有各种武器可以进行强大火力输出的超级战斗机"

Locale_Text[12150] = "无人战斗机"        --282
Locale_Text[12151] = "可以有效制空的小型战斗机"


Locale_Text[12160] = "入侵者战斗机甲"        --304
Locale_Text[12161] = "一种18米高的战斗机甲，拥有优秀的制空能力"

Locale_Text[12170] = "入侵者战斗机甲-导弹武装"        --305
Locale_Text[12171] = "一种18米高的战斗机甲，装备一门加强型的反旗舰导弹发射器"

Locale_Text[12180] = "入侵者战斗机甲-脉冲炮武装"        --306
Locale_Text[12181] = "一种18米高的战斗机甲，装备一门加强型的脉冲炮发射器"


Locale_Text[12190] = "秃鹫级战术轰炸机"        --309
Locale_Text[12191] = "可以投掷1400炮弹的战术轰炸机，可以有效对抗主力舰"

Locale_Text[12200] = "魔毯级轰炸机"        --310
Locale_Text[12201] = "可以发射护卫舰导弹的轻型轰炸机，可以有压制敌人的护卫舰群"

Locale_Text[12210] = "入侵者战斗机甲-骑兵型"        --311
Locale_Text[12211] = "搭乘魔毯轰炸机的入侵者机甲，可以发射红宝石导弹压制敌人主力舰"

Locale_Text[12220] = "长枪战斗机MK2"        --312
Locale_Text[12221] = "搭乘魔毯轰炸机的入侵者机甲，可以发射红宝石导弹压制敌人主力舰"

Locale_Text[12230] = "长枪战斗机MK2镭射型"        --313
Locale_Text[12231] = "搭乘魔毯轰炸机的入侵者机甲，可以发射红宝石导弹压制敌人主力舰"


Locale_Text[12240] = "流星战斗机 改三"    --318
Locale_Text[12241] = "武备搭载模块经过改造的“流星”战斗机，可以搭载“神剑”重型空空导弹"


Locale_Text[12250] = "星雨级护卫舰"    --319
Locale_Text[12251] = "联盟的一种量产型护卫舰，拥有不错的经济性"

Locale_Text[12260] = "防空型"    --319
Locale_Text[12261] = "搭载了防空型模块，可以高效率防空"

Locale_Text[12270] = "反舰型"    --319
Locale_Text[12271] = "搭载了反舰导弹模块，可以有效攻击主力舰"

Locale_Text[12280] = "星尘级驱逐舰守护型"    --322
Locale_Text[12281] = "拥有更强火力的星尘级驱逐舰，可以有效对抗主力舰"

Locale_Text[12290] = "雷鸣级轨道炮G型"    --330
Locale_Text[12291] = "改装自菲雅利帝国的雷鸣级护卫舰，其最大的改动是终于实现了无人驾驶...可以换战损了"

Locale_Text[12300] = "巴伦安特级轨道炮"    --330
Locale_Text[12301] = "根据命运级伴随武器改造而来的巴伦安特级轨道炮，使用了人工智能替换梵玛控制模块。"


-------------------------------------主力舰
Locale_ship[13000] = "娜贝硫丝"   --娜贝硫丝菲米琳斯
Locale_ship[13001] = "娜贝琉斯级的衍生光线型，拥有不错的反旗舰能力"
Locale_ship[13010] = "防空型"
Locale_ship[13011] = "沙迦级装甲舰的防空型，用大量防空火炮来清除空域"

Locale_ship[13015] = "工程型"
Locale_ship[13016] = "弥璃级航母的工程型，装备了大量的修理光束发射器，可以高效率的修复受损的战舰"
Locale_ship[13020] = "大型轨道炮"
Locale_ship[13021] = "一种移动缓慢但是脆弱，但是威力强大射程极远的攻城武器"
Locale_ship[13030] = "导弹袭击舰"
Locale_ship[13031] = "装备大量反旗舰导弹的攻城主力舰，专门用来摧毁敌方旗舰和大型要塞（注意，该舰会消耗双倍的弹药）"
Locale_ship[13040] = "猎户座级高速运输舰"   --176
Locale_ship[13041] = "重装甲超高速的运输舰，可以运载大量商品高速穿越防线"
Locale_ship[13050] = "伊利亚级巡空舰"   --176
Locale_ship[13051] = "超精锐的一公里级驱逐舰，拥有可怕的战斗力和同样惊人的造价。"

Locale_ship[13060] = "加尔巴兰装甲袭击舰"   --181
Locale_ship[13061] = "高速重装甲和适当的火力的完美结合，这艘战舰可以胜任大部分的中低端战斗任务"

Locale_ship[13065] = "闪光之刃级战列巡洋舰"   --198
Locale_ship[13066] = "拥有超级激光束主炮的战列巡洋舰，可以有效的进行后排的支援"

Locale_ship[13070] = "旧日支配者"   --199
Locale_ship[13071] = "刚达尼姆级超级战斗机-拥有强大的战斗性能压制所有单位"



Locale_ship[13080] = "俱乐部级战列巡洋舰"   --203
Locale_ship[13081] = "由豪华游艇改装来的战列巡洋舰，拥有极为坚固的外壳装甲，10联装火箭炮可以提供一定的火力"

Locale_ship[13090] = "俱乐部级豪华游轮"   --204
Locale_ship[13091] = "有俱乐部土豪专门定制的豪华游轮，自带有模拟生态园林系统和各种娱乐设施，还有一个大型车库可以停靠车辆"

Locale_ship[13095] = "帝国新闻总署号"   --204
Locale_ship[13096] = "帝国第一记者旭日的专属座舰，拥有惊人的航速和大量的新闻设备"

Locale_ship[13100] = "攻城导弹发射平台-赫墨拉"   --215
Locale_ship[13101] = "一种装备了超远程苍兰导弹的轨道发射平台，可以远距离进行火力支援"

Locale_ship[13100] = "攻城导弹发射平台-赫墨拉"   --215
Locale_ship[13101] = "一种装备了超远程苍兰导弹的轨道发射平台，可以远距离进行火力支援"

Locale_ship[13110] = "阿塔兰忒级重型驱逐舰"   --217
Locale_ship[13111] = "卡厄斯联盟的标准主力舰，装备220毫米主炮，拥有多种改型"

Locale_ship[13120] = "阿塔兰忒级-希尔芬防空型"   --218
Locale_ship[13121] = "阿塔兰忒级重型驱逐舰的特殊改造型，和希尔芬联合开发，拥有先进的防空武器系统"

Locale_ship[13130] = "阿塔兰忒级重型驱逐舰-蔷薇型"   --219
Locale_ship[13131] = "阿塔兰忒级重型驱逐舰的特殊改造型，其紫晶导弹发射阵列被替换成了远程的蔷薇巡航导弹发射架，拥有优秀的反旗舰能力"

Locale_ship[13140] = "阿塔兰忒级重型驱逐舰-特装型"   --220
Locale_ship[13141] = "阿塔兰忒级重型驱逐舰的特精英型，拥有更厚重的装甲和更强大的防空火力"

Locale_ship[13150] = "阿塔兰忒级重型驱逐舰-电浆型"   --221
Locale_ship[13151] = "阿塔兰忒级重型驱逐舰的防空优化型，用先进的电浆防空炮替换了220毫米主炮"

Locale_ship[13160] = "阿塔兰忒级重型驱逐舰-工程型"   --222
Locale_ship[13161] = "阿塔兰忒级重型驱逐舰的工程改造型，取消了所有武器并把船头主炮替换成了一套修理光束发射系统"

Locale_ship[13170] = "阿塔兰忒级重型驱逐舰-EDF外贸型"   --223
Locale_ship[13171] = "阿塔兰忒级重型驱逐舰的EDF外贸型，专门针对订购方EDF进行了一系列的改造和调整，比如使用菲雅利帝国通用的通用武器系统已经专门设计了先进主炮等等"


Locale_ship[13175] = "阿切洛特级巨型工程船坞舰"   --224
Locale_ship[13176] = "巨大的船坞型星舰，拥有强大的舰队维修能力，还可以释放大量的小型工程舰维修整个舰队"

Locale_ship[13185] = "大力神级集装箱运输舰"   --227
Locale_ship[13186] = "超大型的集装箱运输舰，可以运输海量的物资，只是结构比较脆弱，需要更多的防御和保护。"


Locale_ship[13190] = "玉门级超大型码头舰"   --230
Locale_ship[13191] = "巨型的码头舰，用来快速的装卸物资，它本身也有少量空间作为中转用"

Locale_ship[13200] = "星门投射装置"   --239
Locale_ship[13201] = "超级星门都市的能量投射装置，可以跨空间投射大量能量摧毁敌舰"

Locale_ship[13210] = "圣盾级驱逐舰"   --250
Locale_ship[13211] = "一种重装甲驱逐舰，拥有厚重的装甲"

Locale_ship[13220] = "圣盾级驱逐舰幽灵舰队型"   --251
Locale_ship[13221] = "更先进的圣盾驱逐舰，拥有更坚固的充能防御装甲和苍白妖精导弹系统"

Locale_ship[13230] = "陌刀级驱逐舰"   --252
Locale_ship[13231] = "一种经典的量产型驱逐舰，拥有极高的性价比。"

Locale_ship[13240] = "陌刀级驱逐舰防空型"   --253
Locale_ship[13241] = "陌刀级驱逐舰的防空型，装备有大量防空武器"

Locale_ship[13250] = "陌刀级驱逐舰-芙兰卡号"   --254
Locale_ship[13251] = "一艘特殊型的陌刀级驱逐舰"

Locale_Text[13260] = "斯卡法汝级驱逐舰"        --
Locale_Text[13261] = "装备有多种武器，可以灵活的应对各种中小型目标，也可以对抗主力舰"

Locale_Text[13270] = "斯卡法汝级驱逐舰-防空型"        --
Locale_Text[13271] = "装备有大量防空武器，可以有效的压制空域"

Locale_Text[13280] = "斯卡法汝级驱逐舰-狙击型"        --
Locale_Text[13281] = "装备有一门远程旗舰级离子束发射器，可以有效的攻击对方旗舰"

Locale_Text[13290] = "斯卡法汝级驱逐舰-突击型"        --
Locale_Text[13291] = "装备有多座重炮和鱼雷发射器，可以有效突入敌人舰队阵列"


Locale_Text[13300] = "斯卡法汝级驱逐舰-支援型"        --
Locale_Text[13301] = "装备一门大型修理光束发生器，可以有效的进行远距离修理"


Locale_Text[13310] = "斯卡法汝级驱逐舰-精英型"        --
Locale_Text[13311] = "装备有多种武器，拥有不亚于巡洋舰的战斗力"

Locale_Text[13310] = "斯卡法汝级驱逐舰-精英型"        --
Locale_Text[13311] = "装备有多种武器，拥有不亚于巡洋舰的战斗力"

Locale_Text[13320] = "海姆道尔级战列巡洋舰"   --272
Locale_Text[13321] = "艾洛斯最新研发的一种战列巡洋舰，拥有战列舰级的主炮和大量大口径主炮"

Locale_Text[13330] = "厄尔尼诺级战列巡洋舰"   --273
Locale_Text[13331] = "艾洛斯和卡厄斯联合研发的一种战列巡洋舰，拥有战列舰级的主炮和大量大口径主炮"

Locale_Text[13340] = "巡回者光束版"   --286
Locale_Text[13341] = "巡回者袭击舰的改良型，将电磁炮和实弹炮替换成了全套的离子加农炮发射器"

Locale_Text[13350] = "三叶级运输船"   --297
Locale_Text[13351] = "一种特殊的实验型运输船，用来验证光动力帆大规模安装在星舰上的可能性"

Locale_Text[13360] = "卓越级袭击舰"   --300
Locale_Text[13361] = "一艘特殊的导弹袭击舰，拥有合理的防御结构和足够的导弹威力"

Locale_Text[13370] = "米诺陶斯级防空巡洋舰"   --314
Locale_Text[13371] = "优秀的先进防空巡洋舰，拥有非常出色的防空能力"

Locale_Text[13380] = "吞星者级重型精炼船"   --315
Locale_Text[13381] = "超大型的资源精炼船，可以在最短时间内搜刮光一片小行星带"

Locale_Text[13390] = "美因茨级特遣舰"   --7
Locale_Text[13391] = "服役于（代理人）组织的型号，其内部经过了特殊改装"

Locale_Text[13400] = "突袭者级轻型战术舰基础型"   --6
Locale_Text[13401] = "海里米尔服役的新一代轻型战术舰"

Locale_Text[13420] = "突袭者级轻型战术舰海军型"   --8
Locale_Text[13421] = "服役于海军的突袭者型号，其装备适应海军要求进行了改进"

Locale_Text[13410] = "突袭者级轻型战术舰暗区型"   --9
Locale_Text[13411] = "服役于暗区的突袭者型号，其装备适应暗区环境经过了特化"

Locale_Text[13430] = "精英型远行者级战列舰"   --323
Locale_Text[13431] = "进行大规模强化改造的远行者级战列舰，拥有超过量产战列舰的性价比"

Locale_Text[13450] = "费纳尼亚级MK4型巡洋舰"   --329
Locale_Text[13451] = "一种造价低廉的通用型巡洋舰，经过了数代升级，可以轻松大量生产"

Locale_Text[13460] = "掠夺者级重型巡洋舰"   --338
Locale_Text[13461] = "帝国最新开发的重型巡洋舰，可以快速大量生产，拥有可靠的防御力"

Locale_Text[13470] = "侵略者级导弹攻城舰"   --339
Locale_Text[13471] = "一种造价低廉的导弹攻城舰，发射超重型反舰导弹来摧毁敌人旗舰"

Locale_Text[13480] = "毁灭者导弹袭击舰"   --340
Locale_Text[13481] = "一种特殊的战舰，据说来自一些帝国非官方势力的秘密改造"

Locale_Text[13490] = "安吉丽娜级袖珍战列舰"   --113
Locale_Text[13491] = "一款最新开发的以火力支援为主的大型主力舰"

Locale_Text[13500] = "阳帆级护卫战巡"   --354
Locale_Text[13501] = "搭载能量武器的大型护卫舰艇，配属到M51以进行适应性验证。"



-------------------------------------旗舰
Locale_ship[15000] = "第四代女皇级"
Locale_ship[15001] = "强大的战争方舟，为了抗衡数量庞大的维格尔巨舰而建造。虽然性能上较第三代女皇级有所下降，但是依然是强大的战争堡垒"
Locale_ship[15010] = "精英型"
Locale_ship[15011] = "精英型的第四代女皇级，拥有不输于第三代女皇级的战斗力"
Locale_ship[15015] = "精英型奥丁无畏舰"
Locale_ship[15016] = "精英型的奥丁无畏舰，拥有强大的攻防能力，可以对抗马卡恩之怒这样的巨舰"
Locale_ship[15020] = "重锤轮回"
Locale_ship[15021] = "搭载了8门5300巨炮，拥有可怕的攻坚能力，可以摧毁任何重型战舰"
Locale_ship[15025] = "极光轮回"
Locale_ship[15026] = "轮回级无畏舰的简化版，搭载了8门频射离子加农巨炮，拥有强大的持续输出能力"

Locale_ship[15100] = "塔尔洛斯级战列舰"
Locale_ship[15101] = "埃赫洛斯嘉德帝国的主力战列舰，拥有强大的攻防实力和昂贵的价格"
Locale_ship[15105] = "火炮版"
Locale_ship[15106] = "搭载了1200巨炮，拥有出色的反主力舰能力和反旗舰能力"
Locale_ship[15110] = "光束版"
Locale_ship[15111] = "搭载了巨型离子炮巨炮，拥有出色的反旗舰能力"

Locale_ship[15150] = "永恒扫荡者"
Locale_ship[15151] = "一艘经过特殊化改装的永恒级无畏舰"

Locale_ship[15155] = "埃赫洛斯嘉德超级工业舰"
Locale_ship[15156] = "埃赫洛斯嘉德人在太空中生产物资军备的巨型星舰，拥有一定的载机能力，但是体积庞大"

Locale_ship[15160] = "巨蟹座级无畏舰"
Locale_ship[15161] = "泰坦最新开发的强大战争平台，拥有可怕的攻防火力和射程，可以应付最残酷的战况"

Locale_ship[15170] = "角宿一级精英战列舰电磁炮型"--173
Locale_ship[15171] = "艾库丽斯人和帝国联合开发的一种高速型的新锐电磁炮战列舰，拥有出色的火力和超高的航速"
Locale_ship[15180] = "角宿一级精英战列舰光束型"  --174
Locale_ship[15181] = "艾库丽斯人和帝国联合开发的一种高速型的新锐光束战列舰，拥有出色的火力和超高的航速"
Locale_ship[15190] = "艾库丽斯公主级战列舰"   --175
Locale_ship[15191] = "菲雅利帝国和艾库丽斯人联合开发角宿1型战列舰时的衍生产品：装备了帝国武器和装备的外贸战列舰\n被称呼为公主级是因为有三公主这个绰号"

Locale_ship[15200] = "克雷莫尔级战列舰"   --179
Locale_ship[15201] = "希格拉人和一个名为希尔芬的菲雅利民间商会合作开发的一种新型战列舰"
Locale_ship[15210] = "双马尾骑士号战列舰"   --180
Locale_ship[15211] = "希尔芬某部门长武喵的座舰,作为希格拉虚拟偶像的粉丝骑士团而作了特殊涂装"


Locale_ship[15215] = "第六代帝国女皇级天罚型"   --182
Locale_ship[15216] = "进行最终改造的光束型女皇级，搭载了超强力的9座双联装超级旗舰级光束发射器。"


Locale_ship[15220] = "莫尔迪基安大君级摧星巨舰"   --191
Locale_ship[15221] = "装备了超级激光阵列主炮的超级巨舰。"


Locale_ship[15225] = "莫尔迪基安大君型"   --151
Locale_ship[15226] = "升级了舰载主炮让其拥有反摧星能力的特殊改型"

Locale_ship[15230] = "厄瑞玻斯级特装战列舰"   --216
Locale_ship[15231] = "一种集合了各种强大设备的先进战列舰，拥有极为强大的综合战斗力"



Locale_ship[15245] = "阿芙乐尔级超级武库舰"   --225
Locale_ship[15246] = "货舰改装来的超级战舰,拥有强大的远程投送火力和密集的导弹阵列,它可以在射程外轻松的摧毁同级别战舰，但是结构相当脆弱"

Locale_ship[15250] = "超级货舰"   --226
Locale_ship[15251] = "可以容纳海量物资的超级货舰，拥有庞大的体积和可怕的载货能力"


Locale_ship[15260] = "牵星级巨型码头舰"   --229
Locale_ship[15261] = "超巨型的码头舰，用来快速的装卸物资，它本身也有巨大的中转空间和大量的生活设施。"

Locale_ship[15270] = "阿芙乐尔级超级武库舰改良型"   --237
Locale_ship[15271] = "（注意，游戏中按右下角的技能图标解锁特殊攻击）阿芙乐尔级超级武库舰的改良型，拆除了部分的中型导弹发射架并改装了两座超巨大的曼陀罗飞弹发射装置，拥有可怕的杀伤力"

Locale_ship[15280] = "塔纳托斯级超级武库舰"   --238
Locale_ship[15281] = "（注意，游戏中按右下角的技能图标解锁特殊攻击）阿芙乐尔级超级武库舰的联盟量产型，在加装了曼陀罗超级飞弹的同时，将大量的武器替换为了联盟的制式武器"


Locale_ship[15290] = "裂痕级战列舰MK2型"   --240
Locale_ship[15291] = "新一代的帝国制式战列舰，装备有大量的1400主炮和船头光束主炮"


Locale_ship[15300] = "裂痕级战列舰MK2B型"   --241
Locale_ship[15301] = "装备了三联装1500毫米电磁轨道炮的裂痕2型战列舰，可以有效的对大型旗舰进行攻击"

Locale_ship[15310] = "裂痕级战列舰MK2蚁巢型"   --242
Locale_ship[15311] = "装备了三联装1500毫米电磁轨道炮的裂痕2型战列舰，装备有先进的蚁巢素装甲和超级加速装置"

Locale_ship[15320] = "裂痕级战列舰MK2绝空型"   --243
Locale_ship[15321] = "裂痕2型战列舰阿因特斯防空特化型，通常作为旗舰单位的内圈防御舰船伴随出战。"

Locale_ship[15330] = "秩序级无畏舰"   --245
Locale_ship[15331] = "菲雅利帝国新开发的强袭无畏舰，携带大量护卫舰支援战斗"

Locale_ship[15340] = "塞尔芬迪娜级无畏舰"   --246
Locale_ship[15341] = "携带了数门轨道炮支援战斗的大型无畏舰，拥有可观的火力"

Locale_ship[15350] = "伊苏级特种无畏舰"   --247
Locale_ship[15351] = "追忆之庭秘密开发的特种无畏舰，以轨道炮作为主要火力"


Locale_Text[15350] = "DENEB"   --274
Locale_Text[15351] = "一艘漂流至此的神秘战舰，拥有强大的战斗力，据称此舰正遭到追缉，将其拉入麾下可能会引来不必要的麻烦"

Locale_Text[15360] = "阿尔贝迪欧号超级战列舰"    --275
Locale_Text[15361] = "卡厄斯和艾洛斯最新联合研发的一种超级战列舰，拥有强大的武备和浮游炮群"

Locale_Text[15370] = "雅典娜级舰队航母"    --292
Locale_Text[15371] = "卡厄斯联盟的大型舰队航母，拥有充足的载机量，还可以起降超级轰炸机进行战斗"

Locale_Text[15380] = "雅典娜级舰队航母精英型"    --293
Locale_Text[15381] = "埃癸斯号 卡厄斯联盟的大型舰队航母，拥有充足的载机量，配备有超级轰炸机可以毁灭敌人旗舰"

Locale_Text[15390] = "特蕾茜娅级舰队航母"    --294
Locale_Text[15391] = "卡厄斯联盟的大型舰队航母，拥有充足的载机量，配备有超级轰炸机可以毁灭敌人旗舰"

Locale_Text[15400] = "图哈德达娜级舰队航母"    --295
Locale_Text[15401] = "追忆之庭的大型舰队航母，拥有充足的载机量，配备有足够数量的轰炸机，还可以起降超级轰炸机进行战斗"

Locale_Text[15410] = "血刃2型战列舰"    --301
Locale_Text[15411] = "西线军阀新开发的新型战列舰，是血刃的全面升级版"
Locale_Text[15420] = "血刃2型战列舰铁壁型"    --302
Locale_Text[15421] = "安装了船头装甲的血刃2型战列舰，但是牺牲了部分火力"
Locale_Text[15430] = "坚毅级战列舰"    --303
Locale_Text[15431] = "卡厄斯联盟改造的血刃2型战列舰，拥有更强的火力"

Locale_Text[15440] = "游骑兵级舰队航母"    --307
Locale_Text[15441] = "一种可以快速释放舰载机群的战列级航母，但是结构非常脆弱，容易被集火摧毁"
Locale_Text[15450] = "军团骑士级航空战列舰"    --308
Locale_Text[15451] = "战列舰和航母合体后的产物，在保证战列舰火力的同时还拥有庞大载机量"

Locale_Text[15460] = "圣魔级超级战列舰 亚伯"    --316
Locale_Text[15461] = "联盟海军所开发的该隐姊妹舰，用于新世代各种系统的综合验证"
Locale_Text[15470] = "圣魔级超级战列舰 该隐"    --317
Locale_Text[15471] = "永生者一族开发的一艘先进战列舰，作为其舰队旗舰服役"

Locale_Text[15480] = "第七代女皇级摧星巨舰"    --320
Locale_Text[15481] = "菲雅利帝国皇室专门为了抗衡同级别摧星巨舰而建造的超级巨舰"
Locale_Text[15490] = "命运级摧星巨舰"    --321
Locale_Text[15491] = "命运之隔，两相交错；烈焰倾覆，永世黯落；先贤之巅，冕冠自默；披荆而行，剑名琥珀。"

Locale_Text[15495] = "亚菲莉丝号"    --322
Locale_Text[15496] = "特殊改造的第五代女皇级，可以部署护卫舰支援战斗，拥有特殊的超级主炮。"

Locale_Text[15505] = "马卡恩之怒堡垒舰-铁浮屠号"    --325
Locale_Text[15506] = "由海盗王改造的马卡恩之怒堡垒舰，可以释放大量的舰载战斗机进行战斗"
Locale_Text[15515] = "君王级战略旗舰"    --326
Locale_Text[15516] = "君王级战略旗舰是涅米西斯曾经的骄傲，完全翻新后的她们拥有着与现时同级舰相匹敌的火力"

Locale_Text[15525] = "裂痕2E型重骑兵型"    --331
Locale_Text[15526] = "裂痕2型幽灵重骑兵型，特殊化改造推进器和武器系统让它可以冲锋并在近距离歼灭敌人。"
Locale_Text[15535] = "裂痕2F莫尔迪基安大君型"    --332
Locale_Text[15536] = "裂痕2型莫尔迪基安大君定制强化型，其为大君第二舰队战场中流砥柱之一。"
Locale_Text[15545] = "裂痕2G型旅团辅助航母"    --333
Locale_Text[15546] = "裂痕2型朝圣者圣艾恩旅团改造的辅助航母，作为彼岸编队的延伸而进入战场。"

Locale_Text[15550] = "奥丁级无畏舰精英型"
Locale_Text[15551] = "升级版的奥丁级无畏舰，拥有更强大的攻防火力"


Locale_Text[15555] = "雅典娜级舰队航母精英型"    --舰船名称ship342
Locale_Text[15556] = "斯内克斯号 卡厄斯联盟的大型舰队航母，拥有充足的载机量，配备有超级轰炸机可以毁灭敌人旗舰"

Locale_Text[15565] = "雅典娜级舰队航母精英型"    --舰船名称ship343
Locale_Text[15566] = "奥维利亚号 卡厄斯联盟的大型舰队航母，拥有充足的载机量，配备有超级轰炸机可以毁灭敌人旗舰"

Locale_Text[15575] = "十四公主"    --舰船名称ship341
Locale_Text[15576] = "菲雅利帝国暗夜女神级的阿因特斯舰队改进型。一般在大规模编队中作为补充反超旗火力而额外增编。"

Locale_Text[15585] = "裂痕121级战列舰"    --舰船名称ship345
Locale_Text[15586] = "蚁巢舰队裂痕121级战列舰。由裂痕2拼接两条裂痕1构成的试做型战场壁垒。"

Locale_Text[15595] = "裂痕2GFG级战列航母"    --舰船名称ship183
Locale_Text[15596] = "莫尔迪基安超魔改航空战列舰。由大君型裂痕2拼接2条G型号裂痕2航母而组成。"

Locale_Text[15601] = "玛丽·德莱西娅"    --舰船名称ship345
Locale_Text[15602] = "精锐型装甲航母携帝国舰载机编队，太太赛高！"

Locale_ship[15610] = "阿芙乐尔级超级武库舰导弹型"   --186

Locale_Text[15605] = "赫利奥斯级导弹无畏舰"    --舰船名称ship348
Locale_Text[15606] = "以运用“曼陀罗”长程反舰导弹为核心，装备多种远程支援武备，同时兼顾远近目标的主力导弹无畏舰"

Locale_Text[15610] = "混沌之刃级无畏舰"    --舰船名称ship349
Locale_Text[15611] = "赫利奥斯级无畏舰军团联合战线授权生产版本，使用维格尔体系武装，并在数个指标上受到了巧妙的限制"

Locale_Text[15620] = "安吉丽娜级重型舰队航母"    --舰船名称ship350
Locale_Text[15621] = "安吉丽娜级袖珍战列舰改装的舰队航母，虽然说重型战斗机搭载量不足，但是有一定的反舰火力进行补充"

Locale_Text[15640] = "远行者MK2型战列舰"    --舰船名称ship351
Locale_Text[15641] = "新一代的远行者级战列舰，虽然说降低了成本，但是拥有更多的泛用性"

Locale_Text[15650] = "远行者MK2型货舰"    --舰船名称ship352
Locale_Text[15651] = "新一代的远行者级货舰，拥有更低廉的成本和更合适的装载能力"

Locale_Text[15660] = "三叶级导弹型"    --舰船名称ship353
Locale_Text[15661] = "三叶级运输舰的进化形态，无人自主作战，小型商队护航的经济选择"

Locale_Text[15670] = "哈迪斯级移动航空基地"    --舰船名称ship356
Locale_Text[15671] = "巨大的移动式航空基地，拥有远超常规航空母舰的载机量，可支持超重型舰载机的大批量起降作业。"
Locale_Text[15680] = "含光先进战斗机"    --舰船名称ship357
Locale_Text[15681] = "以中距空空导弹为主要打击手段的全域作战空优战斗机，可有效反制重型战机"
Locale_Text[15690] = "含光先进战斗机格斗型"    --舰船名称ship358
Locale_Text[15691] = "含光战斗机的常规引擎版本，武器搭配更偏向于近距离战斗，可同时有效对抗轻重型单位"

Locale_Text[15700] = "尤利西斯"    --舰船名称ship359
Locale_Text[15701] = "审判日的特殊改进型"


Locale_Text[15710] = "奥利维尔型探险船"    --舰船名称ship360
Locale_Text[15711] = "经过大幅度改装的大型多功能探险船"
Locale_Text[15720] = "天斩型护卫炮艇"    --舰船名称ship361
Locale_Text[15721] = "担负机动防空任务的重型炮艇"



Locale_Text[15730] = "Avalon阿瓦隆"    --舰船名称ship362
Locale_Text[15731] = "莫尔迪基安第二军团旗舰Avalon阿瓦隆"
Locale_Text[15740] = " Excalibur胜利之剑"    --舰船名称ship363
Locale_Text[15741] = "For The One True King"
Locale_Text[15750] = "叹息之墙"    --舰船名称ship364
Locale_Text[15751] = "巨型战争堡垒，拥有四门超级离子加农炮"


Locale_Text[15760] = "幻象IX远山"    --舰船名称ship365
Locale_Text[15761] = "幻象9型 重破者兵装 全装备式样"
Locale_Text[15770] = "未来福音"    --舰船名称ship366
Locale_Text[15771] = "Kingsglaive第五骑士煌的专属座驾"
Locale_Text[15780] = "幻象XI圣裁"    --舰船名称ship367
Locale_Text[15781] = "幻象11圣裁最终决战式样"



Locale_Text[15790] = "图腾级改装战列舰"    --舰船名称ship368
Locale_Text[15791] = "货舰改装成的战列舰,虽然战斗力较差，但是成本相对低廉适合在早期阶段快速发动进攻"
Locale_Text[15800] = "图腾级改装航母"    --舰船名称ship369
Locale_Text[15801] = "货舰改装成的重型航母,相对传统维格尔航母来说结构更加坚固，同时能够释放更多的舰载机"
Locale_Text[15810] = "图腾级重型货舰"    --舰船名称ship370
Locale_Text[15811] = "一种经典的巨型货舰，拥有庞大的货舱和坚固的结构，可以进行各种改装"
Locale_Text[15820] = "稚刀级轻巡洋舰"    --舰船名称ship371
Locale_Text[15821] = "一种多用途的轻型巡洋舰"
Locale_Text[15830] = "滚滚级防空驱逐舰"    --舰船名称ship372
Locale_Text[15831] = "拥有厚重装甲的球形防空驱逐舰"


Locale_Text[15840] = "乌兰巴托级指挥母舰"    --舰船名称ship373
Locale_Text[15841] = "大型的战略指挥母舰，拥有一定的航空能力，但是更适合后期支援"
Locale_Text[15850] = "剃刀级战斗机"    --舰船名称ship374
Locale_Text[15851] = "轻型高速拦截机，拥有优秀的机动性和较低的成本"
Locale_Text[15860] = "海燕级运输机"    --舰船名称ship375
Locale_Text[15861] = "拥有较大的体量的重型运输机"
Locale_Text[15870] = "大型运输驳船"    --舰船名称ship376
Locale_Text[15871] = "常见的大型集装箱货舰，成本低廉运力出色，但是结构极为脆弱"


Locale_Text[15880] = "洛神号"    --舰船名称ship377
Locale_Text[15881] = "拥有全方位火力与射程的主力舰，直至代号最后的梦行动重启后，完成了引擎修复与武器改装，并同时复原了数据库中的虚拟偶像涂装"
Locale_Text[15890] = "休伯利安号"    --舰船名称ship378
Locale_Text[15891] = "蚁巢舰队采用颠覆性技术建造的最新旗舰"


Locale_Text[15900] = "破刃之剑"    --舰船名称ship379
Locale_Text[15901] = "一种先进的超重型战斗机，拥有剑刃型机体可以轻松突破敌方空域"
Locale_Text[15910] = "破戟之刃"    --舰船名称ship380
Locale_Text[15911] = "破刃之剑的简化版，拥有更好的机动性和更优秀的制造成本"


Locale_Text[15920] = "洪流级重型驱逐舰"    --舰船名称ship381
Locale_Text[15921] = "大型侦察驱逐舰，拥有大型主炮和弹幕导弹"

Locale_Text[15930] = "艾瑞希尔级破交无畏舰"    --舰船名称ship382
Locale_Text[15931] = "新锐的高速重甲无畏舰，拥有足以匹敌堡垒舰的战斗力"

Locale_Text[15940] = "耶梦加得号破交无畏舰"    --舰船名称ship383
Locale_Text[15941] = "艾瑞希尔级破交无畏舰的特殊型号，拥有强大的战斗力"



Locale_Text[15950] = "提丰级战列巡洋舰"    --舰船名称ship384
Locale_Text[15951] = "拥有高机动力和良好灵活性的高速巡航舰"

Locale_Text[15960] = "炼风级战列巡洋舰"    --舰船名称ship385
Locale_Text[15961] = "拥有高机动力和良好灵活性的高速巡航舰"

Locale_Text[15970] = "提丰级战列巡洋舰D型"    --舰船名称ship386
Locale_Text[15971] = "拥有高机动力和良好灵活性的高速巡航舰，拥有特殊的电子战能力"


Locale_Text[15980] = "豚鼠级护卫舰"    --舰船名称ship387
Locale_Text[15981] = "一种量产型的护卫舰"

Locale_Text[15990] = "晨锋级战略打击母舰"    --舰船名称ship388
Locale_Text[15991] = "曦景湛然，刃吟如歌。苍星战团直卫，为终结战争来此"

Locale_Text[16000] = "弥离工程型"    --舰船名称ship389
Locale_Text[16001] = "工程型的弥离级舰队航母，没有释放舰载机的能力，但是可以进行远程修理"


Locale_Text[16010] = "入侵者机甲队长机型"    --舰船名称ship390
Locale_Text[16011] = "入侵者机甲的队长机型号，可使用高出力射击反制高级战机"


Locale_Text[16020] = "GX-正义之枪"    --舰船名称ship391
Locale_Text[16021] = "为AI护卫部队开发的新世代舰载机，拥有优秀综合作战性能"
Locale_Text[16030] = "GX-朗基努斯构型"    --舰船名称ship392
Locale_Text[16031] = "正义之枪的朗基努斯强化套件，具备出色正面攻坚火力"

Locale_Text[16040] = "GX-卡西乌斯构型"    --舰船名称ship393
Locale_Text[16041] = "正义之枪的卡西乌斯强化套件，具备卓越空战能力"
Locale_Text[16050] = "GX-盖乌斯构型"    --舰船名称ship394
Locale_Text[16051] = "正义之枪的盖乌斯强化套件，具备多目标打击能力"

Locale_Text[16060] = "魅影无人机"    --舰船名称ship395
Locale_Text[16061] = "配合GX计划开发的伴随无人机，可提供多样支援能力"
Locale_Text[16070] = "抚仙级工程舰"    --舰船名称ship396
Locale_Text[16071] = "小巧可靠的后勤舰船，能够跨越危险星域，切实保障舰队安全"


Locale_Text[16080] = "碎星级攻击舰"    --舰船名称ship397
Locale_Text[16081] = "装备重型导弹发射装置的舰队火力支援舰 "
Locale_Text[16090] = "星语级侦察航母 "    --舰船名称ship398
Locale_Text[16091] = "具有强续航力的多用途辅助航母"
Locale_Text[16100] = "新星级驱逐舰 "    --舰船名称ship399
Locale_Text[16101] = "承担舰队护卫任务的小型辅助舰"
Locale_Text[16110] = "圣碑级激光无畏舰 "    --舰船名称ship400
Locale_Text[16111] = "大型激光炮无畏舰"



Locale_Text[16120] = "超级战斗机-神罚"    --舰船名称ship401
Locale_Text[16121] = "以歼灭强大单体敌人设计的先进战斗机"
Locale_Text[16130] = "超级战斗机-神罚歼灭型"    --舰船名称ship402
Locale_Text[16131] = "神罚的武装强化版本，用来突袭强大的舰队"
Locale_Text[16140] = "联盟轻型驱逐舰  "    --舰船名称ship403
Locale_Text[16141] = "巡逻用的小型舰船 "
Locale_Text[16150] = "食人鲳轰炸机 "    --舰船名称ship404
Locale_Text[16151] = "重型攻击轰炸机，拥有强大的输出火力"
Locale_Text[16160] = "食人鲳轰炸机-蔷薇型 "    --舰船名称ship405
Locale_Text[16161] = "装备了蔷薇导弹的重型轰炸机"


Locale_Text[16170] = "锦依卫 "    --舰船名称ship406
Locale_Text[16171] = "洛神号所属的锦依卫涂装，永远守护殿下"


Locale_Text[16180] = "大黄蜂号"    --舰船名称ship407
Locale_Text[16181] = "弥离级航母改装的大型舰载机平台"

Locale_Text[16190] = "福龙号运载舰"    --舰船名称ship408
Locale_Text[16191] = "多功能战斗支援母舰，舰队核心"
Locale_Text[16200] = "威龙号无畏舰"    --舰船名称ship409
Locale_Text[16201] = "威力无匹的炮击战舰，舰队中坚"

Locale_Text[16210] = "GX-EX"    --舰船名称ship410
Locale_Text[16221] = "GX-EX"
























































Factory_Text = {}
Factory_Text[1000] = "纯净水提炼装置"            --1--贸易1级  殖民地淡水厂  35000  --比例调整
Factory_Text[1001] = "可以将冰矿融化成淡水"
Factory_Text[1005] = "啤酒酿造厂"                --2--贸易10级   殖民地    20000 --比例调整 
Factory_Text[1006] = "可以用小麦酿造啤酒"
---------------------------------------------------
Factory_Text[1100] = "氢燃料提炼装置"            --3    --贸易10级    帝国之门燃料厂   100000     --比例调整
Factory_Text[1101] = "可以高效率的将淡水电解出氢燃料"
Factory_Text[1105] = "核燃料提炼装置"            --4     --贸易20级    帝国之门燃料厂   200000    --比例调整
Factory_Text[1106] = "从一些珍稀矿石中提炼出核燃料，"
Factory_Text[1110] = "反物质燃料提炼装置"        --5      --贸易30级   帝国之门燃料厂   1000000     --比例调整
Factory_Text[1111] = "将大量的能源和一些珍稀元素一起压缩成反物质燃料"
---------------------------------------------------
Factory_Text[1200] = "面包烘焙坊"                --6  --贸易2级         农场群  食品厂  20000     --比例调整
Factory_Text[1201] = "将小麦研磨成面粉后高效率的烤制成面包。"
Factory_Text[1205] = "星堡"                --7  --贸易4级         农场群  食品厂  50000       --比例调整
Factory_Text[1206] = "巨型的防御堡垒，可以容纳大量人口和物资"
Factory_Text[1210] = "高级厨房"                  --8  --贸易18级        殖民地  400000        --比例调整
Factory_Text[1211] = "将牛肉经过精心的调理，制作成美味的牛排。"

Factory_Text[1300] = "日用品加工模块"            --9  --贸易0级       帝国之门贸易站  10000     --比例调整   
Factory_Text[1301] = "将一些基础合金制作成简单的生活用品。"

Factory_Text[1400] = "谷物农场"                  --10    --贸易4级    农场群  农场   30000    --比例调整
Factory_Text[1401] = "用淡水和能源高效率的培育出谷物来。"
Factory_Text[1405] = "机械零件厂"                --11     --贸易14级    农场群  养猪场  80000   --比例调整
Factory_Text[1406] = "生产各种机械设备所需要的零配件"
Factory_Text[1410] = "殖民地星门"                --12     --贸易22级    希格拉首星  500000    --比例调整
Factory_Text[1411] = "消耗跃迁能量来召唤和发送舰队"

Factory_Text[1500] = "纳米物质工厂"          --13      --贸易18级    前线  80000         --比例调整
Factory_Text[1501] = "生产各种纳米物质"
Factory_Text[1505] = "船体组件工厂"          --14       --贸易23级    H船坞  1500000      --比例调整
Factory_Text[1506] = "生产战舰和空间站建设所必须的船体结构组件"
Factory_Text[1510] = "舰载机组件厂"          --15      --贸易41级     A基地  12000000    --比例调整
Factory_Text[1511] = "生产组装舰载机所需要的舰载机组件"

Factory_Text[1600] = "研究站LV01"          --16      --贸易21级     帝国之门冶炼场   2100000   --比例调整
Factory_Text[1601] = "提供科研点数，用来研究战舰蓝图和提升舰船性能"
Factory_Text[1605] = "旗舰级核心组件厂"        --17      --贸易34级        A基地 6700000        --比例调整
Factory_Text[1606] = "专门用来生产旗舰级战舰的核心组件"
Factory_Text[1610] = "高温熔炉"                  --18     --贸易38级         帝国之门冶炼场   8500000      --比例调整
Factory_Text[1611] = "用高性能的锻造熔炉和大量能量直接将基础合金升级为高强度合金。"
Factory_Text[1615] = "特种合金冶炼设备"          --19       --贸易52级       帝国之门冶炼场   27000000        --比例调整
Factory_Text[1616] = "在高强度合金的基础上添加特殊元素，将其升级为特种合金。"
Factory_Text[1620] = "研究站LV02"          --16      --贸易21级     帝国之门冶炼场   2100000   --比例调整
Factory_Text[1625] = "研究站LV03"          --16      --贸易21级     帝国之门冶炼场   2100000   --比例调整
Factory_Text[1630] = "研究站LV04"          --16      --贸易21级     帝国之门冶炼场   2100000   --比例调整

Factory_Text[1700] = "小口径武器配件加工流水线"  --20       --贸易12级       前线  150000       --比例调整
Factory_Text[1701] = "在生产小口径武器所必须的各种零配件。"
Factory_Text[1705] = "中型武器配件加工车间"      --21        --贸易18级    V海盗  3500000      --比例调整
Factory_Text[1706] = "在生产小口径武器所必须的各种零配件。"
Factory_Text[1710] = "大型武器配件加工厂"        --22         --贸易32级    V船坞  12000000       --比例调整  
Factory_Text[1711] = "生产大型旗舰所需要的大型武器配件。"

Factory_Text[1800] = "超空间模块"        --
Factory_Text[1801] = "消耗反物质能量在航母周围生成一个大范围的跳跃立场，引导友军舰队进行跳跃。"

Factory_Text[1850] = "高效能废水处理设备"        --23    --贸易12级       帝国殖民地  50000       --比例调整 
Factory_Text[1851] = "一个高性能的废水处理设施，可以更高效的循环用水，从而节约出更多淡水给其他设备使用。"
Factory_Text[1860] = "生活垃圾处理设施"        --24       --贸易15级        帝国殖民地  20000      --比例调整
Factory_Text[1861] = "一种高效能的生活垃圾处理设备，"

Factory_Text[1865] = "基础补给合成设备"        --25      --贸易10级       帝国之门贸易站  50000       --比例调整
Factory_Text[1866] = "使用基础的食材合成基础补给。"
Factory_Text[1870] = "弹药加工设备"        --26        --贸易20级        帝国之门旗舰集结地   100000       --比例调整
Factory_Text[1871] = "可以加工各种口径的弹药和能量武器专用的弹药包。"
Factory_Text[1875] = "修理材料生产设备"        --27       --贸易15级      帝国殖民地船坞  200000       --比例调整
Factory_Text[1876] = "使用各种金属原材料来生产修补材料。"

Factory_Text[1880] = "高级补给品生产车间"        --28     --贸易25级          帝国之门贸易站  100000    --比例调整
Factory_Text[1881] = "使用一些高级食材来制作基础补给。"
Factory_Text[1885] = "弹药加工流水线"        --29          --贸易35级        帝国前线  200000    --比例调整
Factory_Text[1886] = "高效率生产弹药的流水线。"  
Factory_Text[1890] = "修理材料生产工厂"        --30          --贸易40级       坦尼斯   400000    --比例调整
Factory_Text[1891] = "高效率的生产修补材料的自动工厂。"
Factory_Text[1895] = "人形电脑装配厂"        --31           --贸易55级     A基地     9000000   
Factory_Text[1896] = "生产菲雅利人最热衷的人形电脑，据说一台人形电脑现在在菲雅利可以卖到数万以上。"

Factory_Text[1900] = "大型船体装配厂"        --32           --贸易55级     A基地     9000000   
Factory_Text[1901] = "组装大型战舰所需的船体配件。"
Factory_Text[1905] = "大型电子元件厂"        --33           --贸易55级     A基地     9000000   
Factory_Text[1906] = "生产高级设备所必须的各种电子元件"
Factory_Text[1910] = "大型模块化居住区装配厂"        --34           --贸易55级     A基地     9000000   
Factory_Text[1911] = "组装中型模块化居住区并安装到各种船只上。"
Factory_Text[1915] = "仓鼠乐园"        --35           --贸易55级     A基地     9000000   
Factory_Text[1916] = "让仓鼠快乐的繁殖。"


Factory_Text[1920] = "殖民地核心居住区"        --36           --贸易55级     A基地     9000000   
Factory_Text[1921] = "殖民地工人生活和居住的空间"
Factory_Text[1930] = "殖民地矿石采集站"        --37           --贸易55级     A基地     9000000   
Factory_Text[1931] = "采集站中的采矿船会采集周边区域的金属矿石并运输回来"
Factory_Text[1940] = "殖民地谷物农场"        --38           --贸易55级     A基地     9000000   
Factory_Text[1941] = "一个大型的谷物农场，可以消耗殖民地的淡水资源，为殖民地提供谷物"
Factory_Text[1950] = "殖民地净水处理厂"        --39           --贸易55级     A基地     9000000   
Factory_Text[1951] = "使用采集来的冰矿石加工成纯净水"
Factory_Text[1960] = "殖民地食品加工厂"        --40           --贸易55级     A基地     9000000   
Factory_Text[1961] = "将各种食材加工成殖民地工人所需的食物"
Factory_Text[1970] = "殖民地金属冶炼厂"        --41           --贸易55级     A基地     9000000   
Factory_Text[1971] = "将采集来的金属矿石开采出矿石"
Factory_Text[1980] = "殖民地能源供应中心"        --42           --贸易55级     A基地     9000000   
Factory_Text[1981] = "使用能源电池手机太阳能来供应殖民地发电"
Factory_Text[1990] = "殖民地安保中心"        --43           --贸易55级     A基地     9000000   
Factory_Text[1991] = "安保人员训练和居住的地方"
Factory_Text[2000] = "殖民地冰矿采集站"        --44           --贸易55级     A基地     9000000   
Factory_Text[2001] = "派出采矿船开采冰矿"
Factory_Text[2010] = "殖民地弹药工厂"        --45           --贸易55级     A基地     9000000   
Factory_Text[2011] = "生产弹药来满足殖民地的日常消耗"
Factory_Text[2020] = "殖民地日用品工厂"        --46           --贸易55级     A基地     9000000   
Factory_Text[2021] = "生产日用品满足殖民地工人的需要"
Factory_Text[2030] = "殖民牧场"        --47           --贸易55级     A基地     9000000   
Factory_Text[2031] = "消耗谷物喂养各种牲畜，并生产肉类"








camp_Text = {}
camp_Text[70015] = "菲雅利商人"
camp_Text[70020] = "菲雅利商业设施"
camp_Text[70025] = "贸易船队"
camp_Text[70030] = "菲雅利舰队"
camp_Text[70035] = "维格尔舰队"
camp_Text[70040] = "菲雅利帝国"
camp_Text[70045] = "希格拉舰队"
camp_Text[70050] = "埃赫洛斯嘉德舰队"
camp_Text[70055] = "泰瓦伦共和国舰队"
camp_Text[70060] = "归乡者舰队"
camp_Text[70065] = "亚基纳茨虫族"
camp_Text[70070] = "维肯.末世的叛军舰队"
camp_Text[70075] = "希格拉菲雅利联军舰队 "  
camp_Text[70080] = "失控的先祖舰队 "
camp_Text[70085] = "死镰海盗团"
camp_Text[70090] = "图拉尼海盗"
camp_Text[70095] = "卡德什舰队"
camp_Text[70500] = "希格拉首星防御战"
camp_Text[70505] = "神谕之地防御战"
camp_Text[70510] = "水晶体防御战"
camp_Text[70515] = "妖精重工"
camp_Text[70520] = "贸易商会"
camp_Text[70530] = "1v7生存地图"
camp_Text[70535] = "水晶体"
camp_Text[70540] = "菲雅利商人"
camp_Text[70545] = "维格尔军阀"
camp_Text[70550] = "希格拉指挥官"
camp_Text[70555] = "埃赫洛斯嘉德舰队指挥官"
camp_Text[70560] = "泰瓦伦指挥官"
camp_Text[70565] = "太空海盗"
camp_Text[70570] = "朝圣者"
camp_Text[70575] = "朝圣者信徒"
camp_Text[70580] = "东线军阀"
camp_Text[70585] = "莫尔迪基安大君"
camp_Text[70590] = "卡厄斯联盟"
camp_Text[70595] = "追忆之庭"
camp_Text[70600] = "幽灵舰队"
camp_Text[70605] = "阿因特斯舰队"
camp_Text[70610] = "蚁巢舰队"
camp_Text[70615] = "镜"