Locale_Text = {}



Locale_Text[1] = "大型护航艇科技"
Locale_Text[2] = "允许制造性能卓越的镰蜂重炮艇"
Locale_Text[3] = "常规炮艇机架"


Locale_Text[4] = "护卫舰与炮艇科技"
Locale_Text[5] = "建造性能优良的大型突击舰,拥有完善的攻防能力"
Locale_Text[6] = "超大型护卫舰机架"
Locale_Text[7] = "护卫舰与炮艇舰体修复科技"
Locale_Text[8] = "升级更先进更强大的损管控制系统，以加强自我修复能力"
Locale_Text[9] = "护卫舰与炮艇1级快速修复科技"
Locale_Text[10] = "护卫舰与炮艇2级快速修复科技"
Locale_Text[11] = "护卫舰与炮艇3级快速修复科技"


Locale_Text[15] = "护卫舰与炮艇装甲科技"
Locale_Text[16] = "换装先进的合金装甲提升防御力"
Locale_Text[17] = "护卫舰与炮艇1级装甲科技"
Locale_Text[18] = "护卫舰与炮艇2级装甲科技"
Locale_Text[19] = "护卫舰与炮艇3级装甲科技"


Locale_Text[108] = "巡洋舰1级装甲科技"
Locale_Text[109] = "巡洋舰2级装甲科技"

Locale_Text[101] = "量产型战舰装甲科技"
Locale_Text[102] = "换装先进的高级复合装甲提升防御力"
Locale_Text[103] = "量产型战舰1级装甲科技"
Locale_Text[104] = "量产型战舰2级装甲科技"
Locale_Text[105] = "量产型战舰3级装甲科技"

Locale_Text[111] = "量产型战舰自我修复科技"
Locale_Text[112] = "升级船内的损管设备,加快受损时的修复速度"
Locale_Text[113] = "量产型战舰修复速度提升1"
Locale_Text[114] = "量产型战舰修复速度提升2"
Locale_Text[115] = "量产型战舰修复速度提升3"

Locale_Text[117] = "快速建造"
Locale_Text[118] = "通过改进设备以增加工业舰的制造舰船速度"
Locale_Text[119] = "工业舰建造速度1"
Locale_Text[120] = "工业舰建造速度2"




------------------------------------------------------------------------------------------------------------------

Locale_Text[121] = "主力舰科技"
Locale_Text[122] = "升级版的远行者级战列舰，装备了电磁轨道炮"
Locale_Text[123] = "精英型远行者级"

Locale_Text[125] = "一种装备了新型电磁轨道炮的支援型巡洋舰，可以远程狙击敌舰"
Locale_Text[126] = "方阵级重炮巡洋舰"

Locale_Text[131] = "袭击舰舰体科技"
Locale_Text[132] = "强化过的阔刃3级袭击舰,装备了战列舰主炮和厚重的装甲,专门用来抵挡和牵制敌人的巨型战舰"
Locale_Text[133] = "袭击舰舰体科技"
Locale_Text[1200] = "拥有优秀综合作战性能的特种战舰，可以应付任何场面"
Locale_Text[1201] = "巡回者级袭击舰科技"



Locale_Text[134] = "导弹袭击舰科技"
Locale_Text[135] = "一种威力强大的大型导弹发射船"
Locale_Text[136] = "导弹袭击舰科技"

Locale_Text[140] = "火力升级"
Locale_Text[141] = "增加执行者巡洋舰的火力强度"
Locale_Text[142] = "执行者级巡洋舰火力升级1"
Locale_Text[143] = "执行者级巡洋舰火力升级2"

Locale_Text[170] = "劫火级的简化版，装备的质量加速炮能够有效的摧毁小型单位"
Locale_Text[171] = "清除者级巡洋舰"

Locale_Text[175] = "造价低廉的通用型船体，可以大量生产"
Locale_Text[176] = "量产型巡洋舰机架"

Locale_Text[180] = "一种拥有大量速射火炮的巡洋舰，适合用来压制敌人的护卫舰群"
Locale_Text[181] = "亚特兰大级巡洋舰"

Locale_Text[182] = "装备了7座四联装防空炮的亚特兰大级巡洋舰，能够有效应对一切空中威胁"
Locale_Text[183] = "亚特兰大防空型"
Locale_Text[184] = "装备了7座双联装离子炮的亚特兰大级巡洋舰，能够对敌人的大型战舰造成重创"
Locale_Text[185] = "亚特兰大离子炮型"
Locale_Text[186] = "装备了7座双联装离子炮的亚特兰大级巡洋舰，能够对敌人的大型战舰造成重创"
Locale_Text[187] = "亚特兰大离子炮型"
Locale_Text[188] = "装备了大型装甲盾的亚特兰大级巡洋舰，能有效的抵御伤害"
Locale_Text[189] = "亚特兰大离子炮型"
---------------------------------------------------------------------------------------
Locale_Text[150] = "装甲舰科技"
Locale_Text[160] = "装备了厚重装甲的防御型战舰，可以抵挡任何炮火的攻击"
Locale_Text[161] = "沙迦级装甲舰船体"


Locale_Text[151] = "战列舰科技"
Locale_Text[152] = "可以召唤裂痕级战列舰,这种强大的战舰可以迅速扭转战局"
Locale_Text[153] = "战列舰诱导力场"
Locale_Text[154] = "安装了离子加农炮炮塔的曙光级战列舰，专门用来摧毁大型目标"
Locale_Text[155] = "曙光B型战列舰"
Locale_Text[156] = "装备了电磁轨道炮炮塔的裂痕级战列舰，可以有攻击旗舰级目标"
Locale_Text[157] = "裂痕C级战列舰"

Locale_Text[158] = "拥有巨型炮塔的巨大战舰，用来摧毁最坚固的目标"
Locale_Text[159] = "轮回级无畏舰"

Locale_Text[6401] = "秩序级无畏舰"
Locale_Text[6400] = "一种携带了大量护卫舰的大型无畏舰"


Locale_Text[165] = "一种拥有大量重炮的巨型战舰，适合对付敌人的密集舰群"
Locale_Text[166] = "虚空级无畏舰召唤"

Locale_Text[600] = "轻装突击舰科技"
Locale_Text[601] = "允许制造成本低廉的通用型突击舰"
Locale_Text[602] = "轻装突击舰机架"


Locale_Text[190] = "先进1400毫米火箭炮发射器"
Locale_Text[191] = "一种先进的1400毫米火箭炮，使用1400毫米火炮的弹头作为战斗部"


---------------------------------------------------------------------------------------------------

Locale_Text[200] = "巨型运载舰科技"
Locale_Text[201] = "将运载舰的武器系统和动力系统重新启动，恢复作战能力"
Locale_Text[202] = "运载舰系统激活"
Locale_Text[203] = "增加防御能力,开启辅助的模块系统和相应的升级科技"
Locale_Text[204] = "升级船内的损管设备,加快受损时的修复速度"
Locale_Text[205] = "增加妖姬号所有武器的火力强度"
Locale_Text[210] = "妖姬号1级装甲强化"
Locale_Text[211] = "妖姬号2级装甲强化"
Locale_Text[212] = "妖姬号3级装甲强化"
Locale_Text[213] = "妖姬号4级装甲强化"
Locale_Text[214] = "妖姬号5级装甲强化"
Locale_Text[220] = "妖姬号修复速度提升1"
Locale_Text[221] = "妖姬号修复速度提升2"
Locale_Text[222] = "妖姬号修复速度提升3"
Locale_Text[223] = "妖姬号修复速度提升4"
Locale_Text[224] = "妖姬号修复速度提升5"
Locale_Text[230] = "妖姬号火力强度提升1"
Locale_Text[231] = "妖姬号火力强度提升2"
Locale_Text[232] = "妖姬号火力强度提升3"
Locale_Text[233] = "妖姬号火力强度提升4"
Locale_Text[234] = "妖姬号火力强度提升5"




Locale_Text[240] = "无畏舰科技"
Locale_Text[241] = "提升无畏舰的防御力"
Locale_Text[242] = "无畏舰1级装甲科技"
Locale_Text[243] = "无畏舰2级装甲科技"

Locale_Text[245] = "提升无畏舰的修复能力"
Locale_Text[246] = "无畏舰1级修复科技"
Locale_Text[247] = "无畏舰2级修复科技"
Locale_Text[248] = "一种火力强大的巨型战舰，拥有强大的单舰战斗能力"
Locale_Text[249] = "光辉级无畏舰"

Locale_Text[258] = "自然选择级无畏舰"
Locale_Text[259] = "洛神号"

Locale_Text[600] = "驱逐舰护盾强化2"  
Locale_Text[601] = "增加驱逐舰的护盾强度，让其可以抵挡更久的攻击，警告：如果战舰承受了太强的攻击，会导致其在护盾过载前就提前爆炸"
Locale_Text[602] = "驱逐舰护盾强化"
Locale_Text[603] = "防空驱逐舰护盾强化"

Locale_Text[601] = "精英化主力舰科技"
Locale_Text[652] = "拥有防御性护盾的先进战舰，拥有可观的防御力"
Locale_Text[653] = "防御驱逐舰"

Locale_Text[654] = "提升防御驱逐舰50%的装甲，增强防御力"
Locale_Text[655] = "防御驱逐舰装甲提升"
Locale_Text[656] = "提升防御驱逐舰的修复能力"
Locale_Text[657] = "防御驱逐舰修复速度"
Locale_Text[658] = "提升防空驱逐舰50%的装甲，增强防御力"
Locale_Text[659] = "防空驱逐舰装甲提升"
Locale_Text[660] = "提升防空驱逐舰的修复能力"
Locale_Text[661] = "防空驱逐舰修复速度"

Locale_Text[601] = "精英化主力舰科技"
Locale_Text[611] = "一种强大无比的超级巡洋舰，拥有可怕的攻防性能，可以有效的消灭所有的中小型战舰"
Locale_Text[612] = "劫火级袭击舰"

Locale_Text[614] = "提升劫火级20%的装甲，增强防御力"
Locale_Text[615] = "劫火级装甲提升1"
Locale_Text[616] = "提升劫火级50%的装甲，增强防御力"
Locale_Text[617] = "劫火级装甲提升2"
Locale_Text[618] = "让劫火级拥有一个容量为20WHP的防护盾"
Locale_Text[619] = "劫火级护盾科技"
Locale_Text[620] = "增加劫火级30%的攻击力"
Locale_Text[621] = "劫火级武器科技"
Locale_Text[622] = "提升劫火级5倍的修复能力"
Locale_Text[623] = "劫火级自我修复提升1"
Locale_Text[624] = "提升劫火级10倍的修复能力"
Locale_Text[625] = "劫火级自我修复提升2"

Locale_Text[700] = "高速袭击舰科技"
Locale_Text[709] = "强化高速袭击舰的装甲"
Locale_Text[710] = "高速袭击舰1级装甲强化"
Locale_Text[711] = "高速袭击舰2级装甲强化"
Locale_Text[712] = "高速袭击舰3级装甲强化"
Locale_Text[713] = "高速袭击舰4级装甲强化"
Locale_Text[714] = "高速袭击舰5级装甲强化"
Locale_Text[719] = "强化高速袭击舰的火力"
Locale_Text[720] = "高速袭击舰1级火力强化"
Locale_Text[721] = "高速袭击舰2级火力强化"
Locale_Text[722] = "高速袭击舰3级火力强化"
Locale_Text[723] = "高速袭击舰4级火力强化"
Locale_Text[724] = "高速袭击舰5级火力强化"
---------------------------------------------------------------------------------------------

Locale_Text[300] = "母舰强化"
Locale_Text[301] = "开启一系列的母舰与大型航母升级强化科技，并且大幅度提升工业母舰的防御能力"
Locale_Text[302] = "母舰强化技术"

Locale_Text[310] = "合成设备升级"
Locale_Text[311] = "升级提炼设备以达到更高的合成效率"

Locale_Text[320] = "资源合成设备升级1"
Locale_Text[321] = "资源合成设备升级2"
Locale_Text[322] = "资源合成设备升级3"
Locale_Text[323] = "资源合成设备升级4"
Locale_Text[324] = "资源合成设备升级5"
Locale_Text[325] = "资源合成设备升级6"
Locale_Text[326] = "资源合成设备升级7"
Locale_Text[327] = "资源合成设备升级8"
Locale_Text[328] = "资源合成设备升级9"
Locale_Text[329] = "资源合成设备升级10"


Locale_Text[350] = "平台科技"

Locale_Text[351] = "浮游炮科技"
Locale_Text[352] = "一种结构简单的移动式武器系统,大量制造后以数量优势来围攻敌人"

Locale_Text[355] = "升级轻型机枪塔的武器塔,将其变为更强大的武器平台"
Locale_Text[356] = "改良型轻型防御塔"

Locale_Text[360] = "部署一种结构坚固的中型防御塔,可以搭载中型武器,有效的摧毁敌人的主力舰"
Locale_Text[361] = "中型防御塔"

Locale_Text[365] = "一种移动式的巨炮，几乎没有任何装甲，但是威力强大"
Locale_Text[366] = "中型轨道炮"

Locale_Text[370] = "一种装甲坚固的巨型武器平台,可以抵挡巨型战舰的进攻"
Locale_Text[371] = "巨型防御塔"

Locale_Text[372] = "给巨型武器平台配属一个防御力强大的旗舰级护盾，让巨型武器平台可以抵挡更多的攻击"
Locale_Text[373] = "巨型防御塔护盾系统"

Locale_Text[375] = "一种威力强大的超级巨炮,移动缓慢而且十分脆弱。"
Locale_Text[376] = "大型轨道炮"

Locale_Text[380] = "为中型防空武器平台升级最新型的穿甲弹头,提高它的反舰能力"
Locale_Text[381] = "中型防空武器平台火力升级"

Locale_Text[385] = "升级火炮反舰平台所使用的弹药,提升反舰威力"
Locale_Text[386] = "中型火炮防御平台火力升级1"
Locale_Text[387] = "中型火炮防御平台火力升级2"

Locale_Text[390] = "给中型火炮防御平台附加装甲,增加防御能力"
Locale_Text[391] = "中型火炮防御平台装甲提升1"
Locale_Text[392] = "中型火炮防御平台装甲提升2"

Locale_Text[395] = "给中型离子炮防御平台附加装甲,增加防御能力"
Locale_Text[396] = "中型离子炮防御平台装甲提升1"
Locale_Text[397] = "中型离子炮防御平台装甲提升2"
Locale_Text[398] = "让中型离子炮防御平台可以进行高速的自我修复"
Locale_Text[399] = "中型离子炮防御平台自我修复系统"

Locale_Text[400] = "给中型防空武器平台附加装甲,增加防御能力"
Locale_Text[401] = "中型防空武器平台装甲提升1"
Locale_Text[402] = "中型防空武器平台装甲提升2"


Locale_Text[400] = "给中型防空武器平台附加装甲,增加防御能力"
Locale_Text[401] = "中型防空武器平台装甲提升1"
Locale_Text[402] = "中型防空武器平台装甲提升2"

Locale_Text[500] = "通过改进设备以增加航母召唤舰船的速度"
Locale_Text[501] = "航母建造速度"


Locale_Text[530] = "航母强化"
Locale_Text[531] = "激活阿维卡级重装航母的舰首离子炮阵列，让其拥有反护卫舰能力，同时开启一些先进战斗机的科技"
Locale_Text[532] = "重装航母武装强化"

Locale_Text[550] = "先进战斗机"
Locale_Text[551] = "一种装备了高精度狙击炮的先进战斗机，用来远程狙杀轻装甲单位"
Locale_Text[552] = "狙击手系统"

Locale_Text[555] = "一种高性能的大型炸弹，不过体积庞大，所以每次轰炸后都需要返回装弹"
Locale_Text[556] = "大型等离子炸弹"


Locale_Text[560] = "妖精重工龙鹰攻击机的一种量产型，和原型相比失去了大幅度升级性能的可能性"
Locale_Text[561] = "超级轰炸机"





Locale_Text[800] = "战斗机科技"
Locale_Text[801] = "升级战斗机的速度"
Locale_Text[802] = "升级战斗机的装甲"
Locale_Text[805] = "战斗机速度升级1"
Locale_Text[806] = "战斗机速度升级2"
Locale_Text[810] = "战斗机装甲升级1"
Locale_Text[811] = "战斗机装甲升级2"


Locale_Text[1001] = "量产型主力舰科技"
Locale_Text[1002] = "一种超低成本的量产型驱逐舰，在战斗早期用来拖延敌人护卫舰群的攻势"
Locale_Text[1003] = "量产型驱逐舰"

Locale_Text[1010] = "菲雅利帝国的制式航母，可以用来召唤各种战舰"
Locale_Text[1011] = "舰队航母"

Locale_Text[1100] = "解锁远行级支援战列舰科技"
Locale_Text[1101] = "巨型货舰机架"


Locale_Text[1260] = "破晓3级战列舰科技"
Locale_Text[1261] = "装备有四联装电磁轨道炮的强大战列舰"
Locale_Text[1262] = "破晓3级战列舰机架"
Locale_Text[1263] = "升级破晓3级战列舰的装甲"
Locale_Text[1264] = "破晓3级战列舰装甲升级1"
Locale_Text[1265] = "破晓3级战列舰装甲升级2"
Locale_Text[1266] = "破晓3级战列舰装甲升级3"
Locale_Text[1267] = "升级破晓3级战列舰的火力"
Locale_Text[1268] = "破晓3级战列舰火力升级"



Locale_Text[1360] = "运载舰科技"
Locale_Text[1363] = "升级运载舰的建造速度"
Locale_Text[1364] = "运载舰建造速度升级1"
Locale_Text[1365] = "运载舰建造速度升级2"
Locale_Text[1366] = "运载舰建造速度升级3"
Locale_Text[1367] = "运载舰建造速度升级4"
Locale_Text[1368] = "运载舰建造速度升级5"



Locale_Text[2000] = "大型护航艇科技"
Locale_Text[2001] = "允许制造攻防能力强大的突击炮艇"
Locale_Text[2002] = "迷你型护卫舰机架"

Locale_Text[2100] = "星尘级驱逐舰科技"
Locale_Text[2101] = "建造拥有厚重装甲的星尘级驱逐舰"
Locale_Text[2102] = "星尘级驱逐舰机架"
Locale_Text[2103] = "升级星尘级驱逐舰的装甲"
Locale_Text[2104] = "星尘级驱逐舰装甲升级1"
Locale_Text[2105] = "星尘级驱逐舰装甲升级2"
Locale_Text[2106] = "升级星尘级驱逐舰的火力"
Locale_Text[2107] = "星尘级驱逐舰火力升级1"
Locale_Text[2108] = "星尘级驱逐舰火力升级2"
Locale_Text[2109] = "升级星尘级驱逐舰的修复速度"
Locale_Text[2111] = "星尘级驱逐舰修复速度升级1"
Locale_Text[2112] = "星尘级驱逐舰修复速度升级2"

Locale_Text[2200] = "扫荡者级战列舰科技"
Locale_Text[2201] = "建造拥有厚重装甲的扫荡者级战列舰"
Locale_Text[2202] = "扫荡者级战列舰机架"
Locale_Text[2203] = "升级扫荡者级战列舰的装甲"
Locale_Text[2204] = "扫荡者级战列舰装甲升级1"
Locale_Text[2205] = "扫荡者级战列舰装甲升级2"
Locale_Text[2206] = "升级扫荡者级战列舰的火力"
Locale_Text[2207] = "扫荡者级战列舰火力升级1"
Locale_Text[2208] = "扫荡者级战列舰火力升级2"
Locale_Text[2209] = "升级扫荡者级战列舰的修复速度"
Locale_Text[2211] = "扫荡者级战列舰修复速度升级1"
Locale_Text[2212] = "扫荡者级战列舰修复速度升级2"

Locale_Text[2300] = "巡回者级袭击舰科技"
Locale_Text[2301] = "建造拥有厚重装甲的巡回者级袭击舰"
Locale_Text[2302] = "巡回者级袭击舰机架"
Locale_Text[2303] = "升级巡回者级袭击舰的装甲"
Locale_Text[2304] = "巡回者级袭击舰装甲升级1"
Locale_Text[2305] = "巡回者级袭击舰装甲升级2"
Locale_Text[2306] = "升级巡回者级袭击舰的火力"
Locale_Text[2307] = "巡回者级袭击舰火力升级1"
Locale_Text[2308] = "巡回者级袭击舰火力升级2"
Locale_Text[2309] = "升级巡回者级袭击舰的修复速度"
Locale_Text[2311] = "巡回者级袭击舰修复速度升级1"
Locale_Text[2312] = "巡回者级袭击舰修复速度升级2"



Locale_Text[2485] = "升级导弹反舰平台所使用的弹药,提升反舰威力"
Locale_Text[2486] = "中型导弹反舰平台火力升级1"
Locale_Text[2487] = "中型导弹反舰平台火力升级2"
Locale_Text[2490] = "给中型导弹反舰平台附加装甲,增加防御能力"
Locale_Text[2491] = "中型导弹反舰平台装甲提升1"
Locale_Text[2492] = "中型导弹反舰平台装甲提升2"

Locale_Text[2450] = "装备有大型防御武器的防御平台，火力强大"
Locale_Text[2451] = "大型防御塔"

Locale_Text[2685] = "升级1400毫米火炮平台所使用的弹药,提升反舰威力"
Locale_Text[2686] = "1400毫米火炮平台平台火力升级1"
Locale_Text[2687] = "1400毫米火炮平台平台火力升级2"
Locale_Text[2690] = "给1400毫米火炮平台平台附加装甲,增加防御能力"
Locale_Text[2691] = "1400毫米火炮平台平台装甲提升1"
Locale_Text[2692] = "1400毫米火炮平台平台装甲提升2"

Locale_Text[2785] = "升级大型离子炮防御平台所使用的弹药,提升反舰威力"
Locale_Text[2786] = "大型离子炮防御平台平台火力升级1"
Locale_Text[2787] = "大型离子炮防御平台平台火力升级2"
Locale_Text[2790] = "给大型离子炮防御平台平台附加装甲,增加防御能力"
Locale_Text[2791] = "大型离子炮防御平台平台装甲提升1"
Locale_Text[2792] = "大型离子炮防御平台平台装甲提升2"

Locale_Text[2885] = "升级白河导弹发射塔所使用的弹药,提升反舰威力"
Locale_Text[2886] = "白河导弹发射塔平台火力升级1"
Locale_Text[2887] = "白河导弹发射塔平台火力升级2"
Locale_Text[2890] = "给白河导弹发射塔平台附加装甲,增加防御能力"
Locale_Text[2891] = "白河导弹发射塔平台装甲提升1"
Locale_Text[2892] = "白河导弹发射塔平台装甲提升2"
-----------------------------------------------------------

Locale_Text[4000] = "航母强化科技"
Locale_Text[4001] = "解锁航母的强化套件，让弥璃级航母变成拥有强大作战能力的前线战舰"
Locale_Text[4002] = "航母强化模块"

------------护卫舰科技--------------------------------------------------------

Locale_Text[4010] = "轻型轨道炮武器系统"
Locale_Text[4011] = "护卫舰可以装备的小型轨道炮机架，可以有效的依靠数量优势狙击旗舰"
Locale_Text[4012] = "先进护卫舰科技"

------------主力舰科技--------------------------------------------------------


Locale_Text[5000] = "袖珍战列舰舰体科技"
Locale_Text[5001] = "一种可以搭载大量重型炮塔的袖珍战列舰船体机架"
Locale_Text[5002] = "袖珍战列舰机架"



Locale_Text[5010] = "装甲型型袭击舰舰体科技"
Locale_Text[5011] = "第三代的阔刃级袭击舰船体的装甲型，拥有厚重的装甲和可靠的防御"

Locale_Text[5100] = "星辰级防空驱逐舰科技"
Locale_Text[5101] = "建造拥有厚重装甲的星辰级防空驱逐舰"
Locale_Text[5102] = "星辰级防空驱逐舰机架"
Locale_Text[5103] = "升级星辰级防空驱逐舰的装甲"
Locale_Text[5104] = "星辰级防空驱逐舰装甲升级1"
Locale_Text[5105] = "星辰级防空驱逐舰装甲升级2"
Locale_Text[5106] = "升级星辰级防空驱逐舰的火力"
Locale_Text[5107] = "星辰级防空驱逐舰火力升级1"
Locale_Text[5108] = "星辰级防空驱逐舰火力升级2"
Locale_Text[5109] = "升级星辰级防空驱逐舰的修复速度"
Locale_Text[5111] = "星辰级防空驱逐舰修复速度升级1"
Locale_Text[5112] = "星辰级防空驱逐舰修复速度升级2"


Locale_Text[5200] = "工程科技"
Locale_Text[5201] = "强大的远程修复系统，可以高效率修复受损的战舰"
Locale_Text[5202] = "大型超远程修复系统科技"

Locale_Text[5314] = "提升伊利亚级廵空舰20%的装甲，增强防御力"
Locale_Text[5315] = "伊利亚级廵空舰装甲提升1"
Locale_Text[5316] = "提升伊利亚级廵空舰50%的装甲，增强防御力"
Locale_Text[5317] = "伊利亚级廵空舰装甲提升2"
Locale_Text[5318] = "让伊利亚级廵空舰拥有一个容量为20WHP的防护盾"
Locale_Text[5319] = "伊利亚级廵空舰护盾科技"
Locale_Text[5320] = "增加伊利亚级廵空舰30%的攻击力"
Locale_Text[5321] = "伊利亚级廵空舰武器科技"
Locale_Text[5322] = "提升伊利亚级廵空舰5倍的修复能力"
Locale_Text[5323] = "伊利亚级廵空舰自我修复提升1"
Locale_Text[5324] = "提升伊利亚级廵空舰10倍的修复能力"
Locale_Text[5325] = "伊利亚级廵空舰自我修复提升2"


Locale_Text[5335] = "掠夺者级重型巡洋舰机架"
Locale_Text[5336] = "量产型重装甲巡洋舰机架"

Locale_Text[5345] = "导弹攻城舰机架"
Locale_Text[5346] = "一种可以发射大量反旗舰导弹的攻城舰"
Locale_Text[5347] = "攻城舰科技"

Locale_Text[5355] = "袖珍战列舰科技"
Locale_Text[5356] = "安吉丽娜级袖珍战列舰"
Locale_Text[5357] = "袖珍战列舰机架"


Locale_Text[5365] = "重型航母机架"
Locale_Text[5366] = "安吉丽娜级重型航母"
Locale_Text[5367] = "重型航母平台"

Locale_Text[5370] = "滚滚型机架"
Locale_Text[5375] = "拥有厚重全方位装甲的移动防空平台，可以在大量舰载机的围攻中生存下来"
Locale_Text[5376] = "滚滚级防空舰机架"



------------旗舰--------------------------------------------------------


Locale_Text[6200] = "超级航母科技"
Locale_Text[6201] = "建造拥有厚重装甲的索托亚级超级航母"
Locale_Text[6202] = "索托亚级超级航母机架"
Locale_Text[6203] = "升级索托亚级超级航母的装甲"
Locale_Text[6204] = "超级航母装甲升级1"
Locale_Text[6205] = "索超级航母装甲升级2"
Locale_Text[6209] = "升级索托亚级超级航母的修复速度"
Locale_Text[6211] = "超级航母修复速度升级1"
Locale_Text[6212] = "超级航母修复速度升级2"


Locale_Text[6351] = "女皇级科技"
Locale_Text[6352] = "可以召唤裂第三代女皇级巨舰，这种略显老旧的巨舰在进行现代化改造后在战场上依然表现出色"
Locale_Text[6353] = "女皇级巨舰龙骨"


------------生存--------------------------------------------------------
Locale_Text[6510] = "生存母舰升级"
Locale_Text[6511] = "提升生存母舰的装甲"

Locale_Text[6520] = "生存母舰装甲升级1"
Locale_Text[6521] = "生存母舰装甲升级2"
Locale_Text[6522] = "生存母舰装甲升级3"
Locale_Text[6523] = "生存母舰装甲升级4"
Locale_Text[6524] = "生存母舰装甲升级5"
Locale_Text[6525] = "生存母舰装甲升级6"
Locale_Text[6526] = "生存母舰装甲升级7"
Locale_Text[6527] = "生存母舰装甲升级8"
Locale_Text[6528] = "生存母舰装甲升级9"
Locale_Text[6529] = "生存母舰装甲升级10"
Locale_Text[6610] = "生存母舰升级"
Locale_Text[6611] = "提升生存母舰的速度"

Locale_Text[6620] = "生存母舰速度升级1"
Locale_Text[6621] = "生存母舰速度升级2"
Locale_Text[6622] = "生存母舰速度升级3"
Locale_Text[6623] = "生存母舰速度升级4"
Locale_Text[6624] = "生存母舰速度升级5"
Locale_Text[6625] = "生存母舰速度升级6"
Locale_Text[6626] = "生存母舰速度升级7"
Locale_Text[6627] = "生存母舰速度升级8"
Locale_Text[6628] = "生存母舰速度升级9"
Locale_Text[6629] = "生存母舰速度升级10"
Locale_Text[6710] = "生存母舰升级"
Locale_Text[6711] = "提升生存母舰的召唤速度"

Locale_Text[6720] = "生存母舰召唤速度升级1"
Locale_Text[6721] = "生存母舰召唤速度升级2"
Locale_Text[6722] = "生存母舰召唤速度升级3"
Locale_Text[6723] = "生存母舰召唤速度升级4"
Locale_Text[6724] = "生存母舰召唤速度升级5"
Locale_Text[6725] = "生存母舰召唤速度升级6"
Locale_Text[6726] = "生存母舰召唤速度升级7"
Locale_Text[6727] = "生存母舰召唤速度升级8"
Locale_Text[6728] = "生存母舰召唤速度升级9"
Locale_Text[6729] = "生存母舰召唤速度升级10"

Locale_Text[6810] = "生存母舰升级"
Locale_Text[6811] = "提升生存母舰的修理速度"

Locale_Text[6820] = "生存母舰修理速度升级1"
Locale_Text[6821] = "生存母舰修理速度升级2"
Locale_Text[6822] = "生存母舰修理速度升级3"
Locale_Text[6823] = "生存母舰修理速度升级4"
Locale_Text[6824] = "生存母舰修理速度升级5"
Locale_Text[6825] = "生存母舰修理速度升级6"
Locale_Text[6826] = "生存母舰修理速度升级7"
Locale_Text[6827] = "生存母舰修理速度升级8"
Locale_Text[6828] = "生存母舰修理速度升级9"
Locale_Text[6829] = "生存母舰修理速度升级10"

