Locale_Text = {}

------------------------------------------------------
--战斗机科技--
------------------------------------------------------		
--炮艇科技--
------------------------------------------------------	
--护卫舰科技--
------------------------------------------------------		
--驱逐舰科技--
------------------------------------------------------		
--巡洋舰科技--
------------------------------------------------------		
--战列舰科技--

Locale_Text[290] = "战列舰科技"
Locale_Text[291] = "建造性能优秀的主教级战列舰"
Locale_Text[292] = "战列舰机架"
Locale_Text[293] = "升级主力舰的装甲"
Locale_Text[294] = "主力舰装甲升级1"
Locale_Text[295] = "主力舰装甲升级2"
Locale_Text[296] = "升级主力舰的火力"
Locale_Text[297] = "主力舰火力升级1"
Locale_Text[298] = "主力舰火力升级2"
Locale_Text[300] = "主力舰装甲升级3"
Locale_Text[301] = "主力舰装甲升级4"
Locale_Text[305] = "主力舰火力升级3"
Locale_Text[306] = "主力舰火力升级4"

Locale_Text[6001] = "巨型战列舰船体"
Locale_Text[6002] = "自行研发的放逐级战列舰的船体机架，允许建造强大的帕拉丁级战列舰"
Locale_Text[6003] = "战列舰机架"


Locale_Text[6101] = "无畏舰召唤科技"
Locale_Text[6102] = "召唤缴获来的维格尔无畏舰进入战场"
Locale_Text[6103] = "旗舰级战舰召唤"


Locale_Text[6105] = "泰坦母舰机架"
Locale_Text[6106] = "强化泰坦母舰的机架，让其可以搭载先进强大的武器系统进行战斗。"
Locale_Text[6107] = "旗舰级战舰召唤"

------------------------------------------------------		


------------------------------------------------------		
--平台科技--

Locale_Text[7001] = "维格尔炮塔机架"
Locale_Text[7002] = "用维格尔人提供的技术部署一系列小型防御平台"
Locale_Text[7003] = "平台科技"

Locale_Text[7101] = "平台装甲科技"
Locale_Text[7102] = "换装先进的高级复合装甲提升防御力"
Locale_Text[7103] = "平台1级装甲科技"
Locale_Text[7104] = "平台2级装甲科技"
Locale_Text[7105] = "平台3级装甲科技"

Locale_Text[7111] = "平台自我修复科技"
Locale_Text[7112] = "升级船内的损管设备,加快受损时的修复速度"
Locale_Text[7113] = "平台修复速度提升1"
Locale_Text[7114] = "平台修复速度提升2"
Locale_Text[7115] = "平台修复速度提升3"

Locale_Text[7500] = "重型防御平台科技"
Locale_Text[7501] = "一种可以抵抗大规模舰队攻击的重型导弹防御平台"
Locale_Text[7502] = "重型防御平台机架"

------------------------------------------------------		
